{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/becbbab3e7f5a68d5e3af45c16ad133d.jpeg', 'title': 'CCT2019', 'description': 'Legacy challenges from the US Navy Cyber Competition Team 2019 Assessment sponsored by US TENTH Fleet', 'code': 'cct2019', 'users': 3496, 'tags': ['security', 'pcap', 'ctf', 're', 'forensics', 'crypto', 'steganography'], 'type': 'challenge', 'difficulty': 'insane', 'userCompleted': False, 'upVotes': 126, 'created': '2020-03-10T18:13:08.139Z', 'published': '2020-03-11T16:55:01.573Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://i.imgur.com/n674uAu.png', 'creator': 'zoobah', 'tasks': [{'taskTitle': 'CCT2019 - pcap1', 'taskDesc': "<p>This is a pcap-focused challenge originally created for the U.S. Navy Cyber Competition Team 2019 Assessment. Although the assessment is over, the created challenges are provided for community consumption here.</p><p>If you find the right clues, they will guide you to the next step. I did include some red herrings in this challenge, but you can stay on track by focusing on pcap-related skills.</p><p>HINT1: It's a pcap challenge. If you're doing stego or re, you're either down a rabbit hole or there's an easier way.</p><p>HINT2: It is very important to do the first step correctly. If you don't recover the first file in its entirety, you may not be able to complete steps later on in the challenge. The second pcap file has 4588 packets in it. Contact me on Discord (send a DM to username zoobah) if you are struggling with this step.</p><p>HINT3: On the final step, this was built to run in a amd64 Kali Linux environment. If you are using a different Linux distro, you may run into some problems.</p>", 'taskType': 'downloadable', 'taskNo': 1, 'taskCreated': '2020-03-10T20:27:41.296Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '5e67d79f7da1872e4f92ee99', 'questions': [{'questionNo': 1, 'question': '<p>Find the flag.</p>', 'hint': ''}]}, {'taskTitle': 'CCT2019 - re3', 'taskDesc': '<p>There\'s some kind of a high security lock blocking the way. Defeat the GUI to claim your key!</p><p><span style="font-size:1rem;">NOTE: The key is a 32-character hex blob and doesn\'t follow the CCT{.*} format. It\'ll be apparent when you\'ve found it.</span></p><p><span style="font-size:1rem;">If you need a Windows machine to help reverse engineering this, please use the <a href="https://tryhackme.com/room/windowsbase" target="_blank">Windows base room</a>.</span></p>', 'taskType': 'downloadable', 'taskNo': 2, 'taskCreated': '2020-03-10T21:19:33.975Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '5e6803fc1a9c2f2e4366fdbc', 'questions': [{'questionNo': 1, 'question': '<p>What is the key to re3? (Hey, that rhymes)</p>', 'hint': ''}]}, {'taskTitle': 'CCT2019 - for1', 'taskDesc': '<p>UPDATE: There was a bug found in cryptii that has now been fixed, but will cause issues on the final step of the challenge. For now, when you find the the cipher text FSXL PXTH EKYT DJXS PYMO JLAY VPRP VO, replace it with this cipher text instead:\xa0JHSL PGLW YSQO DQVL PFAO TPCY KPUD TF. Everything else at that step, e.g., the\xa0configuration file can remain as-is. I intend to update the challenge file to correct this issue, but this will serve as a temporary fix until that time.</p>\n<p>Our former employee Ed is suspected of suspicious activity. We found this image on his work desktop and we believe it is something worth analyzing. Can you assist us in extracting any information of value?</p>\n<p>HINT1: if you\'re not sure if a password is upper- or lower-case, try all lower-case.</p>\n<p>HINT2: There are many steps that can be done concurrently in this challenge. If you find you need something, you may have not found the key to unlock it yet. If you have something useful and you\'re not sure where to use it, it\'s possible the file you need is still hidden somewhere.</p>\n<p><span class="size" style="font-size:1rem">HINT3: https://cryptii.com/ - Cool website, bro</span></p>\n<p><span class="size" style="font-size:1rem">HINT4: the flag will follow the format CCT{.*}</span></p>\n', 'taskType': 'downloadable', 'taskNo': 3, 'taskCreated': '2020-03-10T21:41:57.634Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '5e68049aac44e12e598118d9', 'questions': [{'questionNo': 1, 'question': '<p>What is the flag?</p>\n', 'hint': ''}]}, {'taskTitle': 'CCT2019 - crypto1', 'taskDesc': '<p>Find ye some flags. There are three parts to this challenge, each with its own flag. Solve crypto1a obtain the crypto1a flag and to unlock crypto1b. Solve crypto1b to obtain the crypto1b flag and unlock crypto1c. Solve crypto1c and you\'ll have all three flags.</p><p>HINT1: crypto1a and crypto1b can be solved with freely available online tools</p><p>HINT2: For crypto1c, you probably have to code a solution to solve it as I\'m not aware of any online tools for this variant. It\'s not complex to solve if you can figure out the scheme and it is possible to solve by hand although it could be a bit tedious.</p><p>HINT3: For crypto1c, start with "0" not "1".</p>', 'taskType': 'downloadable', 'taskNo': 4, 'taskCreated': '2020-03-10T22:24:34.630Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '5e6810e413fcea10c97a9ad0', 'questions': [{'questionNo': 1, 'question': 'What is the flag for crypto1a?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What is the flag for crypto1b?</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>What is the flag for crypto1c?</p>', 'hint': ''}]}]}