{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/c37f3bd6e21e89c0a8de1607bf56fbab.svg', 'title': 'Intro to IR and IM', 'description': 'An introduction to Incident Response and Incident Management.', 'code': 'introtoirandim', 'users': 6713, 'tags': ['security', 'incident', 'incident response', 'incident management'], 'type': 'walkthrough', 'difficulty': 'info', 'userCompleted': False, 'upVotes': 203, 'created': '2023-06-22T18:20:22.496Z', 'published': '2023-09-11T15:50:15.062Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://tryhackme-images.s3.amazonaws.com/user-uploads/6093e17fa004d20049b6933e/room-content/2d81f1a0a7498dc95991d82251650bb0.png', 'creator': 'am03bam4n', 'tasks': [{'taskTitle': 'Introduction', 'taskDesc': '<p>Cyber Incidents are a part of life at this point. The question is no longer if an organisation will have an incident but when. Luckily, we have gotten significantly better at dealing with these incidents with well-established processes and technology, referred to as Incident Response and Incident Management. In this room, we will provide an introduction to these processes. While there have been a lot of technological advancements, humans are still required for proper management and response processes during an incident.</p><p><span style="font-size:24px">Pre-perquisites</span></p><ul><li><a href="https://tryhackme.com/jr/defensivesecurity" target="_blank">Intro to Defensive Security</a><br /></li></ul><p><span style="font-size:24px">Learning Objectives</span></p><ul><li>A basic understanding of incident response and incident management</li><li>Understanding the difference between response and management</li><li>Understanding the different roles during an incident</li><li>Understand the process of incident management</li><li>Understand the common issues that can occur during an incident and how to prevent these pitfalls<br /></li></ul>', 'taskType': 'none', 'taskNo': 1, 'taskCreated': '2023-06-22T18:22:48.826Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'I am ready to learn about Incident Response and Incident Management!<br />', 'hint': ''}]}, {'taskTitle': 'What is Incident Response and Management', 'taskDesc': '<p><span style="font-size:24px">What is a Cyber Incident?</span></p><p>Before diving into incident response and management, it is worth first talking about what a cyber incident is. We don\'t usually start with a cyber incident; there is a build-up before we get to this point. </p><p><img style="width:40%;float:left" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/6093e17fa004d20049b6933e/room-content/26b59b5363679f01caddcbde9f76c0a2.png" alt="SOC team" class="note-float-left" />Usually, everything first starts at the SOC (Security Operations Centre). Here, a team of analysts monitor the security of the organisation. In essence, this team is monitoring <b><i>events</i></b> in the organisation\'s estate. If an event is an anomaly or unexpected, an <b><i>alert</i></b> is generated. Alerts can still be incorrect, thus these are then further investigated by the analysts. However, if the alert is real, the team will perform a triage process to determine the severity. If the severity of the alert is sufficient, an <i><b>incident</b></i> will be raised.</p><p>The SOC can therefore be seen as the filter. Not all events make it to incidents. For example, organisations often receive thousands of phishing emails every day. Most of these are automatically blocked by intrusion prevention systems such as their spam filter. Even if the user were to interact with most of these emails and execute malware, for example, the Anti Virus or Endpoint Detection and Response software would automatically block this. In these cases, an alert will be generated, and the SOC team will deal with it, such as updating mail filtering rules or signatures of the AV or EDR. </p><p>An incident, on the other hand, is when in the triage phase, we discover that there may still be further impact from the alert and when we don\'t have all <img style="float:right;width:40%" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/6093e17fa004d20049b6933e/room-content/24038ac27be5cfac14434bece4c40e3d.png" alt="Infected machine" class="note-float-right" />of the information required to deal with it. For example, let\'s say that an alert was generated that an anomalous logon occurred to one of our servers, we have quite several questions that still need answering:</p><ol><li>Whose account was used?</li><li>Where did the logon occur from?</li><li>Where was that account being used before the logon?</li><li>Has there been any other potentially anomalous activity seen with that account?<br /></li></ol><p>If there is sufficient severity, the alert can be raised to an incident. Later, we will discuss the different levels of response to incidents.<br /></p><p><span style="font-size:24px">Incident Response and Management</span></p><p>When an alert\'s severity is high enough to become an incident, that is where Incident Response and Incident Management usually kick in. Often, these two are combined and simply called Incident Response. However, there are distinct features to both of these that are worth discussing.<br /></p><p><span style="font-size:18px"><b>Incident Response</b></span></p><p>Incident Response covers the technical aspect of dealing with an incident. This is the portion that is responsible for answering the primary question: </p><p align="center"><i><b>What happened?</b></i></p><p>To answer this question, the incident response team uses several techniques and technologies. These investigations often begin in the SOC by reviewing the information provided with the event that triggered the alert. This could be provided with one of the following tools:</p><ul><li>EDR or AV Alert - Usually these tools would create an alert for anomalous activity that has occurred on a specific host. For example, the EDR could alert that there were attempts made to monitor the keystrokes of a user.</li><li>Network Tap Alert - Network taps provide alerts for anomalous network activity. For example, there could be an alert that a host is scanning other hosts in the estate.</li><li>SIEM Alert - The Security Information and Event Management (SIEM) system could alert on a custom rule that was created by the analysts. For example, an impossible travel rule where a user\'s account is being logged in from two different countries simultaneously.</li></ul><p>When an alert is created, a lot of information is provided to the analyst. The first step is to investigate this information to better understand what is happening. In these systems, when an alert is generated, other key pieces of information are also attached to the alert. For example, in the case of the SIEM alert, the analyst would be able to review not only the latest logon events with the user\'s account, but the history of their logon events for the last couple of months. </p><p>However, sometimes the alert information is not sufficient and we have to gather more information than what is currently provided. This process is usually referred to as Digital Forensics. Here, we perform a much more hands-on investigation that can include the following:</p><ul><li>Recovering the hard disk from the infected host to investigate how the malware got on there in the first place.</li><li>Recovering the data from volatile memory (such as from the computer\'s RAM) from the infected host to investigate how the malware works.</li><li>Recovering system and network logs from several devices to uncover how the malware spread.</li></ul><p>The overall goal of Incident Response is to try and understand the scope of the incident. If we do not accurately understand the scope, the Incident Management process cannot take adequate steps to close off the incident. Both extremes can be incredibly damaging. If we misunderstand the scope to be larger than what it is, we could authorise more drastic actions than required, which would disrupt the business. If we misunderstand the scope to be smaller than what it is, we could take insufficient actions against the threat actor, meaning the incident would not be over.<br /></p><p><span style="font-size:18px"><b>Incident Management</b></span></p><p>Incident Management covers the process aspect of dealing with an incident. This is the portion that is responsible for answering the primary question:</p><p align="center"><i><b>How do we respond to what happened?</b></i><br /></p><p>Once we understand the scope of the incident, the next question is how we will manage the incident. Incident Management has to take care of several things, such as:</p><ul><li>Triaging the incident to accurately update the severity of the incident as new information becomes available and getting more stakeholders involved to help deal with the incident, such as Subject Matter Experts (SMEs).</li><li>Guiding the incident actions through the use of playbooks.<br /></li><li>Deciding which containment, eradication, and recovery actions will be taken to deal with the incident.</li><li>Deciding the communication that will be sent internally and externally while the team deals with the incident.</li><li>Documenting the information about the incident, such as the actions taken and the effect that they had on dealing with the incident.</li><li>Closing the incident and taking the information to learn from the incident and improve future processes and procedures.</li></ul><p>Effective incident response and management are required to deal with an incident. It is often mistaken that only technical skills are required to deal with incidents. The management aspect is just as important. This will be discussed in more detail in Task 5.<br /></p><p><span style="font-size:24px">Levels of Incidents Response and Management<br /></span></p><p>Just as not all alerts are equal, all incidents are also not equal. As such, the process of incident response and management will differ based on the severity of the incident. However, the severity is also not static and subject to change as incident response aids in better understanding the scope of the incident. As such, there are different levels of incident response and management. There are many different ways to classify the levels, and in each organisation, it will be unique. However, we will primarily focus on four different levels for this room. At each of these levels, we say a different team is invoked, meaning more important stakeholders get involved in the process. Furthermore, the actions available to deal with the incident become more powerful, but also more disruptive. The levels described here are what can be found in large organisations. For levels one to three, it is still the same SOC dealing with the incident, just the amount of team members involved in the incident.<br /></p><p><b>We will use an example in this case</b>: A user has reported a phishing email<br /></p><p><span style="font-size:18px"><b>Level 1: SOC Incident</b></span></p><p>At level one, these are often not even classified as incidents. Usually, these require a purely technical approach. At this level,\xa0 upon investigation of our example, the analyst finds that it is an isolated event and therefore simply updates the mail filtering rules to block the sender. These levels of incidents can happen several times a day and are usually quick to deal with and the analyst deals with this themselves.</p><p>However, in our example, a Computer Emergency Readiness Team (CERT) Incident may be invoked if the investigation found that several users received the email.<br /></p><p><span style="font-size:18px"><b>Level 2: CERT Incident</b></span></p><p>At level two, several analysts in the SOC may be involved in the investigation. A CERT Incident is one where we don\'t yet have enough to raise the alarm bells. Still, we are concerned and therefore performing additional investigation to determine the scope of the incident. Usually, the analyst would request assistance and more members of the SOC team would get involved. In our example, at this point, we would be investigating if any of those users interacted with the email. We would also like to better understand what the email does. </p><p>If we were able to stop the incident before any of the users interacted with the email, we would usually stop at this level. However, if we discover that the email contains malware and that some of the users actually interacted with the email, we would invoke a Computer Security Incident Response Team (CSIRT) incident.<br /></p><p><span style="font-size:18px"><b>Level 3: CSIRT Incident</b></span></p><p>At level three, the entire SOC is placed on high alert and actively working to resolve the incident. At this point, the entire SOC team will focus on the single incident to deal with it. Analysts and the forensic team work to uncover the full scope of the incident and the management team is taking action against the threat actor to contain the spread of the malware, eradicate it from hosts where it is discovered, and recover affected systems. </p><p>If the team is able to stop the spread of the attack before any disruptions can occur or the threat actor can escalate their privileges within the estate, the CSIRT team will close the incident. However, if it is determined that the scope is larger through investigation, we would invoke a Crisis Management Team (CMT) Incident.<br /></p><p><span style="font-size:18px"><b>Level 4: CMT Incident</b></span><br /></p><p>At level four, it is all hands on deck and officially a full-scale cyber crisis. The CMT would usually consist of several key business stakeholders such as the entire executive suite, members from the legal and communication teams, as well as other external parties, such as the regulator or police. Furthermore, at this level, we start to move into the territory of what is called "nuclear" actions. Rather than simple actions to contain, eradicate, and recover, this team can authorise the use of nuclear actions, such as taking the entire organisation offline to limit the incident\'s damage.<br /></p><p><span style="font-size:24px">Benefits of Incident Response and Management</span><br /></p><p>Building a team and everything required for Incident Response and Incident Management is not cheap. It is also often difficult to tangibly explain to a business why this is needed. However, the cost of an incident can be so severe that an organisation can completely close their doors after one. This also isn\'t just a "big company" problem. To put it in perspective, according to the <a href="https://staysafeonline.org/" target="_blank">National CyberSecurity Alliance</a>, roughly 60% of small companies that have suffered a cyber attack close their business after just six months. The importance of good incident response and management cannot be overstated.</p>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2023-06-22T18:22:59.210Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'At what level (number only) of an incident would the SOC be placed at high alert and to deal with an incident?<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>At what level (number only) of an incident would it be classified as a cyber crisis?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Which component (IR or IM) is responsible for trying to answer the question: How do we respond to what happened?<br /></p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>Which component (IR or IM) is responsible for trying to answer the question: What happened?<br /></p>', 'hint': ''}]}, {'taskTitle': 'The Different Roles During an Incident', 'taskDesc': '<p>Many roles are required to perform effective Incident Response and Incident Management. The table below covers some of these roles that you should familiarise yourself with:</p><table class="table table-bordered"><tbody><tr><td><b>Role</b><br /></td><td><b>Description</b><br /></td></tr><tr><td>SOC Analyst<br /></td><td>A SOC analyst is a person that deals with the various events and alerts that happen in the SOC. There are usually different levels of analysts. Ultimately, analysts are usually some of the first members that would get involved in dealing with an incident.<br /></td></tr><tr><td>SOC Lead<br /></td><td>The SOC lead, also called the SOC Manager or Head of SOC, is responsible for dividing the tasks in the SOC and deciding to escalate an alert to the level of incident. Usually, the SOC manager understands the technical information required to perform an investigation to better help them divide the different tasks during an incident.<br /></td></tr><tr><td>Forensic Analyst<br /></td><td>A forensic analyst is a person that performs an investigation to better understand what happened during an incident. This is often digital forensics that must be investigated by reviewing artefacts such as the memory or hard drive of a device.<br /></td></tr><tr><td>Malware Analyst<br /></td><td>A malware analyst is a forensic analyst who focuses on understanding how the malware works. These analysts often have significant technical capabilities to debug and decompile malware to understand how it works. These analysts often help to uncover Indicators of Compromise (IoCs) that are signatures of the malware that can be used to identify the malware in the environment.<br /></td></tr><tr><td>Threat Hunter<br /></td><td>A threat hunter is a person that actively tries to uncover new threats in the environment. The goal of threat hunting is to try and create new alert rules based on information available in logs and other sources. By performing threat hunting, an alert would be generated that could help the team discover an attacker that attempted to use the same technique.<br /></td></tr><tr><td>First Responder<br /></td><td>In certain cases, it isn\'t actually the SOC that is first alerted to an incident. Often, a cyber incident could have started as a business incident. For example, a product team discovers that their application has slowed down and isn\'t responding as it should. In these cases, that team becomes the First Responders to the incident. While they would not be expected to deal with the entire incident by themselves, there are some key steps that first responders should take to ensure that they don\'t compromise information that will be required to better understand the cyber incident.<br /></td></tr><tr><td>Security Engineer<br /></td><td>While security engineers are not directly involved with the SOC, they can often be involved in incidents. Security engineers are responsible for the security of their division, application, or system. In the event that there is an incident in their area, they will often be relied upon as a subject matter expert to aid in the investigation. Furthermore, security engineers will often work closely with the SOC to ensure that the SOC is receiving log information from their division.<br /></td></tr><tr><td>Information Security Officer<br /></td><td>Similar to a security engineer, an information security officer (ISO) is responsible for the security of their division. However, this is usually more management focussed than technical, such as security engineers. ISOs are also often involved in incidents as subject matter experts and responsible for acting as the bridge between the Incident Response team and their division team that will have to implement the actions provided by the Incident Manager.<br /></td></tr><tr><td>Incident Manager<br /></td><td>An incident manager is a person that was trained in performing the management duties for Incident Response and Management. Incident Managers have to be exceptional in note-taking and organised to ensure that everything during an incident is properly documented and that the processes are followed.<br /></td></tr><tr><td>Project Owner<br /></td><td>A product owner is usually the person that takes the lead during the development of a solution. In the past, with the waterfall method, products were only released after they were fully completed. However, today, using Agile processes, products are released and continuously updated. As such, since a version of the project is already live as the team is still performing development, incidents can already occur. In the event of an incident, the product owner is often called in as a subject matter expert to help with the investigation.<br /></td></tr><tr><td>Subject Matter Expert<br /></td><td>The blue team cannot be expected to be experts in every single technology or system. As such, Subject Matter Experts (SMEs) are often relied upon based on the specific incident at hand. For example, if, in the incident, Active Directory has been compromised, one of the Domain Admins could be called in as an SME. SMEs are often relied on to provide more information that allows the blue team to better understand the incident scope and what potential actions can be taken against the threat actors.<br /></td></tr><tr><td>Crisis Manager<br /></td><td>A crisis manager is the lead for the crisis management team. This is usually an executive such as the CIO or COO. This person is responsible for ensuring that the CMT functions as they should and can deal with the crisis. <br /></td></tr><tr><td>Executive<br /></td><td><p>In the event that an incident is sufficiently severe, executives of a company will be involved in the CMT. This includes the CEO, COO, CIO, CTO, and CISO.<br /></p></td></tr></tbody></table><p>Open the static site and show you understand the different roles to receive the flag!</p>', 'taskType': 'static-site', 'taskNo': 3, 'taskCreated': '2023-06-22T18:23:11.200Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '64e652347378e20b59b97d8b', 'questions': [{'questionNo': 1, 'question': 'What is the value of the flag you receive after matching the roles and responsibilities?<br />', 'hint': ''}], 'staticSites': [{'_id': '6538e1c16489ff4faaab38a7', 'title': 'IRIM Challenge 1', 'url': 'https://static-labs.tryhackme.cloud/sites/irim-challenge-01/', 'autoOpen': False}]}, {'taskTitle': 'The Process of Incident Management', 'taskDesc': '<p>To effectively deal with an incident, a proper incident management process should be established. Although organisations often create their own process, it is usually based on the <a href="https://nvlpubs.nist.gov/nistpubs/specialpublications/nist.sp.800-61r2.pdf" target="_blank">NIST Incident Management</a> process, as shown in the diagram below.<br /></p><p align="center"><img style="width:80%" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/6093e17fa004d20049b6933e/room-content/dcab2ddeb05cd1300a0d2142d87b447e.png" alt="NIST incident management framework" /><br /></p><p><span style="font-size:24px">Preparation</span></p><p>Preparation is key to effectively deal with an incident. During an incident, it is often stressful and every minute counts to ensure that the incident can be dealt with as fast as possible to reduce the amount of damage. In these stressful environments, it is often easy to forget things, which then could have severe consequences. </p><p>In order to prevent this, a team has to prepare to deal with an incident. The better the team is prepared, the less likely simple mistakes will be made during the incident. In order to prepare, there are several things that the team can perform, such as:</p><ul><li>Identify and document key stakeholders and call trees that will be used during an incident</li><li>Create and update playbooks that aid the team in following a set process for incidents with a known nature</li><li>Exercise the team\'s ability to deal with an incident through tabletop exercises and cyber war games</li><li>Continuously perform threat hunting to help create new alert rules based on modern attacker techniques<br /></li></ul><p><span style="font-size:24px">Detection and Analysis</span></p><p>Often organisations will split the detection and analysis phases into two. This is to introduce a middle step called triaging. As mentioned before, not all alerts will classify as an incident and even if an incident occur, there are different levels of incidents. The triage step is responsible for determining the severity of the incident. However, in the NIST framework, this is incorporated in this detection and analysis phase.</p><p>This is the primary phase for incident response, where we aim to answer the question of what has happened. During this phase, the blue team works to better understand the scope of the incident and provide this information to the incident manager. This can include actions such as the following:</p><ul><li>Reviewing alerts in the AV, EDR, and SIEM dashboards</li><li>Performing a forensic investigation of artefacts both on systems and the network</li><li>Analysing malware that is discovered to better understand how it works and create new signatures that can be used to identify it</li></ul><p><span style="font-size:24px">Containment, Eradication, and Recovery</span></p><p>Once the scope of the incident is better understood, the team will start with containment, eradication, and recovery. This is the primary phase of incident management, where we try to deal with the incident. Often organisations will split this phase into three different ones, each to deal with the following:</p><ul><li>Containment - Actions taken to "stop the bleed". These are actions meant to stop the incident from growing larger.</li><li>Eradication - Actions taken to eradicate the threat actor from the estate.</li><li>Recovery - Actions taken to recover the environment allow the organisation to go back to Business as Usual (BAU).</li></ul><p>The reason these are split into three phases is because their order matters. If you start eradication or recovery before containment, the threat actor will be able to persist. For example, if the threat actor compromised Active Directory and we simply changed each account\'s password (eradication action), the threat actor could simply leverage their current permissions to recover the credentials again. We would first have to ensure that we have closed-off access to the threat actor before taking other actions.</p><p>As you will note in the diagram, phases 2 and 3 are cyclic. This is because when we start to deal with the incident, we will not understand the full scope. However, we also simply can\'t wait to understand the full scope before we start to take any action. Therefore, as the investigation is ongoing, we already start to take some actions and note the effect that they have on the incident. Only once we can return to BAU do we stop this process.<br /></p><p><span style="font-size:24px">Post-Incident Activity</span></p><p>Once an incident has been closed, that isn\'t the end of the incident management process. As a last step, we want to evaluate what happened during the incident in order to learn lessons and improve how we deal with incidents in the future. As such, we learn from these incidents to better prepare ourselves to deal with the next one.</p><p>Open and complete the static site to show you understand the incident management process!<br /></p>', 'taskType': 'static-site', 'taskNo': 4, 'taskCreated': '2023-06-22T18:23:23.198Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '64e652497378e20b59b97d8c', 'questions': [{'questionNo': 1, 'question': 'What is the value of the flag you receive after correctly matching the steps of the incident management process?<br />', 'hint': ''}], 'staticSites': [{'_id': '6538e1c16489ff4faaab38a9', 'title': 'IRIM Challenge 2', 'url': 'https://static-labs.tryhackme.cloud/sites/irm-challenge-02/', 'autoOpen': False}]}, {'taskTitle': 'Common Pitfalls During an Incident', 'taskDesc': '<p>Now that we have discussed Incident Response and Management, let\'s look at some common pitfalls that can happen during an incident.</p><p><span style="font-size:24px">Insufficient Hardening</span></p><p>Insufficient Hardening is something that happens even before the incident. Organisations often prioritise speed and profits over security. Therefore, sometimes security can be seen as a hindrance for the organisation. Once a solution has been deployed, the organisation simply moves on to the next one. However, in security engineering, there is an important step called Hardening. Once a solution is deployed, there may still be some configurations that did not adhere to security best practices but were performed to get the solution up and running faster. The hardening process reverses these configurations to bring them back in line with security best practices.</p><p>In the event that this step is skipped, the likelihood of incidents is increased. This pitfall therefore results in an increased amount of incidents and while most can be stopped before there is actual damage, it only takes one successful incident to be very costly for an organisation. As such, the hardening step should not be skipped. To make it easier, organisations have started to perform Hardening during the development rather than simply at the end. This is known as the Shift Left principle and was discussed in the <a href="https://tryhackme.com/jr/securesdlc" target="_blank">Secure SDLC room.</a><br /></p><p><span style="font-size:24px">Insufficient Logging</span></p><p>In order for the blue team to be alerted to incidents, they first have to receive the relevant information that can result in events and alerts. Often it is seen that organisations are not performing adequate logging of information. This can be seen as "flying blind" since the blue team would not be able to even know that an incident is occurring.</p><p>A common problem is the cost of ingesting log information. Often SIEM providers will charge clients based on the amount of throughput of data. This then results in organisations limiting the amount of logs that are being ingested. Furthermore, it is often costly to have remote devices, such as ATMs, send their log information over a mobile network. All of this can lead to reduced visibility for the blue team. Although some of this log information will be available on the device itself, retention is often reduced and in worse cases, a threat actor might have removed these local logs.</p><p>In the event that there isn\'t sufficient logging, some incidents may only be detected later when there is already an impact. In other cases, it may not be possible to accurately determine the incident scope.<br /></p><p><span style="font-size:24px">Insufficient- and Over-Alerting</span></p><p>Sometimes we receive the logs, but we are not doing anything useful with them. SIEM solutions often ingest incredible amounts of data that can make it feel like investigators are looking for a needle in the haystack. This is why threat hunting is important. Threat hunting helps to identify information that can be converted into new alerts that would let the team know when there is something worth investigating.</p><p>However, the flip side can also be a problem. If an alert generates too much noise by having too many false positives, it can lead to the team ignoring the alert. This is similar to the "cry wolf" situation. In the event that an actual incident occurs raising an alert, the team could simply ignore it until there is a great impact. Threat hunting should therefore be careful not just to create new alerts, but to ensure that their signal-to-noise ratio is optimised.<br /></p><p><span style="font-size:24px">Insufficient Determination of Incident Scope</span></p><p>A big mistake that often happens during incident response and management is not understanding the incident scope. While it is often impossible to fully understand the incident scope, best efforts should be made. In cases where the incident scope is underestimated, the actions taken against the threat actor would not be sufficient to eradicate them from the system. In cases where the incident scope is overestimated, drastic actions could be taken by the team that would result in unnecessary business disruptions.</p><p>Sadly, there isn\'t a quick fix for this problem. Continuous preparation for incidents is required to upskill the team and help address this issue.</p><p>Insufficient Accountability</p><p>Another problem during incidents is inaction. It is incredibly important to understand that there is a difference between discussing containment, eradication, and recovery actions and performing them. Often during incidents, actions will be discussed, but no one person will be made responsible for actually performing the action. This then often leads to the incident growing as everyone thinks something has already been performed, when in fact, it hasn\'t. </p><p>Effective Incident Management and note-taking can help address this issue. The incident manager can document the actions that are taken and ensure that a responsible individual is nominated to not only perform the action, but provide the manager with feedback once the action has been taken.<br /></p><p><span style="font-size:24px">Insufficient Backups</span></p><p>The last common pitfall during incidents is insufficient backups. In the event that an incident results in disruptive actions such as ransomware being deployed, the only saving grace is backups that can be used to recover the estate. However, if backup processes and policies were not clearly established and followed, it would not be possible to recover from the incident. </p><p>Furthermore, sometimes backups are not sufficiently isolated. In modern times where the primary focus is on availability, often legacy backups are removed in favour of new High Availability Disaster Recovery environments. The issue with this however is that if ransomware executes on the main system, it is replicated as such in the DR environment. Therefore, offline and remote backups are just as important today.</p><p>Open and play the static site game to overcome the common pitfalls faced during a cyber incident!</p>', 'taskType': 'static-site', 'taskNo': 5, 'taskCreated': '2023-06-22T18:23:40.385Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '64f06f2c58c8f9e55a8389b8', 'questions': [{'questionNo': 1, 'question': 'What is the value of the flag you receive when you overcome the common pitfalls of a cyber incident?<br />', 'hint': ''}], 'staticSites': [{'_id': '6538e1c16489ff4faaab38ab', 'title': 'IRIM Challenge 3', 'url': 'https://static-labs.tryhackme.cloud/apps/irm-challenge-03/', 'autoOpen': False}]}, {'taskTitle': 'Conclusion', 'taskDesc': '<p>In this room, we have learned about incident response and incident management. To summarise:</p><ul><li>Incidents are a part of life. Incidents will happen, and therefore we need to prepare to deal with them.</li><li>Not all events and alerts will lead to an incident. Even when there is an incident, we have different response levels that we can use to deal with the incident.</li><li>Incident response focuses on answering the question of what has happened during an incident. Incident management focuses on effectively taking actions to close off the incident.</li><li>There are many different roles and responsibilities during an incident. Even if you are not part of the blue team, you may be a first responder or may be called upon as a subject matter expert to help the blue team deal with an incident.<br /></li><li>Most organisations have their own incident management framework, but most are based on the NIST incident management framework that covers the four phases of Preparation, Detection &amp; Analyses, Containment, Eradication &amp; Recovery, and Post Incident Analysis.</li><li>Several things can go wrong during an incident, and preparation can assist in reducing the impact that these pitfalls can have.<br /></li></ul>', 'taskType': 'none', 'taskNo': 6, 'taskCreated': '2023-06-22T18:23:52.694Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'I understand Incident Response and Incident Management!<br />', 'hint': ''}]}]}