{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/f054e83e6b7c61f643222f8141105daf.png', 'title': 'Intro to Digital Forensics', 'description': 'Learn about digital forensics and related processes and experiment with a practical example.', 'code': 'introdigitalforensics', 'users': 164632, 'tags': ['security', 'digital forensics', 'forensics', 'metadata', 'EXIF'], 'type': 'walkthrough', 'difficulty': 'easy', 'userCompleted': False, 'upVotes': 2817, 'created': '2022-02-16T15:09:19.034Z', 'published': '2022-03-16T21:11:21.709Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://assets.tryhackme.com/room-banners/intro-to-defensive-security.png', 'creator': 'strategos', 'tasks': [{'taskTitle': 'Introduction To Digital Forensics', 'taskDesc': '<p><lottie-player src="https://lottie.host/9ab05958-80d0-4840-845a-d2ad77284583/xwv4Tx7B6Y.json" background="transparent" speed="1" style="width:75%" loop autoplay></lottie-player></p>\n\n<p>Forensics is the application of science to investigate crimes and establish facts. With the use and spread of digital systems, such as computers and smartphones, a new branch of forensics was born to investigate related crimes: computer forensics, which later evolved into, <em>digital forensics</em>.</p>\n\n<p>Think about the following scenario. The law enforcement agents arrive at a crime scene; however, part of this crime scene includes digital devices and media. Digital devices include desktop computers, laptops, digital cameras, music players, and smartphones, to name a few. Digital media includes CDs, DVDs, USB flash memory drives, and external storage. A few questions arise:</p>\n\n<ul>\n<li>How should the police collect digital evidence, such as smartphones and laptops? What are the procedures to follow if the computer and smartphone are running?</li>\n<li>How to transfer the digital evidence? Are there certain best practices to follow when moving computers, for instance?</li>\n<li>How to analyze the collected digital evidence? Personal device storage ranges between tens of gigabytes to several terabytes; how can this be analyzed?</li></ul>\n\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5f04259cf9bf5b57aed2c476/room-content/829663d17235fb1f1bcd9db23ffbdb13.png" style="width:75%" /><br /></p>\n\n<p>Assuming this employee is suspected in the figure above, we can quickly see the digital devices that might be of interest to an investigation. We notice a tablet, a smartphone, a digital camera, and a USB flash memory in addition to a desktop computer. Any of these devices might contain a trove of information that can help with an investigation. Processing these as evidence would require digital forensics.</p>\n\n<p>More formally, digital forensics is the application of computer science to investigate digital evidence for a legal purpose. Digital forensics is used in two types of investigations:</p>\n\n<ol>\n<li><strong>Public-sector investigations</strong> refer to the investigations carried out by government and law enforcement agencies. They would be part of a crime or civil investigation.</li>\n<li><strong>Private-sector investigations</strong> refer to the investigations carried out by corporate bodies by assigning a private investigator, whether in-house or outsourced. They are triggered by corporate policy violations.</li>\n</ol>\n\n<p>Whether investigating a crime or a corporate policy violation, part of the evidence is related to digital devices and digital media. This is where digital forensics comes into play and tries to establish what has happened. Without trained digital forensics investigators, it won’t be possible to process any digital evidence properly.</p>\n\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5f04259cf9bf5b57aed2c476/room-content/1a60cc447033f57a1ad0e23d0a489b57.png" style="width:75%" /><br /></p>', 'taskType': 'none', 'taskNo': 1, 'taskCreated': '2022-02-16T15:09:55.321Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>Consider the desk in the photo above. In addition to the smartphone, camera, and SD cards, what would be interesting for digital forensics?</p>', 'hint': 'What do you call a computer that you usually place on your lap unless you use a desk?'}]}, {'taskTitle': 'Digital Forensics Process', 'taskDesc': '<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5f04259cf9bf5b57aed2c476/room-content/b7ea0f594a8171f9198120d72e4f5e68.png" style="width:75%" /><br /></p>\n\n<p>As a digital forensics investigator, you arrive at a scene similar to the one shown in the image above. What should you do as a digital forensics investigator? After getting the proper legal authorization, the basic plan goes as follows:</p>\n<ol>\n<li>Acquire the evidence: Collect the digital devices such as laptops, storage devices, and digital cameras. (Note that laptops and computers require special handling if they are turned on; however, this is outside the scope of this room.)</li>\n<li>Establish a chain of custody: Fill out the related form appropriately (<a href="https://www.nist.gov/document/sample-chain-custody-formdocx">Sample form</a>). The purpose is to ensure that only the authorized investigators had access to the evidence and no one could have tampered with it.</li>\n<li>Place the evidence in a secure container: You want to ensure that the evidence does not get damaged. In the case of smartphones, you want to ensure that they cannot access the network, so they don’t get wiped remotely.</li>\n<li>Transport the evidence to your digital forensics lab.</li>\n</ol>\n<p>At the lab, the process goes as follows:</p>\n<ol>\n<li>Retrieve the digital evidence from the secure container.</li>\n<li>Create a forensic copy of the evidence: The forensic copy requires advanced software to avoid modifying the original data.</li>\n<li>Return the digital evidence to the secure container: You will be working on the copy. If you damage the copy, you can always create a new one.</li>\n<li>Start processing the copy on your forensics workstation.</li>\n</ol>\n<p>The above steps have been adapted from <a href="https://www.cengage.uk/shop/isbn/9781337568944">Guide to Computer Forensics and Investigations, 6th Edition</a>.</p>\n<p>More generally, according to the former director of the Defense Computer Forensics Laboratory, Ken Zatyko, digital forensics includes:</p>\n<ul>\n<li>Proper search authority: Investigators cannot commence without the proper legal authority.</li>\n<li>Chain of custody: This is necessary to keep track of who was holding the evidence at any time.</li>\n<li>Validation with mathematics: Using a special kind of mathematical function, called a hash function, we can confirm that a file has not been modified.</li>\n<li>Use of validated tools: The tools used in digital forensics should be validated to ensure that they work correctly. For example, if you are creating an image of a disk, you want to ensure that the forensic image is identical to the data on the disk.</li>\n<li>Repeatability: The findings of digital forensics can be reproduced as long as the proper skills and tools are available.</li>\n<li>Reporting: The digital forensics investigation is concluded with a report that shows the evidence related to the case that was discovered.</li>\n</ul>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2022-02-16T15:10:14.035Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>It is essential to keep track of who is handling it at any point in time to ensure that evidence is admissible in the court of law. What is the name of the documentation that would help establish that?<br /></p>', 'hint': ''}]}, {'taskTitle': 'Practical Example of Digital Forensics', 'taskDesc': '<p>Everything we do on our digital devices, from smartphones to computers, leaves traces. Let’s see how we can use this in the subsequent investigation.</p>\n<p>Our cat, Gado, has been kidnapped. The kidnapper has sent us a document with their requests in MS Word Document format. We have converted the document to PDF format and extracted the image from the MS Word file for your convenience.</p>\n\n<p>You can download the attached file to your local machine for inspection; however, for your convenience we have added the files to the AttackBox. To follow along, open the terminal on the AttackBox, then go to the directory <code>/root/Rooms/introdigitalforensics</code>\xa0as shown below. In the following terminal output, we changed to the directory containing the case files.</p>\n\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Terminal\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">root# cd /root/Rooms\nroot# cd introdigitalforensics\nroot# ls\nletter-image.jpg  ransom-letter.doc  ransom-letter.pdf  ransom-lettter-2.zip</code>\n        </pre>\n    </div>\n</div>\n\n<h3>Document Metadata</h3>\n\n<p>When you create a text file, <code>TXT</code>, some metadata gets saved by the Operating System, such as file creation date and last modification date. However, much information gets kept within the file’s metadata when you use a more advanced editor, such as MS Word. There are various ways to read the file metadata; you might open them within their official viewer/editor or use a suitable forensic tool. Note that exporting the file to other formats, such as <code>PDF</code>, would maintain most of the metadata of the original document, depending on the PDF writer used.</p>\n\n<p>Let’s see what we can learn from the PDF file. We can try to read the metadata using the program <code>pdfinfo</code>. Pdfinfo displays various metadata related to a PDF file, such as title, subject, author, creator, and creation date. (The AttackBox already has <code>pdfinfo</code> installed; however, if you are using Kali Linux and don’t have <code>pdfinfo</code> installed, you can install it using <code>sudo apt install poppler-utils</code>.) Consider the following example of using <code>pdfinfo DOCUMENT.pdf</code>.</p>\n\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Terminal\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@TryHackMe$ pdfinfo DOCUMENT.pdf \nCreator:        Microsoft® Word for Office 365\nProducer:       Microsoft® Word for Office 365\nCreationDate:   Wed Oct 10 21:47:53 2018 EEST\nModDate:        Wed Oct 10 21:47:53 2018 EEST\nTagged:         yes\nUserProperties: no\nSuspects:       no\nForm:           none\nJavaScript:     no\nPages:          20\nEncrypted:      no\nPage size:      595.32 x 841.92 pts (A4)\nPage rot:       0\nFile size:      560362 bytes\nOptimized:      no\nPDF version:    1.7</code>\n        </pre>\n    </div>\n</div>\n\n<p>The PDF metadata clearly shows that it was created using MS Word for Office 365 on October 10, 2018.</p>', 'taskType': 'downloadable', 'taskNo': 3, 'taskCreated': '2022-02-16T15:10:22.857Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '6216001c42654600624dbd62', 'questions': [{'questionNo': 1, 'question': '<p>Using <code>pdfinfo</code>, find out the author of the attached PDF file.</p>', 'hint': ''}, {'questionNo': 2, 'question': '\n<h3>Photo EXIF Data</h3>\n\n<p>EXIF stands for Exchangeable Image File Format; it is a standard for saving metadata to image files. Whenever you take a photo with your smartphone or with your digital camera, plenty of information gets embedded in the image. The following are examples of metadata that can be found in the original digital images:</p>\n\n<ul>\n<li>Camera model / Smartphone model</li>\n<li>Date and time of image capture</li>\n<li>Photo settings such as focal length, aperture, shutter speed, and ISO settings</li>\n</ul>\n\n<p>Because smartphones are equipped with a GPS sensor, finding GPS coordinates embedded in the image is highly probable. The GPS coordinates, i.e., latitude and longitude, would generally show the place where the photo was taken.</p>\n\n<p>There are many online and offline tools to read the EXIF data from images. One command-line tool is <code>exiftool</code>. ExifTool is used to read and write metadata in various file types, such as JPEG images. (The AttackBox already has <code>exiftool</code> installed; however, if you are using Kali Linux and don’t have <code>exiftool</code> installed, you can install it using <code>sudo apt install libimage-exiftool-perl</code>.) In the following terminal window, we executed <code>exiftool IMAGE.jpg</code> to read all the EXIF data embedded in this image.</p>\n\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Terminal\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@TryHackMe$ exiftool IMAGE.jpg\n[...]\nGPS Position : 51 deg 31\' 4.00" N, 0 deg 5\' 48.30" W\n[...]</code>\n        </pre>\n    </div>\n</div>\n\n<p>If you take the above coordinates and search one of the online maps, you will learn more about this location. Searching <a href="https://www.bing.com/maps">Microsoft Bing Maps</a> or <a href="https://www.google.com/maps">Google Maps</a> for <code>51° 31\' 4.00" N, 0° 5\' 48.30" W</code> reveals that these coordinates indicate that the image was taken very near to the Museum of London. (We only replaced <code>deg</code> with <code>°</code> for our search to work.) We noticed that the coordinates were converted to decimal representation on the search page: <code>51.517776, -0.09675</code>.</p>\n\n<p>Using <code>exiftool</code> or any similar tool, try to find where the kidnappers took the image they attached to their document. What is the name of the street?</p>', 'hint': 'The GPS coordinates you get from exiftool are 51 deg 30\' 51.90" N, 0 deg 5\' 38.73" W. Remember to replace deg with ° and remove the space between the number and the ° symbol before searching.'}, {'questionNo': 3, 'question': '<p>What is the model name of the camera used to take this photo?</p>', 'hint': 'To display only the lines with the word “Camera”, you can use grep: exiftool PHOTO.jpg | grep Camera'}]}]}