{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/3bf2fbf8c3026a820d03514afcf4f65a.png', 'title': 'Threat Hunting: Introduction', 'description': 'Behind the scenes of Threat Hunting - mindset, process, and goals.', 'code': 'introductiontothreathunting', 'users': 3337, 'tags': ['Threat Hunting', 'Threat Intelligence', 'MITRE', 'ATT&CK Navigator'], 'type': 'walkthrough', 'difficulty': 'easy', 'userCompleted': False, 'upVotes': 174, 'created': '2023-06-17T10:47:02.974Z', 'published': '2023-09-25T15:00:01.293Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://tryhackme-images.s3.amazonaws.com/user-uploads/5dbea226085ab6182a2ee0f7/room-content/ca218dfc14af38b4e2bc76849fa34ef7.png', 'creator': 'Mokmokmok', 'tasks': [{'taskTitle': 'Introduction', 'taskDesc': '<p style="text-align:justify">The purpose of this room is to introduce Threat Hunting as a structured concept focusing on its relationship to Incident Response, the Threat Hunting mindset, and the specific goals that Threat Hunting strives to achieve.</p><ul>\n</ul><p style="text-align:justify"><span style="font-size:24px">Learning Objectives:</span></p><ul>\n\n\n</ul>\n<p></p><p style="text-align:justify">In this room, we will strive to understand what Threat Hunting is and discuss its role in helping secure the organisation in contrast with Incident Response.</p><p style="text-align:justify">We will also explore different Threat Hunting goals and discuss how these goals help develop the organisation’s security posture. By the end of the room, we will gain a baseline idea of what to look for, how to look for them, and when to decide to move on.</p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">We will also gain an understanding that an Intelligence-driven approach to Threat Hunting, among others, is one of, if not the best way to move forward.</span><br /></p><ul>\n</ul><p style="text-align:justify"><span style="font-size:24px">Room Prerequisites and Expectation Setting:</span></p><ul>\n\n</ul><span style="font-size:24px">\n</span><p></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">There are no hard prerequisites in order to gain value from this room; however, it would be very helpful to have a basic understanding of the concept of Threat Intelligence and consequently its role in the effectiveness of Intelligence-driven activities. Knowing the basic concept behind Incident Response, how SOCs operate, and how an organisation’s Security Posture is built would also help a lot in understanding the concepts touched upon by this room.</span><br /></p><ul>\n</ul><p style="text-align:justify"><span style="font-size:24px">Relevant Rooms:</span></p><ul>\n\n</ul>\n<p></p><p style="text-align:justify">The rooms listed below discuss concepts and employ techniques and approaches that are intersecting and even similar to the ones that we will be tackling throughout this room. As such, it is recommended to go through these rooms as well in order to get the most out of them\n</p><ul>\n\n\n</ul>\n<p></p><ul><li style="text-align:justify"><a href="https://tryhackme.com/room/tacticaldetection" target="_blank">Tactical Detection Room | Detection Engineering Module</a></li><li style="text-align:justify"><a href="https://tryhackme.com/room/preparation" target="_blank">Preparation Room | Incident Response Module</a></li><li style="text-align:justify"><a href="https://tryhackme.com/room/cyberthreatintel" target="_blank">Introduction to Cyber Threat Intelligence</a></li><li style="text-align:justify"><a href="https://tryhackme.com/room/threatintelligenceforsoc" target="_blank">Threat Intelligence for SOC</a></li><li style="text-align:justify"><a href="https://tryhackme.com/room/opencti" target="_blank">OpenCTI</a></li><li style="text-align:justify"><a href="https://tryhackme.com/room/misp" target="_blank">MISP</a></li><li style="text-align:justify"><a href="https://tryhackme.com/room/mitre" target="_blank">MITRE</a></li>\n</ul>', 'taskType': 'none', 'taskNo': 1, 'taskCreated': '2023-06-17T10:48:25.786Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Are you excited to learn about threat hunting?', 'hint': 'yes!'}]}, {'taskTitle': 'Core Concept', 'taskDesc': '<p style="text-align:justify"><span style="font-size:24px">Threat Hunting Introduction</span></p><ul>\n\n</ul><span style="font-size:24px">\n</span><p></p><p style="text-align:justify">Threat hunting is an approach to finding cyber security threats where there’s an active effort done to look for signs of malicious activity. In its most basic form, that is the definition of Threat Hunting; however, in order for us to really understand what it entails as well as what its actual role is in the organisation, we will start by contrasting it with Incident Response.</p><ul>\n</ul><p style="text-align:justify"><span style="font-size:24px">Threat Hunting in Contrast with Incident Response</span></p><ul>\n\n\n\n\n\n\n\n</ul>\n<p></p><p style="text-align:justify">Incident Response (IR) is innately reactive. The action, or “response”, is triggered by an initial notification or alert. This initial notification is first triaged, then analysed, and when enough pieces of evidence point to malicious activity, it is deemed an incident that needs to be responded to and dealt with accordingly.</p><p style="text-align:justify">More information about Incident Response, particularly the initial stages of it, is discussed in the <a href="https://tryhackme.com/room/preparation" target="_blank">Preparation Room</a> of the IR Module.</p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Threat Hunting, on the other hand, is innately proactive. There is no actual ‘trigger’ that would mobilise a hunt, except for the pursuit of building the strength of the organisation’s security posture, guided by Threat Intelligence.</span><br /></p><p style="text-align:justify">A stark contrast can be seen here - while both are guided by the goal of ensuring the security of the organisation, the forces that drive the reactive and proactive nature of Incident Response and Threat Hunting, respectively, hardly share the same direction. This is further steered by the specific objectives that each aims to achieve.</p><table class="table table-bordered"><tbody><tr><td><b>Reactive Approach</b></td><td><b>Proactive Approach</b></td></tr><tr><td>Incident Response</td><td>Threat Hunting</td></tr><tr><td>Triggered by an initial notification / alert</td><td>Active search for suspicious events that can become incidents</td></tr><tr><td>Guided by the initial scope of the incident</td><td>Guided by Threat Intelligence</td></tr><tr><td>"There\'s a threat that needs to be dealt with now."</td><td>"There might be a threat that we don\'t know yet."</td></tr></tbody></table><p style="text-align:justify"><span style="font-size:1rem">Usually, organisations start doing threat hunts when there’s already an established IR process as well as detection mechanisms in place, but they think that incidents aren’t being detected early enough.\xa0In the case of advanced threats, or even well-made red team exercises, there will always exist ways to go through your organisation undetected.</span><br /></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Threat Hunting aims to bridge this gap, constantly finding ways to add and improve the current detection mechanisms in place so that future similar bad behaviour will automatically be detected immediately. More so, during that process, detected threats go immediately to the Incident Response team. The trigger for their mobilisation are the findings from the Threat Hunt, and consequent findings from the IR process may steer the Threat Hunting team to further find bad\xa0</span><span style="font-size:1rem">behaviour</span><span style="font-size:1rem">.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">This classic example shows the beauty of the synergy between two seemingly different approaches to ensuring one specific goal is met - strengthening the organisation’s security posture.</span></span></p><p><img alt="Synergy Diagram Between IR and Threat Hunting" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/2f47a4116acd75308c01626af6a50c64.svg" /><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><br /></span></span></p>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2023-06-17T10:52:27.455Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "What do you call the approach to finding cyber security threats where there's an active effort done to look for signs of malicious activity?", 'hint': ''}, {'questionNo': 2, 'question': '<p>In this task, what are we contrasting threat hunting with?</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Incident response is innately reactive. What is done first thing when an initial notification or alert is received? (It is _______.)</p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>Threat hunting is innately proactive. What is it guided by?</p>', 'hint': ''}, {'questionNo': 5, 'question': "<p>Threat Hunting and Incident Response are two different approaches that aim to ensure one specific goal is met. It is to strengthen the organisation's what?</p>", 'hint': ''}]}, {'taskTitle': 'Threat Hunting Mindset', 'taskDesc': '<p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">How you approach a task would usually dictate how successful you will be. It’s easy to rely on the most cutting-edge pieces of technology being offered out there, but across the industry, people would always be the most important part of any security team. And so, while thinking of equipping ourselves with the best tools is important, investing time (and probably money) in learning the proper mindset is as significant.\xa0</span><br /></p><ul>\n</ul><p style="text-align:justify"><span style="font-size:24px">What\'s the basis for our hunt?</span></p><p style="text-align:justify">It is imperative that we start our hunt with leads comprised of accurate pieces of information such as known relevant malware as well as trusted Threat Intelligence. Through leads, we give threat hunters better chances of achieving amazing things, from easy wins like looking for malicious binaries to more complex hunting projects like finding patterns of activity of certain groups that target organisations similar to us or industries we’re part of.</p><p style="text-align:justify"><span style="font-size:22px">Threat Intelligence</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Since we’re talking about dictating the direction of a hunt, it’s essential that we arm ourselves with critical information that will let us know more about the threat(s) that we may be dealing with. Understanding the bad that we may be dealing with is akin to knowing how they might behave within our environment, possibly allowing us to narrow down our search to specific sweet spots such as specific pieces of data they might be interested in, or even knowing which groups or APTs might be particularly interested in targeting us.</span><br /></p><ul>\n\n\n</ul>\n<p></p><p style="text-align:justify"><span style="font-size:20px">Unique Threat Intelligence</span></p><ul>\n\n</ul>\n<p></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Intelligence on threats that you are able to develop internally is a very valuable asset to have. Not many organisations have the kind of intrusion experience that would allow them to study and develop usable intelligence from said intrusion and even fewer have the capability of developing it internally. Furthermore, intelligence of this kind may have the characteristic of being ultimately unique to your organisation.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Indicators of Compromise (IOCs) specifically documented on previous intrusions would be the most obvious and straightforward example for this one. IOCs immediately give value not only to your threat hunters but also to your detection mechanism, as they’re actual traces of an adversary. Through this, re-intrusions of that specific adversary or other adversaries that employ the same tactics would be easier to spot.</span></span><br /></p><p style="text-align:justify"><span style="font-size:20px">Threat Intelligence Feeds</span></p><ul>\n\n</ul>\n<p></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">As touched upon above, not a lot of organisations are capable of developing valuable and actionable Threat Intelligence internally. While a lot of organisations have their fair share of intrusions, not everyone has that kind of experience under their belt which allows them a front-row seat to a specific adversary’s IOCs, among others. More so, it involves a lot of money, skill, and effort to be able to become an efficient Threat Intelligence producer.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">It is not the end for the rest of us, as we can learn from other Threat Intelligence producers via Threat Intelligence feeds. There exist intelligence feeds that are both readily and publicly available. One of the most popular examples of this one is the MISP, an open-source Threat Intelligence and sharing platform. You may learn more about <a href="https://tryhackme.com/room/misp" target="_blank">MISP here</a>.</span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">On the other hand, there are also paid resources that specialise in producing intelligence, some of which are capable of creating tailored intelligence for your organisation. Some examples of this are <a href="https://www.recordedfuture.com/" target="_blank">Recorded Future</a> and </span></span></span><a href="https://www.reliaquest.com/blog/category/threat-intelligence/" target="_blank">ReliaQuest</a><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">. These kinds of services are not cheap, and gaining a license would typically cost an arm; however, in the hands of a capable Threat Intelligence analyst, the insights that you would be able to gain would be extraordinary.</span></span></span></p><table class="table table-bordered"><tbody><tr><td><b>General Hunting Guide</b></td><td><b>Examples</b></td></tr><tr><td>Unique Threat Intelligence</td><td>Indicators of Compromise</td></tr><tr><td>Threat Intelligence Feeds</td><td><p>MISP</p><p>Recorded Future</p><p><span style="font-size:1rem">Digital Shadows</span></p></td></tr></tbody></table>', 'taskType': 'none', 'taskNo': 3, 'taskCreated': '2023-06-17T11:08:48.833Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is the most obvious and straightforward example of a Unique Threat Intelligence?', 'hint': ''}]}, {'taskTitle': 'Threat Hunting Process', 'taskDesc': '<p style="text-align:justify"><span style="font-size:24px">What do we hunt for?</span><br /></p><ul>\n\n\n\n\n\n\n\n\n</ul>\n<p></p><p style="text-align:justify">The answer to this question dictates the direction of the hunt. As the hunt progresses, the threat hunter will always go back to this question, ensuring that pieces of evidence that link to its answer are gathered.</p><p style="text-align:justify">The discussion regarding the examples below also falls under the wide-reaching <span style="fill:rgb(217, 115, 13)" class="notion-enable-hover">topic</span> of Threat Intelligence discussed in the previous task. However, they are valuable enough to deserve to be highlighted on their own. <span style="fill:rgb(68, 131, 97)" class="notion-enable-hover">These highlights are more focused on the kind of intelligence where their usage would merit immediate value to the hunt. They are straightforward, specific, and immediately actionable if successfully found.</span><br /></p><p style="text-align:justify"><span style="font-size:22px">Known Relevant Malware</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">The internet is ripe with known malware samples, and a lot of them have publicly available published analyses. One example of leveraging this kind of intelligence is to take a closer look at your organisation, identify the relevant threat actors that might take an interest in you, and hunt for traces of the malware that they use in their toolkits within your organisation.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">The example above may be a bit general. Still, once you identify what is relevant to your organisation, it would be a lot more straightforward to narrow down the samples that you want and consequently hunt for their traces within the scope of your visibility.</span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">One example of a live malware repository is <a href="https://github.com/ytisf/theZoo" target="_blank">theZoo</a>, where you may play with live malware and gain insights into how they will work within specific environmental conditions. Malware characteristics and analysis are constantly being published as well, and a good example worth exploring is <a href="https://www.trendmicro.com/vinfo/us/threat-encyclopedia/" target="_blank">Trend Micro’s Threat Encyclopedia</a>.</span></span></span></p><p style="text-align:justify"><span style="font-size:22px">Attack Residues</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Attack residues are a great starting point as well, especially if you think that an attack has happened already. It works particularly well with good Threat Intelligence as it would be as straightforward as ticking off a list of attack residues to check for within the environment.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">The challenging part here, however, is knowing your environment well enough to be able to separate attack residues from normal behaviour. A lot of attack residues blend well with normal environmental noise. Pair this with a more advanced adversary who knows how to clean up after themselves or even worse - employ tactics that are already stealthy from the get-go, and the hunt is suddenly not as straightforward as it seems.</span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Overall, it’s still a good way to cover our bases; remember that we only need to catch them making a mistake once while they need to constantly be perfect in their movements.</span></span></span><span style="font-size:22px"><br /></span></p><p style="text-align:justify"><span style="font-size:22px">Known Vulnerabilities of Products/Applications Being Used</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Threat actors are quite creative in finding vulnerabilities and misconfigurations in the products and applications that their target organisation use. As such, at the very least,</span><span style="caret-color:rgb(0, 0, 0);font-size:medium">\xa0</span><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">known vulnerabilities of assets should be actively hunted and patched accordingly. You might even stumble upon a threat actor actively exploiting your vulnerable assets, effectively catching 2 birds with one effort.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">The organisation should be extra vigilant for announcements of zero-day vulnerabilities that may be affecting these assets. Immediate checks should be done on:</span></span></p><ol><li style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">If the current version really is vulnerable, and</span></span></li><li style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">If there are traces of the vulnerability being exploited for as long as historical data may allow.</span></span></li></ol><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">These hunts are a great way to retroactively check the exploitation of vulnerable assets while also ensuring that the assets of the organisation are all patched and up to date with the current security standards.</span></span></span></p><table class="table table-bordered"><tbody><tr><td><b>General Hunting Guide</b></td><td><b>Examples</b></td></tr><tr><td>Known Relevant Malware</td><td><p>theZoo (repository)</p><p>Threat Encyclopedia</p></td></tr><tr><td>Attack Residues</td><td><p>Indicators of Attack</p><p>Indicators of Compromise</p></td></tr><tr><td>Known Vulnerabilities</td><td><p>Zero-day Vulnerabilities</p><p>CVEs</p></td></tr></tbody></table><p style="text-align:justify">The discussion above is a general discussion of usual threat hunt targets and is in no way an exhaustive list, albeit the list above is a good place to start. Every organisation has their own quirks and unique characteristics that must also be factored in whenever a hunting task or project is tackled.</p><ul>\n</ul><p style="text-align:justify"><span style="font-size:24px">How do we hunt for it?</span></p><ul>\n\n\n\n\n\n\n</ul>\n<p></p><p style="text-align:justify">Reviewing the array of information, factors, and other elements for consideration above would hopefully lead us to understand the target of our hunt. Now that we know what we want to hunt for, “How do we hunt for it?” is the sensible next question.</p><p style="text-align:justify">This section will not touch upon hunting theories and specific hunting techniques - these will be discussed in the next few rooms; rather, we will be focusing on the driving force that these theories and techniques are based on.</p><p style="text-align:justify"><span style="font-size:22px">Attack Signatures and IOCs</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Upon identifying the subject of the hunt, it’s imperative that we ensure that we characterise them into specific and actionable identifiers by which we will immediately recognize. This is done most effectively via Attack Signatures and IOCs.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">By condensing the “whats” of the hunt down to Attack Signatures and IOCs, we suddenly have a set of information that we can then immediately compare to our available historical data. This makes it easier to find objects of interest such as relevant malware, attack residues, and even exploitation of known vulnerabilities. Keep in mind that we do need to know how the environment behaves and consequently, what the logs would look like when said vulnerability has been exploited.</span></span><span style="font-size:18px"><br /></span></p><p style="text-align:justify"><span style="font-size:22px">Logical queries</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Some hunting projects are best accomplished via logical queries. A straightforward example of this one is hunting for assets that have known vulnerabilities.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">Applying what we’ve discussed above - characterising the vulnerable assets via specific actionable identifiers, such as the application version, would allow us to craft logical queries that filter for these identifiers. This essentially gives us low-hanging fruits for easy pickings that, at the same time, impact the organisation’s security posture directly.</span></span><span style="font-size:18px"><br /></span></p><p style="text-align:justify"><span style="font-size:22px">Patterns of Activity</span><br /></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">At the end of the day, when we’ve already narrowed down the specific bad (e.g. relevant threat actors, etc.) that we want to focus on, the next sensible step is to characterise their behaviour through patterns of activity that they are inclined to make. In any conversation regarding this, the <a href="https://attack.mitre.org" target="_blank">MITRE ATT&amp;CK Matrix</a> has always been a top resource, and it may as well be the star of the show here.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"></span></p>', 'taskType': 'none', 'taskNo': 4, 'taskCreated': '2023-07-28T09:31:12.588Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Malwares are constantly being used in the toolkits of threat actors. What is the live malware repository that we touched upon above?', 'hint': ''}, {'questionNo': 2, 'question': "<p>Knowing what is normal in your environment and separating them from what's not is a skill all threat hunters should have.</p><p>What example of Threat Intelligence blends well with environmental noise?</p>", 'hint': ''}, {'questionNo': 3, 'question': '<p><span style="text-align:justify">Threat actors are quite creative in finding vulnerabilities and misconfigurations.</span></p><p><span style="text-align:justify">What should the organisation be extra vigilant in monitoring for announcements of?</span></p>', 'hint': ''}, {'questionNo': 4, 'question': "<p>Characterisation of the subject of the hunt into specific and actionable identifiers is imperative for the hunt's success.</p><p>How is it done most effectively?</p>", 'hint': ''}]}, {'taskTitle': 'Practical Application', 'taskDesc': '<p><span style="text-align:justify;font-size:1rem">For our purposes, let’s focus on the </span><a href="https://mitre-attack.github.io/attack-navigator/" target="_blank">MITRE ATT&amp;CK Navigator</a><span style="text-align:justify;font-size:1rem">. The ATT&amp;CK Navigator is a tool designed to make it easier “to visualise your defensive coverage, your red/blue team planning, the frequency of detected techniques or anything else you want to do.” Not only does it show the specific attack techniques that we should look for, but it also gives an idea of how an attack flows, and it shows it in a visually appealing way.\xa0</span><span style="caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">The ATT&amp;CK Navigator will be used to answer the questions in this task. If you haven’t already done so, please click on the link provided.</span></p><p></p><p style="text-align:justify"><img alt="ATT&amp;CK Navigator Landing Page" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/96fa91e4e9de6ad2fbe2c79f2034aba1.png" /><span style="font-size:1rem"><br /></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">The attack navigator landing page looks like this.\xa0</span><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">Let’s proceed by clicking on Create New Layer → Enterprise. This should show you a blank ATT&amp;CK Navigator page.</span></span></p><p style="text-align:justify"><img alt="New Layer" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/2e39eedfc80c3b7f1f8ced80f6d74337.png" /><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium"><br /></span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">Select the magnifier glass under “selection controls”, and then type “WannaCry” inside the search bar. The “Software” part of the results should show 1 result. Click on the “select” button beside the result.</span><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium"><br /></span></span></p><p style="text-align:justify"><img alt="WannaCry Selection Instruction" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/15f35df9a157f3718e8f9a6cac0660c1.png" /><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium"><br /></span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">It should then show something like this:</span></span></p><p style="text-align:justify"><img alt="WannaCry Selection Demo" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/3e20642b461d5e026b348d3b2a227c34.png" /><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium"><br /></span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">To better visualise our selection, select a background colour under “technique controls”. It will immediately fill the selected techniques with the colour of your choice. Let’s also set an arbitrary score of 1 for this layer, the control for which is beside the background colour, still under the “technique controls”. Finally, we can set a name for this layer by editing the layer information under “layer controls”. It should look something like this. Take note that hovering on the technique should show the score.</span></span></p><p style="text-align:justify"><img alt="Selection Background" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/7286e72831f77dfbf57edd04559b4d8d.png" /><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium"><br /></span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">Now, in the same ATT&amp;CK Navigator, repeat all these steps for two more threats: Stuxnet and Conficker. You can do this by simply clicking on the “+” button on top of the page and then repeating the same process we’ve outlined above. This time, set a score of 2 for Stuxnet and 4 for Conficker. This way, when we stitch all of these layers together, we’ll know exactly which threats employ the same technique by looking at the aggregate score.</span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">Once you’ve repeated the steps above for both Stuxnet and Conficker, let’s proceed by clicking on the “+” button → “Create Layer from other layers”, choose “Enterprise ATT&amp;CK v13” under “domain”, and then put “a+b+c” on the “score expression”. Let’s skip all of the other settings and hit Create at the bottom of the page.</span></span></p><p style="text-align:justify"><img alt="Layering Multiple ATT&amp;CK Navigator Layers" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/e446d2029de929566a3d38a54afd256a.png" /><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium"><br /></span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">This\xa0</span><span style="color:rgb(0, 0, 0);font-size:medium;text-align:start;caret-color:rgb(0, 0, 0)">will create a new layer composed of the 3 other layers stitched into one in order to better visualise the impact of multiple threat actors that are relevant to your organisation.</span><br /></span></p><p style="text-align:justify"><img alt="Multiple Layer Demo" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/57e5bd1b4129ba0931a981505f1df185.png" /><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium"><br /></span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">By default, it would look something like this. A few changes on the colour setup under “layer controls” would transform it into something like this:</span></span></p><p style="text-align:justify"><img alt="Fixing Layer Colors" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/af48c233ee1a9f30006c3be005530220.png" /><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><br /></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span style="text-align:start;caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);font-size:medium">The differing colours are set to be able to immediately see which common tactics or techniques these threat actors share. A deep red colour means it’s common to all of them, while the other lighter colours mean it’s either one or any combination of two threat actors. The scores are arbitrary, and you can set them in terms of relevance to your organisation or just random if you just intend to play around with the tool visually. Questions at the end of this task would be related to this specific ATT&amp;CK Navigator layer.</span><br /></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">These tools and resources at hand would allow for a more straightforward approach to identifying patterns of activity. Once we’re satisfied with the way we’ve characterised the relevant threats that we wanted to focus on, we can then start hunting. This intelligence-driven approach of characterising threat actor behaviour through their TTPs is one of, if not the best, way to go about hunting. It immediately gives value to the hunt, and it’s sensible, straightforward, and actionable.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">MITRE has done a lot, not only within the cyber security sphere but also in subjects that generally help build a “safer world”. For more information on what MITRE has to offer, albeit, in the cyber security industry, you may head over to the <a href="https://tryhackme.com/room/mitre" target="_blank">MITRE room</a>.</span></span><span style="font-size:22px"><br /></span></p><ul>\n</ul><p style="text-align:justify"><span style="font-size:24px">When do we decide to move on?</span></p><ul>\n\n</ul><span style="font-size:24px">\n</span><p></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">The single biggest challenge in Threat Hunting is knowing when to decide to move on to other things. When will you know you’re done with it? Here’s a Capture the Flag (CTF) analogy.</span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">In CTFs, you immediately know before you even start that by the end of it, if you do everything right, there will be a flag waiting for you. If you aren’t able to get the answer, that just means that you need to study more and further improve so that the next time you tackle a similar problem, you’ll have more chances of capturing that flag. That’s not necessarily the case for Threat Hunting. It’s completely possible, and even more probable than not, that you do everything right and not find anything.</span></span></p><p style="text-align:justify"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)"><span class="notion-enable-hover" style="fill:rgb(68, 131, 97)">It will be normal to feel inadequate - there will always be internal doubt when hunting for threats. But as long as you follow your processes, especially with a hunting plan that’s intelligence-driven, you should be fine.\xa0</span></span></span></p>', 'taskType': 'none', 'taskNo': 5, 'taskCreated': '2023-07-28T09:52:07.012Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<span style="color:rgb(0, 0, 0);font-size:medium;caret-color:rgb(0, 0, 0)">Which tactic has the most techniques highlighted?</span>', 'hint': ''}, {'questionNo': 2, 'question': '<p><span style="color:rgb(0, 0, 0);font-size:medium;caret-color:rgb(0, 0, 0)">Which technique does the three threats have in common?</span><br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p><span style="color:rgb(0, 0, 0);font-size:medium;caret-color:rgb(0, 0, 0)">What technique does WannaCry and Conficker have in common?</span><br /></p>', 'hint': ''}, {'questionNo': 4, 'question': '<p><span style="color:rgb(0, 0, 0);font-size:medium;caret-color:rgb(0, 0, 0)">What’s the score of techniques that Stuxnet and Conficker have in common?</span><br /></p>', 'hint': ''}]}, {'taskTitle': 'Goals', 'taskDesc': '<p><span>﻿</span>So far, we have talked about the Threat Hunting concept, as well as the whats, the hows, and even the whens behind the Threat Hunting mindset; now it’s time to talk about the whys.</p><p><img alt="Comic Panel 1" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/d2912b4f493d14946c62ca8834110cfc.svg" /><br /></p><ul>\n</ul><p><span style="font-size:24px">Proactive Approach to Finding Bad</span></p><ul>\n\n</ul><span style="font-size:24px">\n</span><p></p><p>Threats are one of the constants in the world of security. There will never be a shortage of malicious actors, from Script Kiddies to well-funded Advanced Persistent Threats. There will always be someone snooping around your environment, and with that in mind, it is imperative that you find them first and you find them fast, ideally before they are able to do what they set out to do.</p><p><img alt="Comic Panel 2" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/3fcddd248ec0fdd111da0bd9790c411f.svg" /><br /></p><ul>\n</ul><p><span style="font-size:24px">Discover Pre-existing Bad</span></p><ul>\n\n\n</ul>\n<p></p><p>Through complex and sophisticated attack chains, chance, or even mere luck, it is a reality that some activities of malicious actors may slip through an organisation’s detection mechanisms. In that sense, similar kinds of activities are essentially undetectable; however, they are not invisible. It’s just that detection mechanisms haven’t yet been developed to automatically flag these activities.</p><p>It is through Threat Hunting that we’re able to find these activities, and upon such discovery, it will consequently (and quite immediately) trigger an Incident Response. These learnings will ultimately be fed back to the continuous monitoring process of the SOC (see last section).</p><p><img alt="Comic Panel 3" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/0f0e3e6f19e6a3510ab6327d48486cda.svg" /><br /></p><ul>\n</ul><p><span style="font-size:24px">Minimise the Dwell Time of Attackers</span></p><ul>\n\n\n</ul>\n<p></p><p>Another byproduct of undetected threat actor activity is having essentially a \'free pass\' to further snoop around within the environment. The longer a bad actor has access to your environment, the more opportunities they have to further learn about it. With a deeper understanding of the environment, an attacker may execute more sophisticated ways of persisting within the environment, cause bigger damage to important assets and/or information, and steal more data.</p><p>The primary goal of Threat Hunting is to minimise a threat actor\'s dwell time. Ultimately, security is the business of ensuring the confidentiality, integrity, and availability of the organisation’s assets, and minimising dwell time also minimises the damage a threat actor might have already caused.</p><p><img alt="Comic Panel 4" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/4c5eaf97bc0d7a2f2279111f9193fc7a.svg" /><br /></p><ul>\n</ul><p><span style="font-size:24px">Develop Additional Detection Methods</span></p><ul>\n\n</ul>\n<p></p><p>In the end, we want to be able to use all of these findings as feedback to our continuous monitoring process. Security is a continuous development process, so we wouldn’t want to hunt for the same threats over and over again. Instead, once we’ve profiled threats that were previously undetectable by current detection methods, an effort should immediately be poured into translating these profiles into detection mechanisms. In effect, future similar threats will be immediately detected and actioned upon.</p><p><img alt="Comic Panel 5" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/60c1834f577d63004fdaec50/room-content/b5b5a2d96a517e4e748fa884b46d310c.svg" /><br /></p>', 'taskType': 'none', 'taskNo': 6, 'taskCreated': '2023-06-17T11:44:04.776Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>What is the primary goal of Threat Hunting?</p>', 'hint': ''}, {'questionNo': 2, 'question': '<p>Feedback is important to keep the organisation secure.</p><p>Upon profiling threats through our Threat Hunting efforts, what should these profiles be translated to?</p>', 'hint': ''}]}, {'taskTitle': 'Conclusion', 'taskDesc': '<p><span style="font-size:1rem">Now that you’re aware of the baseline considerations that go with Threat Hunting, it’s time to get your hands dirty and flex your Threat Hunting skills. The rest of the walkthrough rooms in this module will focus on the different stages of the attack chain, discussing the core hunting theories first before going for a deep dive into those theories. Challenges will also be in store for you that will allow you to find evil with minimal guidance.</span><br /></p><p><span style="font-size:24px">What\'s Next?</span></p><p>Listed below are the rest of the rooms under the Threat Hunting Module. Make sure to check them out!</p><ul><li><a href="https://tryhackme.com/room/threathuntingfoothold" target="_blank">Threat Hunting: Foothold</a></li><li><a href="https://tryhackme.com/room/threathuntingpivoting" target="_blank">Threat Hunting: Pivoting</a></li></ul>', 'taskType': 'none', 'taskNo': 7, 'taskCreated': '2023-06-17T11:47:25.687Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "I'm ready to actually hunt threats!", 'hint': ''}]}]}