{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/54fa695b6a8fb47c3e91adf4a5594a81.png', 'title': 'KAPE', 'description': 'An introduction to Kroll Artifact Parser and Extractor (KAPE) for collecting and processing forensic artifacts', 'code': 'kape', 'users': 10067, 'tags': ['security', 'kape', 'forensics', 'triage', 'windows', 'incident response'], 'type': 'walkthrough', 'difficulty': 'medium', 'userCompleted': False, 'upVotes': 245, 'created': '2021-09-02T13:16:38.349Z', 'published': '2022-05-03T18:56:18.173Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://tryhackme-images.s3.amazonaws.com/user-uploads/62c435d1f4d84a005f5df811/room-content/a62b45e7c5c103c14c04aa8152c91624.png', 'creator': 'umairalizafar', 'tasks': [{'taskTitle': 'Learning Objectives', 'taskDesc': '\n\n<h2><b>Revisiting Windows Forensics</b></h2>\n\n<p>In the <a href="https://tryhackme.com/room/windowsforensics1" target="_blank">Windows Forensics 1</a> and <a href="https://tryhackme.com/room/windowsforensics2" target="_blank">Windows Forensics 2</a> rooms, we learned about the different artifacts which store information about a user\'s activity on a system. We also learned where those artifacts are located and how they can be accessed and interpreted. However, we did all that manually. In many cases, a forensic investigator doesn\'t have the luxury to perform manual analysis, which can be time-consuming. In such scenarios, it is helpful to have some tools help in automating the evidence collection, sanitization, and processing part.</p>\n\n<h2><b>Learning Objectives:</b></h2>\n<p>In this room, we will:</p><ul><li>Learn about KAPE</li><li>How KAPE works</li><li>The different targets and modules used by KAPE</li><li>Collection and analysis of forensic data using KAPE</li></ul>\n\n', 'taskType': 'none', 'taskNo': 1, 'taskCreated': '2021-09-02T13:17:31.709Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'I have already completed the Windows Forensics 1 and Windows Forensics 2 rooms.', 'hint': ''}]}, {'taskTitle': 'Introduction to KAPE', 'taskDesc': '<h2><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/0f176a6a5c43d74479af82aa386d0664.png" style="float:right" class="note-float-right" /><b>﻿Introduction to KAPE:</b></h2>\n\n<p>Kroll Artifact Parser and Extractor (KAPE) parses and extracts Windows forensics artifacts. It is a tool that can significantly reduce the time needed to respond to an incident by providing forensic artifacts from a live system or a storage device much earlier than the imaging process completes.\xa0</p>\n\n<p>KAPE serves two primary purposes, 1) collect files and 2) process the collected files as per the provided options. For achieving these purposes, KAPE uses the concept of targets and modules. Targets can be defined as the forensic artifacts that need to be collected. Modules are programs that process the collected artifacts and extract information from them. We will learn about them in the upcoming tasks.</p>\n\n<h2><b>How it works</b></h2>\n\n<p>KAPE is extensible and highly configurable. In essence, the KAPE binary ﻿ collects files and processes them as per the provided configuration.</p>\n\n<p>The collection of files (targets) KAPE adds the files to a queue and copies them in two passes. In the first pass, it copies the files that it can. This works for files that the OS has not locked. The rest of the files are passed to a secondary queue. The secondary queue is processed using a different technique that uses raw disk reads to bypass the OS locks and copy the files. The copied files are saved with original timestamps and metadata and stored in a similar directory structure.\xa0</p>\n\n<p>Once the data is collected, KAPE can process it using modules. The modules can be independent binaries that run on the collected data and process them to extract information. For example, KAPE will collect and copy the Prefetch file to our target destination during the target collection. Running a Prefetch Parser (PECmd) module on this target will extract the prefetch file and save it in a CSV file.\xa0</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/d1489a8062d714fa227dd3382dfd15d1.png" /><br /></p><p></p><p></p><p>As the above image shows, KAPE can extract targets from a Live system, a mounted image, or the <a href="https://www.f-response.com/" target="_blank">F-response</a> utility. KAPE does not need to be installed. It is portable and can be used from network locations or USB drives. To proceed further, click the Start Machine button on the top-right corner to start the attached VM in split-screen mode. Alternatively, you can log in to the machine using the following credentials:</p><p><b>Username</b>: thm-4n6</p><p><b>Password</b>: 123</p><p> In the attached VM, you will find KAPE on the Desktop in the folder titled KAPE.<span style="font-size:1rem">In this folder, you will find the following files and directories:</span></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/e56dffdd3de51e8dbc5647270901b603.png" /></p><p>You can see two binaries in this directory, kape.exe and gkape.exe. The first is the CLI version of KAPE, and the second is a GUI version (symbolized by the \'g\' prefix). </p><p>gkape.settings stores the default settings of the GUI version.</p><p> Get-KAPEUpdate.ps1, as the name suggests, is a Powershell script that checks and downloads updates. </p><p>ChangeLog.txt and Documentation are self-explanatory. We will explore Targets and Modules in the following tasks.</p>', 'taskType': 'vm', 'taskNo': 2, 'taskCreated': '2022-01-13T16:36:49.932Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '620b8704437056aee2df354a', 'questions': [{'questionNo': 1, 'question': 'From amongst kape.exe and gkape.exe, which binary is used to run GUI version of KAPE?', 'hint': ''}]}, {'taskTitle': 'Target Options', 'taskDesc': '<p>In KAPE\'s lexicon, <code>Targets</code> are the artifacts that need to be collected from a system or image and copied to our provided destination. For example, as we learned in the last room, Windows Prefetch is a forensic artifact for evidence of execution so that we can create a\xa0<code>Target</code> for it. Similarly, we can also create\xa0<code>Targets</code>\xa0for the registry hives. In short, <code>Targets</code> copy files from one place to another.</p>\n\n<p>When we open the <code>Targets</code> directory of KAPE, this is what we will see:</p>\n\n<p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/3902f2f2088969b01e9672553f48c9e4.png" /></p>\n\n<p>The last four files at the bottom are guides and templates to create <code>Targets</code> and <code>Compound Targets</code> of our own. We will discuss <code>Compound Targets</code> later in this task. As you can see, the targets are grouped into different directories. Let\'s check out the <code>Windows</code> directory to see what we have:</p>\n\n<p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/20d9d19240bcaeb95b55ad2efb105c1c.png" /></p>\n\n<p>We can see different .tkape extension files. This is how a <code>Target</code> is defined for KAPE. A TKAPE file contains information about the artifact that we want to collect, such as the path, category, and file masks to collect. As an example, below is how the Prefetch <code>Target</code> is defined.</p>\n\n<p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/92dce7807d9ea37f6f5e1e62f271275b.png" /></p>\n\n<p>This TKAPE file tells KAPE to collect files with the file mask <code>*.pf</code> from the path <code>C:\\Windows\\prefetch</code> and <code>C:\\Windows.old\\prefetch</code>. </p>\n\n\n<p>Notice that we have the <code>C:\\Windows.old</code> path listed here as well. This path contains files retained after Windows has updated to a new version. For forensic analysis, we can also find interesting historical artifacts from this directory.</p>\n\n<h2><b>Compound Targets:</b></h2>\n\n<p>﻿KAPE also supports <code>Compound Targets</code>. These are <code>Targets</code> that are compounds of multiple other targets. As mentioned in the previous tasks, KAPE is often used for quick triage collection and analysis. The purpose of KAPE will not be fulfilled if we have to collect each artifact individually. Therefore, <code>Compound Targets</code> help us collect multiple targets by giving a single command. Examples of <code>Compound Targets</code> include <code>!BasicCollection</code>, <code>!SANS_triage</code> and <code>KAPEtriage</code>. We can view the <code>Compound Targets</code> on the path <code>KAPE\\Targets\\Compound</code>. The following image shows what a <code>Compound Target</code> for evidence of execution looks like:</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/76260284a8d68c7d38126a7237e9c16a.png" /></p><p>The above <code>Compound Target</code> will collect evidence of execution from Prefetch, RecentFileCache, AmCache, and Syscache <code>Targets</code>.</p>\n\n<h2><b>!Disabled</b></h2>\n<p>This directory contains <code>Targets</code> that you want to keep in the KAPE instance, but you don\'t want them to appear in the active Targets list.</p>\n\n<h2><b>!Local</b></h2>\n<p>If you have created some <code>Targets</code> that you don\'t want to sync with the KAPE Github repository, you can place them in this directory. These can be <code>Targets</code> that are specific to your environment. Similarly, anything not present in the Github repository when we update KAPE will be moved to the <code>!Local</code> directory.</p>', 'taskType': 'none', 'taskNo': 3, 'taskCreated': '2022-01-13T16:36:54.370Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is the file extension for KAPE <code>Targets</code>?', 'hint': ''}, {'questionNo': 2, 'question': 'What type of\xa0<code>Target</code> will we use if we want to collect multiple artifacts with a single command?', 'hint': ''}]}, {'taskTitle': 'Module Options', 'taskDesc': '<p><code>Modules</code>, in KAPE\'s lexicon, run specific tools against the provided set of files. Their goal is not to copy files from one place to another but rather run some command and store the output. Generally, the output is in the form of CSV or TXT files.</p><p>This is what the <code>Modules</code> directory looks like in KAPE:</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/e4dbd842fa5b548ac8fade7b94ab0c8a.png" /></p><p>Similar to the previous task, we see guides and templates for creating <code>Modules</code> and <code>Compound Modules</code>. We also see the <code>!Disabled</code>, <code>!Local</code> and <code>Compound</code> directories, which are similar to what we saw in the previous task. We will not discuss these again, as we discussed them in the last task. We see that most of the <code>Modules</code> are grouped together in different directories. One thing we find different is the <code>bin</code> directory. We will discuss that in a bit. For now, let\'s open the Windows directory and see what we have there:</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/9a9760a2f1004e74b23294681f7bfdef.png" /></p><p>Here we see files with the <code>.mkape</code> extension. These are understood as <code>Modules</code> by KAPE. Let\'s open an MKAPE file and see how it is structured. The following image shows the Windows_IPConfig MKAPE file.</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/15bfb563be1d5bf1e988ab3e7486b58e.png" /></p><p>Notice that the MKAPE file tells KAPE about the executable that has to be run, the command line parameters of the executable file, the output export format, and the filename to export to. But what if the executable that we want to run is not present on the system? This brings us to the <code>bin</code> directory.</p>\n\n<h2><b>The bin directory:</b></h2>\n<p>The <code>bin</code> directory contains executables that we want to run on the system but are not natively present on most systems. KAPE will run executables either from the <code>bin</code> directory or the complete path. An example of files to be kept in the <code>bin</code> directory are Eric Zimmerman\'s tools, which are generally not present on a Windows system. We used them extensively in the Windows Forensics rooms.\xa0</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/a3547f25552d5d440d4f85022b53bc01.png" /></p><p>Notice that most of the binaries present here are from Eric Zimmerman\'s Tools.</p>', 'taskType': 'none', 'taskNo': 4, 'taskCreated': '2022-01-13T16:36:56.444Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is the file extension of the <code>Modules</code> files?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What is the name of the directory where binary files are stored, which may not be present on a typical system, but are required for a particular KAPE Module?</p>', 'hint': ''}]}, {'taskTitle': 'KAPE GUI', 'taskDesc': '<p>Now that we have learned about the different components of KAPE let\'s take it for a test drive. In the attached VM, double-click to open the gkape.exe file. You will see the following Window:</p>\n\n<p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/2c483331a6c0218db3bad9d79289447c.png" style="width:1230.06px;height:604.737px" /></p>\n\n<p><b>Tip: </b>If the Window is not correctly visible in the split-screen, you can open it in a full browser tab by clicking this button:</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/af1a133b7384aac273451343dadc032d.png" /><br /></p><p>Here you can see that there are different options, but most are disabled. To collect <code>Targets</code> We will go ahead by enabling the\xa0<code>Use Target Options</code>\xa0checkbox. This will enable the options present in the left half of the Window:</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/ef839c3076a311b29ac9fedd933d58d8.png" style="width:1272.5px;height:674px" /><br /></p><p><span style="font-size:1rem">If we want to perform forensics on the same machine on which KAPE is running, we will provide </span><code>C:\\</code><span style="font-size:1rem"> for the Target source. We can select the target destination of our choice. All the triage files will be copied to the Target destination that we provide.</span></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/f4a865927aef7b0fa4668f13ef8f9cfa.png" /><span style="font-size:1rem"><br /></span></p><p><span style="font-size:1rem">Here, the </span><code>Flush</code><span style="font-size:1rem"> checkbox will delete all the contents of the Target destination, so we have to be careful when using that. We have disabled the </span><code>Flush</code><span style="font-size:1rem"> checkbox so that it does not delete data already present in the directories.\xa0</span><code>Add %d</code><span style="font-size:1rem"> will append date info to the directory name where the collected data is saved. Similarly, </span><code>Add %m</code><span style="font-size:1rem"> will append machine info to the Target destination directory. We can select our desired Target from the list shown above. The Search bar helps us search for the names of the desired Targets quickly.</span></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/a513c60028421e8fd103a161e1492e0a.png" /><span style="font-size:1rem"><br /></span></p><p><span style="font-size:1rem">We can select if we want to process Volume Shadow Copies by enabling </span><code>Process VSCs</code>. We can select the <code>transfer</code> checkbox if we want to transfer the collected artifacts through an SFTP server or an S3 bucket<span style="font-size:1rem">. For transfer, the files must be enclosed in a container, which can be Zip, VHD, or VHDX. Similarly, we can provide exclusions based on SHA-1, and KAPE will not copy the excluded files. When enclosing in a container, we will need to give a </span><code>Base name</code><span style="font-size:1rem"> that will be used for all the created files. It is not required if we are not transferring files or enclosing them in a container.</span></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/22a7063c7c3bb75bc2ddaede7fcf9f57.png" /><span style="font-size:1rem"><br /></span></p><p><span style="font-size:1rem">In the </span><code>Current command line</code><span style="font-size:1rem">\xa0tab, we can see the command line options being added or removed while configuring the UI. This Window will show more options in the command line as we add options. Please note that the destination path in your case will be different from the one shown in the image. Notice the </span><code>--tflush</code><span style="font-size:1rem"> flag here. It means that when this command line was created, the </span><code>Flush</code><span style="font-size:1rem"> checkbox was still checked.</span></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/fd514feceacfd972097ef26b5ac433ed.png" /><span style="font-size:1rem"><br /></span></p><p><span style="font-size:1rem">By checking the Use Module Options checkbox, the right side of the KAPE Window will also be enabled.</span></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/811ceeea4083ab70546d89f5ecfc2f6f.png" style="width:1139.18px;height:604px" /></p><p>When using both Target and Module Options, providing Module Source is not required. The selected Modules will use the Target destination as the source.</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/8807a5d8eaf027af5f6e0a174e8079d3.png" style="width:1227.19px;height:161.212px" /></p><p>The rest of the options for Modules are similar to the ones for Targets, so we won\'t go into details for them.</p><p>Below you will see what the configuration looks like when we have KAPE all set up for collecting Targets and processing them using Modules.</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/d4e260cbc96fd497859c9133cdb345a8.png" style="width:1185.66px;height:628px" /><br /></p><p></p><p>We have selected the <code>KapeTriage</code> compound Target and <code>!EZParser</code> Compound Module. The command line below shows the CLI command that will be run. The <code>Execute!</code> button in the bottom right corner will execute the command. The <code>Disable flush warnings</code> checkbox underneath it will not warn us when we are using the <code>Flush</code> flags. When we press <code>Execute!</code> We will see a command line window open and show us the logs as KAPE performs its tasks. It will take a few minutes to execute since it will be collecting all the data and then running the module processes on it. Once it completes, it will show us the total execution time, and we can press any key to terminate the command window.</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            D:\\Kape\\kape.exe\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">KAPE version 1.1.0.1 Author: Eric Zimmerman (kape@kroll.com)\n\nKAPE directory: D:\\KAPE\nCommand line: --tsource C: --tdest C:\\Users\\Umair\\Desktop\\kape --target KapeTriage --mdest C:\\Users\\Umair\\Desktop\\4n6-2 --module !EZParser --gui\n\nSystem info: Machine name: UMAIR-THINKBOOK, 64-bit: True, User: Umair OS: Windows10 (10.0.22000)\n\nUsing Target operations\nFound 14 targets. Expanding targets to file list...\nTarget \'ApplicationEvents\' with Id \'2da16dbf-ea47-448e-a00f-fc442c3109ba\' already processed. Skipping!\nTarget \'ApplicationEvents\' with Id \'2da16dbf-ea47-448e-a00f-fc442c3109ba\' already processed. Skipping!\nTarget \'ApplicationEvents\' with Id \'2da16dbf-ea47-448e-a00f-fc442c3109ba\' already processed. Skipping!\nTarget \'ApplicationEvents\' with Id \'2da16dbf-ea47-448e-a00f-fc442c3109ba\' already processed. Skipping!\nTarget \'ApplicationEvents\' with Id \'2da16dbf-ea47-448e-a00f-fc442c3109ba\' already processed. Skipping!\nFound 3,059 files in 4.257 seconds. Beginning copy...\n        Deferring \'C:\\Windows\\System32\\winevt\\logs\\Application.evtx\' due to IOException...\n        Deferring \'C:\\Windows\\System32\\winevt\\Logs\\Microsoft-Windows-Windows Defender%4Operational.evtx\' due to IOException...\n        Deferring \'C:\\Windows\\System32\\winevt\\Logs\\Microsoft-Windows-Windows Defender%4WHC.evtx\' due to IOException...\n        Deferring \'C:\\ProgramData\\Microsoft\\Windows Defender\\Support\\MPDetection-20220126-183133.log\' due to IOException...\n        Deferring \'C:\\ProgramData\\Microsoft\\Windows Defender\\Support\\MPDeviceControl-20211016-164735.log\' due to IOException...\n        Deferring \'C:\\ProgramData\\Microsoft\\Windows Defender\\Support\\MPLog-10172021-040927.log\' due to IOException...\n        Deferring \'C:\\ProgramData\\Microsoft\\Windows Defender\\Support\\MpWppTracing-20220210-070038-00000003-ffffffff.bin\' due to IOException...\n        Deferring \'C:\\Windows\\System32\\winevt\\logs\\HardwareEvents.evtx\' due to IOException...\n        Deferring \'C:\\Windows\\System32\\winevt\\logs\\IntelAudioServiceLog.evtx\' due to IOException...\n        Deferring \'C:\\Windows\\System32\\winevt\\logs\\Internet Explorer.evtx\' due to IOException...\n.\n.\n.\n.\nExecuting remaining modules...\n        Running \'EvtxECmd\\EvtxECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape --csv C:\\Users\\Umair\\Desktop\\4n6-2\\EventLogs\n        Running \'JLECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape --csv C:\\Users\\Umair\\Desktop\\4n6-2\\FileFolderAccess -q\n        Running \'LECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape --csv C:\\Users\\Umair\\Desktop\\4n6-2\\FileFolderAccess -q\n        Running \'PECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape --csv C:\\Users\\Umair\\Desktop\\4n6-2\\ProgramExecution -q\n        Running \'RBCmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape --csv C:\\Users\\Umair\\Desktop\\4n6-2\\FileDeletion -q\n        Running \'RECmd\\RECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape --bn BatchExamples\\Kroll_Batch.reb --nl false --csv C:\\Users\\Umair\\Desktop\\4n6-2\\Registry -q\n        Running \'SBECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape --csv C:\\Users\\Umair\\Desktop\\4n6-2\\FileFolderAccess -q\n        Running \'SQLECmd\\SQLECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape --csv C:\\Users\\Umair\\Desktop\\4n6-2\\SQLDatabases\n        Running \'SrumECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape -k --csv C:\\Users\\Umair\\Desktop\\4n6-2\\SystemActivity\n        Running \'SumECmd.exe\': -d C:\\Users\\Umair\\Desktop\\kape\\Windows\\System32\\LogFiles\\SUM --csv C:\\Users\\Umair\\Desktop\\4n6-2\\SUMDatabase\nExecuted 18 processors in 192.2738 seconds\n\nTotal execution time: 258.1812 seconds\n\n\nPress any key to exit\n</code>\n        </pre>\n    </div>\n</div>\n\n\n\n\n\n\n<p></p><p><span style="font-size:1rem">Notice that at the backend, KAPE is running the </span><code>kape.exe</code><span style="font-size:1rem"> in a command line. We can check out the files created by KAPE once it completes processing them. The below snapshot shows our </span><code>Module destination</code><span style="font-size:1rem">. Notice how KAPE has processed the files according to different categories.</span></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/61306d87a330ed00419e22e7/room-content/a0fad94b0afd9f8f424f3071f0d4e475.png" /><span style="font-size:1rem"><br /></span></p><p><span style="font-size:1rem"> Let\'s collect triage data using the\xa0</span><code>KAPETriage</code><span style="font-size:1rem"> package, process it using </span><code>!EZParser</code><span style="font-size:1rem"> module, and answer the questions below. Then we can proceed to learn about the KAPE CLI in the next task.</span><br /></p>', 'taskType': 'none', 'taskNo': 5, 'taskCreated': '2021-09-02T14:30:38.688Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'In the second to last screenshot above, what target have we selected for collection?', 'hint': '--target option in cli'}, {'questionNo': 2, 'question': '<p>In the second to last screenshot above, what module have we selected for processing?</p>', 'hint': '--module option in cli'}, {'questionNo': 3, 'question': '<p>What option has to be checked to append date and time information to triage folder name?</p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>What option needs to be checked to add machine information to the triage folder name?</p>', 'hint': ''}]}, {'taskTitle': 'KAPE CLI', 'taskDesc': '<p>Though we used the GUI in the previous task, KAPE is a command-line tool. Therefore, it is pertinent to know how to use KAPE through the command line to make full use of it.\xa0</p>\n\n\n<p>For a list of all the different switches that can be used with KAPE, open an elevated PowerShell (Run As Administrator), go to the path where the KAPE binary is located, and type\xa0<code>kape.exe</code>. You will see something like this as an output.</p>\n\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Administrator: Command Prompt\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">D:\\KAPE&gt;kape.exe\n\nKAPE version 1.1.0.1 Author: Eric Zimmerman (kape@kroll.com)\n\n        tsource         Target source drive to copy files from (C, D:, or F:\\ for example)\n        target          Target configuration to use\n        tdest           Destination directory to copy files to. If --vhdx, --vhd or --zip is set, files will end up in VHD(X) container or zip file\n        tlist           List available Targets. Use . for Targets directory or name of subdirectory under Targets.\n        tdetail         Dump Target file details\n        tflush          Delete all files in \'tdest\' prior to collection\n        tvars           Provide a list of key:value pairs to be used for variable replacement in Targets. Ex: --tvars user:eric would allow for using %user% in a Target which is replaced with eric at runtime. Multiple pairs should be separated by ^\n        tdd             Deduplicate files from --tsource (and VSCs, if enabled) based on SHA-1. First file found wins. Default is TRUE\n\n        msource         Directory containing files to process. If using Targets and this is left blank, it will be set to --tdest automatically\n        module          Module configuration to use\n        mdest           Destination directory to save output to\n        mlist           List available Modules. Use . for Modules directory or name of subdirectory under Modules.\n        mdetail         Dump Module processors details\n        mflush          Delete all files in \'mdest\' prior to running Modules\n        mvars           Provide a list of key:value pairs to be used for variable replacement in Modules. Ex: --mvars foo:bar would allow for using %foo% in a module which is replaced with bar at runtime. Multiple pairs should be separated by ^\n        mef             Export format (csv, html, json, etc.). Overrides what is in Module config\n\n        sim             Do not actually copy files to --tdest. Default is FALSE\n        vss             Process all Volume Shadow Copies that exist on --tsource. Default is FALSE\n\n        vhdx            The base name of the VHDX file to create from --tdest. This should be an identifier, NOT a filename. Use this or --vhd or --zip\n        vhd             The base name of the VHD file to create from --tdest. This should be an identifier, NOT a filename. Use this or --vhdx or --zip\n        zip             The base name of the ZIP file to create from --tdest. This should be an identifier, NOT a filename. Use this or --vhdx or --vhd\n\n        scs             SFTP server host/IP for transferring *compressed VHD(X)* container\n        scp             SFTP server port. Default is 22\n        scu             SFTP server username. Required when using --scs\n        scpw            SFTP server password\n        scd             SFTP default directory to upload to. Will be created if it does not exist\n        scc             Comment to include with transfer. Useful to include where a transfer came from. Defaults to the name of the machine where KAPE is running\n\n        s3p             S3 provider name. Example: spAmazonS3 or spGoogleStorage. See \'https://bit.ly/34s9nS6\' for list of providers. Default is \'spAmazonS3\'\n        s3r             S3 region name. Example: us-west-1 or ap-southeast-2. See \'https://bit.ly/3aNxXhc\' for list of regions by provider\n        s3b             S3 bucket name\n        s3k             S3 Access key\n        s3s             S3 Access secret\n        s3st            S3 Session token\n        s3kp            S3 Key prefix. When set, this value is used as the beginning of the key. Example: \'US1012/KapeData\'\n        s3o             When using \'spOracle\' provider, , set this to the \'Object Storage Namespace\' to use\n        s3c             Comment to include with transfer. Useful to include where a transfer came from. Defaults to the name of the machine where KAPE is running\n\n        s3url           S3 Presigned URL. Must be a PUT request vs. a GET request\n\n        asu             Azure Storage SAS Uri\n        asc             Comment to include with transfer. Useful to include where a transfer came from. Defaults to the name of the machine where KAPE is running\n\n        zv              If true, the VHD(X) container will be zipped after creation. Default is TRUE\n        zm              If true, directories in --mdest will be zipped. Default is FALSE\n        zpw             If set, use this password when creating zip files (--zv | --zm | --zip)\n\n        hex             Path to file containing SHA-1 hashes to exclude. Only files with hashes not found will be copied\n\n        debug           Show debug information during processing\n        trace           Show trace information during processing\n\n        gui             If true, KAPE will not close the window it executes in when run from gkape. Default is FALSE\n\n        ul              When using _kape.cli, when true, KAPE will execute entries in _kape.cli one at a time vs. in parallel. Default is FALSE\n\n        cu              When using _kape.cli, if true, KAPE will delete _kape.cli and both Target/Module directories upon exiting. Default is FALSE\n\n        sftpc           Path to config file defining SFTP server parameters, including port, users, etc. See documentation for examples\n        sftpu           When true, show passwords in KAPE switches for connection when using --sftpc. Default is TRUE\n\n        rlc             If true, local copy of transferred files will NOT be deleted after upload. Default is FALSE\n        guids           KAPE will generate 10 GUIDs and exit. Useful when creating new Targets/Modules. Default is FALSE\n        sync            If true, KAPE will download the latest Targets and Modules from specified URL prior to running. Default is https://github.com/EricZimmerman/KapeFiles/archive/master.zip\n\n        ifw             If false, KAPE will warn if a process related to FTK is found, then exit. Set to true to ignore this warning and attempt to proceed. Default is FALSE\n\n\n        Variables: %d = Timestamp (yyyyMMddTHHmmss)\n                   %s = System drive letter\n                   %m = Machine name\n\nExamples: kape.exe --tsource L: --target RegistryHives --tdest "c:\\temp\\RegistryOnly"\n          kape.exe --tsource H --target EvidenceOfExecution --tdest "c:\\temp\\default" --debug\n          kape.exe --tsource \\\\server\\directory\\subdir --target Windows --tdest "c:\\temp\\default_%d" --vhdx LocalHost\n          kape.exe --msource "c:\\temp\\default" --module LECmd --mdest "c:\\temp\\modulesOut" --trace --debug\n\n          Short options (single letter) are prefixed with a single dash. Long commands are prefixed with two dashes\n\n          Full documentation: https://ericzimmerman.github.io/KapeDocs/\n\n\nD:\\KAPE&gt;</code>\n        </pre>\n    </div>\n</div>\n\n<p></p>\n\n\n<p>We can see from the above screenshot that while collecting Targets, the switches <code>tsource</code>, <code>target</code> and <code>tdest</code> are required. Similarly, when processing files using Modules, <code>module</code> and <code>mdest</code> are required switches. The other switches are optional as per the requirements of the collection.</p><p>With this information, let\'s build a command to perform the same task we performed in the previous task. i.e., collect triage data using the <code>KapeTriage</code> Compound Target and process it using the <code>!EZParser </code>Compound Module. Since we are not using the GUI version, we will start with typing:</p><p><code>kape.exe</code> </p>\n\n\n<p>To add a Target source, let\'s append <code>--tsource</code> and that Target path:</p><p><code>kape.exe --tsource C:\xa0</code></p><p>The <code>--target</code> flag will be used for selecting the Target the <code>--tdest</code> flag for the Target destination. For the sake of simplicity, we will set the Target destination to a directory named target on the Desktop. KAPE will create a new directory if it doesn\'t already exist. Our command line now looks like this:</p><p><code>kape.exe --tsource C: --target KapeTriage --tdest C:\\Users\\thm-4n6\\Desktop\\target</code>\xa0</p><p>Running the above command will collect triage data defined in the KapeTriage Target and save it to the provided destination. However, it will not process it or perform any other activity on the data. </p>\n\n\n<p>If we want to flush the Target destination, we can add <code>--tflush</code> to do that. For now, let\'s move on to adding the Module options. If we were using a Module source, we would have used a &gt;<code>--msource</code> flag in a similar manner to the <code>--tsource</code> flag. But in this case, let\'s use the Target destination as the Module source. By doing this, we will not need to add it explicitly, and we can move on to adding the Module destination using the <code>--mdest</code> flag:</p>\n\n<p><code>kape.exe --tsource C: --target KapeTriage --tdest C:\\Users\\thm-4n6\\Desktop\\Target --mdest C:\\Users\\thm-4n6\\Desktop\\module</code> </p>\n\n\n\n<p>We have just used a directory named module for the Module destination. </p><p>To Process the Target destination using a Module, we need to provide the Module name using the <code>--module</code> flag. To process it using the <code>!EZParser</code> Module, we will append <code>--module !EZParser</code>, making our command look like this:</p>\n\n<p><code>kape.exe --tsource C: --target KapeTriage --tdest C:\\Users\\thm-4n6\\Desktop\\Target --mdest C:\\Users\\thm-4n6\\Desktop\\module --module !EZParser</code></p>\n\n<p>Please note that we will need to run this command in an elevated shell (with Administrator privileges) for KAPE to collect the data.</p>\n\n<p>We can modify the command as per our needs and the switches provided by KAPE. When we run this command, we will see a similar window as in the previous task. You can check out the files collected by KAPE Targets and Modules once it completes.</p>\n\n<h2><b>Batch Mode:</b></h2>\n\n<p>﻿KAPE can also be run in batch mode. What this means is that we can provide a list of commands for KAPE to run in a file named <code>_kape.cli</code>. Then we keep this file in the directory containing the KAPE binary. When <code>kape.exe</code> is executed as an administrator, it checks if there is <code>_kape.cli</code> file present in the directory. If so, it executes the commands mentioned in the cli file. This mode can be used if you need someone to run KAPE for you, you will keep all the commands in a single line, and all you need is for the person to right-click and run kape.exe as administrator. For example, if we have to perform the same task as we did earlier in this task using batch mode, we will have to create a _kape.cli file with the following content:</p>\n\n\n<p><code>--tsource C: --target KapeTriage --tdest C:\\Users\\thm-4n6\\Desktop\\Target --mdest C:\\Users\\thm-4n6\\Desktop\\module --module !EZParser</code></p>\n\n<p>When we run <code>kape.exe</code>, it will perform the same tasks as when we ran it through CLI above.</p><p>Let\'s answer the questions below and get ready to put our newly learned skills to use in the next task.</p>', 'taskType': 'none', 'taskNo': 6, 'taskCreated': '2021-09-03T07:44:55.160Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Run the command <code>kape.exe</code> in an elevated shell. Take a look at the different switches and variables. What variable adds the collection timestamp to the target destination?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What variable adds the machine information to the target destination?</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Which switch can be used to show debug information during processing?</p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>Which switch is used to list all targets available?</p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>Which flag, when used with batch mode, will delete the _kape.cli, targets and modules files after the execution is complete?</p>', 'hint': 'Read the content shown in the image above'}]}, {'taskTitle': 'Hands-on Challenge', 'taskDesc': '<p>So, now that we have learned how to use KAPE let\'s put it into practice. For this task, you will need to utilize your skills gained in this room and the previous <a href="https://tryhackme.com/room/windowsforensics1" target="_blank">Windows Forensics 1</a> and <a href="https://tryhackme.com/room/windowsforensics2" target="_blank">Windows Forensics 2</a> rooms.</p><p>Organization X has an Acceptable Use Policy for their Portable Devices, including Laptops. This policy forbids users from connecting removable or Network drives, installing software from unknown locations, and connecting to unknown networks. It looks like one of the users has violated this policy. Can you help Organization X find out if the user violated the Acceptable Use Policy on their device? The user\'s machine is attached to the room as a VM.</p><p>Navigate to the KAPE directory placed on the Desktop in the attached VM. Run KAPE with your desired Target and Module options, and answer the following questions.</p><p><b>Hint:</b>\xa0You can use EZviewer placed in the EZtools folder on Desktop to open CSV files.</p>', 'taskType': 'none', 'taskNo': 7, 'taskCreated': '2021-09-03T11:18:00.153Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Two USB Mass Storage devices were attached to this Virtual Machine. One had a Serial Number\xa0 0123456789ABCDE. What is the Serial Number of the other USB Device?', 'hint': 'Check out the registry folder, and any artifacts related to USB Mass Storage Devices. Ignore the Input devices, bluetooth devices or Root hubs.'}, {'questionNo': 2, 'question': '<p>7zip, Google Chrome and Mozilla Firefox were installed from a Network drive location on the Virtual Machine. What was the drive letter and path of the directory from where these software were installed?</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>What is the execution date and time of CHROMESETUP.EXE in MM/DD/YYYY HH:MM?</p>', 'hint': 'Check out Recent Apps in Registry'}, {'questionNo': 4, 'question': '<p>What search query was run on the system?</p>', 'hint': 'Check out WordWheelQuery'}, {'questionNo': 5, 'question': '<p>When was the network named Network 3 First connected to?</p>', 'hint': 'MM/DD/YYYY HH:MM\nCheck out Last known networks'}, {'questionNo': 6, 'question': '<p>KAPE was copied from a removable drive. Can you find out what was the drive letter of the drive where KAPE was copied from?</p>', 'hint': 'Check out Automatic Destinations in FIleFolderAccess'}]}, {'taskTitle': 'Conclusion', 'taskDesc': '<p>Phew! Windows Forensics keeps on getting interesting.\xa0</p><p>You can stick around and find out what other exciting artifacts you found in the VM. You can let us know what you found interesting in this room using our <a href="https://discord.gg/tryhackme" target="_blank">Discord channel</a> or\xa0<a href="http://twitter.com/realtryhackme" target="_blank">Twitter account</a>.</p><p>Furthermore, you can try running KAPE on your machine and see what information you can find.\xa0</p>', 'taskType': 'none', 'taskNo': 8, 'taskCreated': '2022-01-13T16:41:13.095Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Read the above', 'hint': ''}]}]}