{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/a6f8594ac725601dc212c12d36c9ad07.png', 'title': 'Preparation', 'description': 'A look into the Preparation phase of the Incident Response.', 'code': 'preparation', 'users': 2550, 'tags': ['security', 'incident response', 'preparation', 'soc'], 'type': 'walkthrough', 'difficulty': 'medium', 'userCompleted': False, 'upVotes': 143, 'created': '2023-05-03T09:45:09.245Z', 'published': '2023-09-05T15:08:16.228Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://tryhackme-images.s3.amazonaws.com/user-uploads/63da722f2d207d0049da10b1/room-content/61912ab22fdfaf75dc8e6f948c923dea.png', 'creator': 'SecurityNomad', 'tasks': [{'taskTitle': 'Introduction', 'taskDesc': '<p style="text-align:left">\n    Welcome to our <b>Incident Response</b> module\'s <b>Preparation </b>phase<b>.</b></p>\n<p align="left" style="text-align:left">\n    This room covers preparing for security incidents and configuring logging to gather artefacts and additional evidence effectively before a security incident.\n</p>\n<h2>\n    <span style="font-size:24px">Module Scenario</span>\n</h2>\n<p align="left" style="text-align:left">\n    Our organisation <b>SwiftSpend Financial (SSF)</b>,\xa0has hired you as the IR guy for our incident response team, which is being finalised. You noticed that absolutely nothing had been done so far about documenting the baseline network and system activities - heck, there\'s barely any documentation to begin with!\n</p>\n<p align="left" style="text-align:left">\n    We\'re lucky that there\'s at least a semblance of a foundation of a detection system in place, as the IT has followed security best practices (amazing, right?), including turning on the logging for our endpoints, subnetting our different departments, ensuring all systems are in PowerShell v5, and enabling event log forwarding. </p><p align="left" style="text-align:left">However, you identify some configurations that have not been set up and deem the organisation not fully mature in its incident response procedures.</p>\n\n<h2>\n    <span style="font-size:24px">Learning Objectives</span>\n</h2>\n    <ul>\n        <li style="text-align:left">To understand the need for an incident response capability.</li>\n        <li style="text-align:left">To understand the need for the process, people and technologies for incident response.</li>\n    </ul>\n\n\n<h2>\n    <span style="font-size:24px">Room Prerequisites</span>\n</h2>\n<p align="left" style="text-align:left">Before starting with this room, we recommend you complete the <a href="https://tryhackme.com/path-action/soclevel1/join">SOC Level 1</a> Learning Path.</p>', 'taskType': 'none', 'taskNo': 1, 'taskCreated': '2023-05-09T05:03:36.924Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "I'm ready to prepare the organisation to respond to incidents.", 'hint': ''}]}, {'taskTitle': 'Incident Response Capability', 'taskDesc': '<h2><span style="font-size:24px">Incident Response Debrief</span></h2>\n<p style="text-align:left">Knowing that we are tackling the incident response process in this\nroom, you are expected to be familiar with the fact that\nincident response is usually coupled with digital forensics concepts. <strong>Incident response, also known as incident\nhandling</strong>, is a cyber security function that uses various\nmethodologies, tools and techniques to detect and manage adversarial\nattacks while minimising impact, recovery time and total operating\ncosts. Addressing attacks requires containing malware infections,\nidentifying and remediating vulnerabilities, as well as sourcing, managing, and\ndeploying technical and non-technical personnel.</p>\n<p style="text-align:left">Setting up an incident response capability requires organisations to\nmake several decisions, including having a specific definition for the\nterm "incident" to fit a clear scope. Therefore, we can differentiate\nevents and incidents as the following:</p>\n<ul>\n<li style="text-align:left"><strong>Event:</strong> This is an observed occurrence within a\nsystem or network. It ranges from a user connecting to a file server, a\nuser sending emails, or anti-malware software blocking an\ninfection.</li>\n<li style="text-align:left"><strong>Incident:</strong> This is a violation of security\npolicies or practices by an adversary to negatively affect the\norganisation through actions such as exfiltrating data, encrypting through ransomware, or causing a denial of services.</li>\n</ul>\n\n<h2><span style="font-size:24px">The Incident Response Process</span></h2>\n<p style="text-align:left">As an overview, we shall look at the IR process below. This process\nis meant to serve as a roadmap for incident responders, allowing them to\nadapt as they progress through their investigations and mitigations.</p>\n<p style="text-align:left">The remainder of the room will cover the first phase, <b>Preparation</b>,\nwhile the rest will be tackled in follow-up rooms.</p>\n<p style="text-align:left">The notable IR process consists of the following phases:</p>\n<ul>\n<li style="text-align:left"><strong>Preparation</strong>: Ensures that the organisation can\neffectively react to a breach with laid down procedures.</li>\n<li style="text-align:left"><strong>Identification</strong>: Operational deviations must be\nnoted and determined to cause adverse effects.</li><li style="text-align:left"><b>Analysis or Scoping:\xa0</b>The organisation determines the extent of a security incident, including identifying the affected systems, the type of data at risk, and the potential impact on the organisation.</li>\n<li style="text-align:left"><strong>Containment</strong>: Damage limitation is paramount, therefore, isolating affected systems and preserving forensic evidence is required.</li>\n<li style="text-align:left"><strong>Eradication</strong>: Adversarial artefacts and techniques\nwill be removed, restoring affected systems.</li>\n<li style="text-align:left"><strong>Recovery &amp;</strong>\xa0<b>Lessons Learned</b>: Business operations are to resume fully\nafter removing all threats and restoring systems to full function. Additionally, t<span style="font-size:1rem">he organisation considers the\nexperience, updates its response capabilities, and conducts updated\ntraining based on the incident.</span></li>\n</ul>\n<p style="text-align:justified"><lottie-player src="https://lottie.host/b0e08b00-74c0-4d1d-b620-0f4aff26f66b/DPbdMyNnR4.json" background="transparent" speed="1" style="width:70%;float:center;margin:auto;display:block" loop autoplay></lottie-player></p>\n\n<h2><span style="font-size:24px">Need for Incident Response Plan</span></h2>\n<p style="text-align:left">Incident response capability benefits from organising response\nprocesses into a consistent methodology. Additionally, the information\ngathered during the process would strengthen defences against future\nattacks on systems and data. This is where an incident response plan\ncomes into play.</p>\n<p style="text-align:left">An<strong>\xa0incident response plan (IRP)</strong> is a document\nthat outlines the steps an organisation will take to respond to an incident. The IRP should be the organisation\'s Swiss Army knife,\ncomprehensively covering all aspects of the incident response process,\nroles and responsibilities, communication channels between stakeholders, and metrics to capture the effectiveness of the IR process.</p>\n<p style="text-align:left">To have an effective incident response plan, you would have gone\nthrough numerous iteration processes via creating templates and\nrefactoring the process. This ensures that you can ingest incident data\nand mitigate breaches as they occur accurately. The templates would also\nbe valuable in creating incident reports.</p>\n<p style="text-align:left">Accompanying an incident response plan is the use of playbooks. The\nplaybooks would provide the organisation with actions and procedures to\nidentify, contain, eradicate, recover and track successful incident\nmitigation measures.</p>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2023-05-09T05:03:40.260Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is an observed occurrence within a system?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What is described as a violation of security policies and practices?</p>', 'hint': ''}, {'questionNo': 3, 'question': 'Under which incident response phase do organisations lay down their procedures?', 'hint': ''}, {'questionNo': 4, 'question': '<p>Under which phase will an organisation\xa0<span style="font-size:1rem">resume b</span><span style="font-size:1rem">usiness operations fully and update its response capabilities?</span></p>', 'hint': ''}]}, {'taskTitle': 'People and Documentation Preparation', 'taskDesc': '<p style="text-align:left">As we begin looking at the first phase, it is essential to know that\nthe purpose of preparation in incident handling is to ensure that your\nteam and organisation are ready to handle and recover from incidents.\nNumerous elements should be covered during the <b>Preparation</b> phase,\nincluding people, policy, technology, communication and\ndocumentation.</p>\n<h2><span style="font-size:24px">Preparing The People</span></h2>\n<p style="text-align:left">It is highly known that the easiest and most accessible attack point\nfor any organisation is its people. Your employees and teammates are\nadversarial targets, mainly through social engineering and phishing\ntactics. Therefore, preparing your team effectively to recognise and\naddress incidents before, during, and after is essential.</p>\n\n<h3><span style="font-size:20px">Creation of CSIRT Teams</span></h3>\n<p style="text-align:left">You must create a cyber security\nincident response team (CSIRT) that includes business, technical, legal\ncounsel, and public relations experts with relevant skills and authority\nto act upon decisions during a cyber attack. Following the team\'s\ncreation, the members will require appropriate permissions under a\nwell-established access control policy. This access must be well\norganised and controlled, with proper notifications to system\nadministrators when the CSIRT uses privileged access.</p>\n<h3><span style="font-size:20px">Training &amp; Assessment Sessions</span></h3><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5fc2847e1bbebc03aa89fbf2/room-content/7732fdca43cf84ebbad796cf638179cb.png" style="width:429.125px;float:right;height:261.6px" class="note-float-right" alt="An image showcasing a training session taking place." />\n<p style="text-align:left">As we have identified some ways attackers target people, the most\neffective way to ensure they are well-equipped with knowledge about\nthese attacks is through constant training, assessment, and awareness\nsessions. Conducting social engineering campaigns, testing user\nsusceptibility towards spear phishing attacks, and providing current\naffairs training will be crucial towards preparing your team.</p>\n<p style="text-align:left">This training also applies to your end users and customers, who would\nact as your sensors and alert sources when they pick up anything\nsuspicious happening on their end. In this case, training content like\nthe <a href="https://tryhackme.com/module/phishing" target="_blank">Phishing Analysis Module</a> we provide would be vital to internal and\nexternal stakeholders to know how to detect and respond to phishing\nattacks.</p>\n<p style="text-align:left">Additionally, incident handlers must be familiar with forensic\nimaging tools, how to read audit logs, and performing analysis using\nhoneypots and vulnerable systems. This will allow them to identify\nsuspicious events when they occur and can conduct practical forensics\nwhen the need arises.</p>\n\n<h2>Preparing The Documentation</h2><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5fc2847e1bbebc03aa89fbf2/room-content/b869969e2069706db3660e9a8cd6f28b.png" style="text-align:left;width:379px;float:right;height:379px" class="note-float-right" alt="An image displaying the documentation process" /><p>Incident documentation would be a lifesaver for an organisation. The\ninformation gathered could be used as evidence in a criminal cyber\nattack or instrumental in developing mitigation plans, and lessons\nlearned assessments. This means that incident responders need to develop\nnote-taking and detail-oriented skills.</p>\n\n<h3><span style="font-size:20px">Policies</span></h3>\n<p style="text-align:left">Defining principles and guidelines for security processes is vital\nwhile conducting your preparation. This ensures that techniques are\nwell-known towards handling an incident. The policies need to be visible\nto employees, users and other stakeholders, for example, through warning\nbanners, which would inform on the prohibition of unauthorised\nactivities and limit the presumption of privacy within the\norganisation.</p>\n<p style="text-align:left">Additionally, the policies should outline the organisation\'s\nauthority towards monitoring the network and all the systems under its\nroof. Policies would need to be reviewed by a legal team and aligned to\nlocal privacy laws and regulations.</p>\n\n<h3><span style="font-size:20px">Communication Plan &amp; Chain of Custody</span></h3>\n<p style="text-align:left">Accompanying the policies would be a communication plan outlining who\nwithin the CSIRT team should be the point of contact and what procedures\nshould be followed. For example, the CSIRT may have operations members\nwho are always on call to receive reports on suspected incidents. These reports should trigger a chain of actions, including when to notify\nlaw enforcement, media personnel, or third parties. Additionally, the\nteam would keep track of the flow of information and manage evidence\nforms and documents, such as the chain of custody documents. These documents are meant to track the flow of information, evidence handling and reporting when addressing any incident. A template of such a document can be downloaded from this task above.</p>\n\n<h3><span style="font-size:20px">Response Procedures</span></h3>\n<p style="text-align:left">Incident handling should be viewed as an organisational operation,\nensuring every member has a role to avert damages and revert to normal\noperations. This means that default procedures need to be defined and\napproved by management. Effectiveness and timeliness are crucial when\nsecurity defences have been breached; thus, orderly processes would\ndetermine the nature of handling breaches.</p>', 'taskType': 'downloadable', 'taskNo': 3, 'taskCreated': '2023-05-09T05:03:41.522Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '64c398bec88939004c0c4052', 'questions': [{'questionNo': 1, 'question': 'A group that handles events involving cyber security breaches, comprising individuals with different skills and expertise, is known as?', 'hint': ''}, {'questionNo': 2, 'question': '<p>Which documents would be used to accompany any evidence collected and keeps track of who handles the investigation procedures?</p>', 'hint': ''}]}, {'taskTitle': 'Technology Preparation', 'taskDesc': '<p style="text-align:left">The people and policies set up by the CSIRT would require the backing\nof tools and solutions to protect and defend their organisation\'s\ntechnological infrastructure. Any incident response operation involves\nthe organisation of devices, systems, and technologies that will\nfacilitate the prevention, detection, and mitigation of any occurrence.\nAs a result, knowing your technical infrastructure is essential to the\nincident response process.</p>\n<h2><span style="font-size:24px">Asset Inventory Classification</span></h2>\n<p style="text-align:left">It is crucial to identify high-value assets within the organisation,\ntogether with their technical composition. This will comprise the\ninfrastructure, intellectual property, client and employee data, and\nbrand reputation. Protecting these assets ensures that the\nconfidentiality, integrity, and availability of the organisation\'s services, data, and\nprocesses are intact, which also helps maintain credibility.\nAdditionally, the asset classification will be helpful for the\nprioritisation of protective and detective measures for the assets.</p>\n<p style="text-align:left">An example of an inventory list would be as follows. Do take note\nthat it is advisable to have hardware and software inventory lists for\nproper tracking.</p>\n<table class="table table-bordered table-hover">\n\n<thead>\n<tr>\n<th>Asset Type</th>\n<th>Asset Name</th>\n<th>Operating System</th>\n<th>Asset IP Address</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mail Server</td>\n<td>MailSrvr1</td>\n<td>Windows Server 2019</td>\n<td>192.168.0.2</td>\n</tr>\n<tr>\n<td>Web Server</td>\n<td>WebSrvr1</td>\n<td>Ubuntu Server 20.04</td>\n<td>192.168.0.3</td>\n</tr>\n<tr>\n<td>VPN Server</td>\n<td>VPN1</td>\n<td>Ubuntu Server 20.04</td>\n<td>192.168.0.4</td>\n</tr>\n<tr>\n<td>Software</td>\n<td>THM_MathBooks</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Software</td>\n<td>TruckFinder</td>\n<td></td>\n<td></td>\n</tr>\n</tbody>\n</table>\n\n<h2><span style="font-size:24px">Technical Instrumentation</span></h2>\n<p style="text-align:left">Once the inventory has been identified, this should be followed up\nwith telemetry about the network infrastructure, which is essential for\nincident response. This means mapping every network device, cloud\nplatform, system, and application.\xa0Having this infrastructural picture simplifies the implementation of system and sensor-based detection mechanisms. These mechanisms include anti-malware, endpoint detection and response (EDR) tools, data loss prevention (DLP), intrusion detection and prevention systems (IDPS), and log collection capabilities.</p>\n<p style="text-align:left">One key aspect of the telemetry collection is network subnetting.\nThis is a means of logically grouping network devices and IPs with\nspecific access and usage permissions and policies, utilising firewalls,\ndemilitarised zones, and IP segmentation. These telemetry and incident details can be collected and tracked using tools like <a href="https://tryhackme.com/room/thehiveproject" target="_blank">TheHive Project</a>. However, note that TheHive may have been updated since the release of the room.</p>\n<p style="text-align:center"><img src="https://docs.strangebee.com/assets/images/hero-thehive.png" style="caret-color:rgb(0, 0, 0);color:rgb(0, 0, 0);text-align:start;width:100%" alt="An image showing the dashboard view of TheHive." /><br /></p>\n\n<h2><span style="font-size:24px">Investigation Capabilities</span></h2>\n<p style="text-align:justify"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5fc2847e1bbebc03aa89fbf2/room-content/a7845f2528c371de4974e2b8641fc2e0.png" style="text-align:left;float:right;width:25%" class="note-float-right" alt="The image shows an example of a jump bag useful to an incident responder." /></p>\n<p>To conduct any investigations during an attack or breach, incident\nresponders must ensure they can validate executing scripts and\ninstallers on all endpoints and hosts within their network and implement\ntechnical capabilities to facilitate attack containment, analysis, and replication. There should be means of collecting forensic evidence using disk and memory imaging tools, secure storage only accessible to the CSIRT, and analysis tools such as sandboxes. Accompanying these efforts should be an incident-handling <b>jump bag</b>. This bag contains all the necessary tools for incident\nresponse. Each kit will be unique; however, as an incident responder,\nthe following items are worth having in your arsenal:</p>\n<ul>\n<li style="text-align:left">Media drives to store evidence being collected.</li>\n<li style="text-align:left">Disk imaging and host forensic software such as FTK Imager,\nEnCase, and The Sleuth Kit.</li>\n<li style="text-align:left">Network tap to mirror and monitor traffic.</li>\n<li style="text-align:left">Cables and adapters such as USB, SATA, and card readers to\naccommodate common scenarios.</li>\n<li style="text-align:left">PC repair kits that include screwdriver sets and tweezers.</li>\n<li style="text-align:left">Copies of incident response forms and communication playbooks.</li></ul>', 'taskType': 'none', 'taskNo': 4, 'taskCreated': '2023-05-09T05:03:42.607Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What would a kit containing the necessary incident-handling tools be called?', 'hint': ''}]}, {'taskTitle': 'Visibility', 'taskDesc': '<p style="text-align:left">After setting up the people, processes, and technology checks for your\nincident response effort, you must know what is happening within your\norganisation\'s digital assets. This ensures that you avoid digital\nobliviousness by having visibility across the network.</p>\n<p style="text-align:left">What does visibility entail? Visibility covers collecting\naudit and logs data, monitoring threat intelligence feeds on emerging\nadversarial tactics, techniques, and procedures (TTPs) and ingesting\nvendor patch advisories. These information sources allow the\norganisation to detect, identify, assess, alert, and mitigate\nunauthorised and abnormal activity within the network. Internal\nvisibility revolves around log management, and having\nmaximum coverage should be part of the cyber resilience and incident\nhandling strategies. In contrast, external visibility entails being aware of\nwhat is happening within the community and the threat landscape.</p>\n<p style="text-align:left">Knowing the benefits that visibility will provide within the\nincident-handling process is essential. The following are a few of the\nbenefits:</p>\n<ul>\n<li style="text-align:left">Provides factual information about access to resources, time of\naccess, and who conducted the activity.</li>\n<li style="text-align:left">Visibility through log management can help improve the effectiveness\nof processes, policies, and procedures.</li>\n<li style="text-align:left">With log data collected, incidents can be handled using concrete\nevidence.</li>\n<li style="text-align:left">Compliance with regulations is made to be easier with the collection\nof log data.</li>\n<li style="text-align:left">Keeps you up-to-date with emerging threats, TTPs, and\nsignatures.</li>\n<li style="text-align:left">Ensures that systems are patched up regularly.</li>\n</ul>\n<h2><span style="font-size:24px">Visibility via Logs</span></h2>\n<p style="text-align:left">Every computing device within an organisation\'s network can\ngenerate and store logs. The challenge of aggregating the logs is addressed by using <a href="https://tryhackme.com/room/introtosiem" target="_blank">Security Information Event Management (SIEM)</a>\nsolutions, which provide a central storage and analysis platform. Logs\nmust be secured from any modification once recorded. Additionally, as a\nCSIRT team member, you should be aware that the collection of logs\nenables the other stages of the incident response process to run as\nsmoothly as possible.</p>\n<p style="text-align:left">Common types of log entries to enable and monitor include:</p>\n<ul>\n<li style="text-align:left"><strong>Event:</strong> These logs record information about a system\nor network occurrence, such as login attempts, application events and\nnetwork traffic.</li>\n<li style="text-align:left"><strong>Audit:</strong> These cover a sequential recording of\nactivities within a system by capturing who performed an action, what\nactivity was initiated, and how the system responded. There are two\nclasses of audit logs: <b>Success</b> and <b>Failure</b>.</li>\n<li style="text-align:left"><strong>Error:</strong> When a problem occurs within a system, such\nas service failure, the events would be recorded as error logs.</li>\n<li style="text-align:left"><strong>Debug:</strong> During the testing of systems and services, debug logs are recorded to help find problems\nand facilitate troubleshooting.</li>\n</ul>\n<p style="text-align:left">The log entries would be sourced from various avenues within an\norganisation\'s infrastructure. Some familiar sources of logs\ninclude:</p>\n<ul>\n<li style="text-align:left"><strong>Network logs:</strong> These are mainly collected from\nnetwork devices such as switches and routers and through packet capture\nsolutions.</li>\n<li style="text-align:left"><strong>Host perimeter logs:</strong> These are mainly facilitated\nby firewalls, proxies, and VPN servers. They contain information about\nallowed and denied actions transmitted to the organisation\'s host\ndevices.</li>\n<li style="text-align:left"><strong>System logs:</strong> These logs record events and services\nbeing run by the operating system.</li>\n<li style="text-align:left"><strong>Application logs:</strong> These are logs collected from the\napplications being run internally. They may include web applications,\ncloud services, databases and proprietary tools.</li>\n</ul>\n<p style="text-align:centre"><lottie-player src="https://lottie.host/b3cf5ded-2b3c-4f50-b694-c94f30f69ae0/7cbkulU5lX.json" background="Transparent" speed="1" mode="normal" loop autoplay style="width:70%;float:center;margin:auto;display:block"></lottie-player></p>\n\n<h2><span style="font-size:24px">Setting up Visibility</span></h2>\n<p style="text-align:left">Before we dive into the contents of setting up visibility, start the virtual machine by clicking on the green "<b>Start Machine"</b> button on the upper-right section of this task. Give it about<b>\xa04 minutes</b>\xa0to load up in Split View fully. If the machine doesn\'t appear, press the blue <b>"Show Split View"</b> button on the top-right of this room.</p>\n<p style="text-align:left">As we have identified the sources and types of logs to be collected,\nthe CSIRT has to develop procedures and plans for setting up the right\ntools and configuration policies within systems outlined in the asset\ninventory to collect and aggregate all the necessary logs. On Windows\nsystems, security policies can be configured via local or group policy\nmanagement, with the latter being used for multiple systems under an\nActive Directory.</p>\n\n<p style="text-align:left">Let us look at an example of setting up the policies for Interactive\nLogon sessions which have yet to be defined, as you can see below. Once the VM has loaded up, open the <b>Windows Administrative Tools</b> via the <b>Start Menu</b> and find the <b>Local Security Policy</b> settings. We can then navigate to the following policy:\xa0<code>Security Settings -&gt; Local Policies -&gt; Security Options -&gt; Interactive logon: Display user information when the session is locked.</code></p>\n\n<p style="text-align:left">Once here, you will find that the policy: <b>Interactive logon:\nDisplay user information when the session is locked</b> has not been\ndefined. This policy aims to set the standard of whether to show user\nlogin identities, such as username, domain account, and email, when their\nsession is locked. For sensitive systems, such as those used by the\nFinance or Human Resource departments, it is recommended to set this\npolicy to the option that does not display any user information to\nprevent malicious actors from knowing whose credentials were last\nused.</p>\n<p><lottie-player src="https://lottie.host/6715d566-4d83-46a3-bb41-e4c3d9c70dc2/26GWmlrVaN.json" background="transparent" speed="1" style="width:100%;display:block" loop autoplay></lottie-player></p>\n<p style="text-align:left">What about the events taking place within the systems? Do these need logging and visibility?</p><p style="text-align:left">You can pivot to the linked room to uncover more about <a href="https://tryhackme.com/room/windowseventlogs" target="_blank">Windows Event Logs</a>; however, looking at our\nscenario, you find out that the organisation did not implement Windows Event monitoring.</p>\n<p style="text-align:left"> The network systems have event\nlogging disabled, which is integral to ensuring visibility, as\nadversaries may take advantage of this situation to cause havoc. So, how\ndo you resolve this?</p>\n<p style="text-align:left">The first thing to check is the current situation via the Event\nViewer. Open the <b>Event Viewer</b>\xa0pinned on the Taskbar, and you will be welcomed with a warning banner informing you that the Event Log service is\nunavailable. This means that the registry records for the service have\nbeen modified and need to be changed to enable it.</p>\n\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5fc2847e1bbebc03aa89fbf2/room-content/5d048288077c5f33c2015a5cf7b220f5.png" style="width:70%" alt="The image shows the error message displayed when the Event Viewer is opened when disabled." /></p>\n<p style="text-align:left">Navigating through the Registry via:<code>Windows Administrative Tools -&gt; Registry Editor -&gt; HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\EventLog\\start</code>. You will find that the registry key value is set to 4, which needs to be set to 2, representing putting the service into automatic startup mode. Modify the registry and reboot the system for the changes to take effect, which should take 3 minutes.<br /></p>\n\n<p style="text-align:center"><lottie-player src="https://lottie.host/daaa1849-17e7-418f-b863-f0feef1b1ea2/zxOkbP9kok.json" background="transparent" speed="1" style="width:100%;display:block" loop autoplay></lottie-player></p>\n\n<p style="text-align:left">Once the system has been rebooted, you can open the Windows Event Viewer and confirm it works. We can test that the system is recording logs by using some Atomic Red Team tests, which have already been downloaded and installed, to simulate an incident. Open a PowerShell session and run the following commands:</p>\n\n<div class="terminal-container">\n    <div class="terminal-content defender">\n        <div class="terminal-top" style="text-align:left">\n            Ransomware Atomic Test Run\n        </div>\n<pre class="terminal-code" style="text-align:left"><code class="language-powershell">PS C:\\Users\\Administrator&gt;Invoke-AtomicTest T1486 -ShowDetailsBrief\n\nT1486-5 PureLocker Ransom Note\n\nPS C:\\Users\\Administrator&gt;Invoke-AtomicTest T1486-5\nPathToAtomicsFolder = C:\\AtomicRedTeam\\atomics\n\nExecuting test: T1486-5 PureLocker Ransom Note\nDone executing test: T1486-5 PureLocker Ransom Note</code>\n</pre>\n</div>\n</div>\n\n<p style="text-align:left">Navigating through the Windows Event Logs, under the <code>Application and Service Logs -&gt; Microsoft -&gt; Windows -&gt; Sysmon -&gt; Operational</code><b></b>\xa0we can confirm that our test was successful and a log entry was created for it by searching for the test we ran. It is easier to use the <b>Find</b>\xa0feature to identify the event due to the influx of logs being recorded since the service was enabled.</p>\n\n<p style="text-align:left"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5fc2847e1bbebc03aa89fbf2/room-content/c247ea5088292e45411cdc677a62f0e0.png" style="width:100%" alt="The image is showing a successful Process Create event log recording using Sysmon." /></p>', 'taskType': 'vm', 'taskNo': 5, 'taskCreated': '2023-05-09T05:03:43.966Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '64ec9c7b1fffab018ddcaf58', 'questions': [{'questionNo': 1, 'question': 'What is the <b>Event ID</b> for the <b>File Created</b> rule associated with the test?', 'hint': ''}, {'questionNo': 2, 'question': '<p>Under the<b> Software Restriction Policies</b>, what is the default security level assigned to all policies?</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Find the <b>Audit Policy</b> folder under <b>Local Policies</b>. What setting has been assigned to the policy <b>Audit logon events</b>?</p>', 'hint': ''}]}, {'taskTitle': 'Conclusion', 'taskDesc': '<h2>Wrapping up <img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5fc2847e1bbebc03aa89fbf2/room-content/16edf47301103d89bd4079374b326bd1.png" style="width:25%;float:right" class="note-float-right" alt="An image demonstrating the identification of malicious activity on a computer." /></h2>\n<p>Establishing an incident response process is vital to any organisation, and preparation is at the forefront of this process. As we have covered in the room, the <b>Preparation</b> step of the IR Lifecycle covers various aspects around people, policies, and technology.</p><p>Setting up your organisation with the proper training, defining the correct policies and procedures, and having visibility through log and event monitoring ensures you are on hand to tackle any adversarial attempts.</p><p>Various frameworks within the field cover the best practices for incident response. Among them is the<a href="https://nvlpubs.nist.gov/nistpubs/specialpublications/nist.sp.800-61r2.pdf" target="_blank"> Computer Security Incident Handling Guide</a> by NIST.</p><p>As you have gathered information and set up your visibility, it is time to go into the Incident Response Lifecycle\'s Identification and Scoping stages.</p>', 'taskType': 'none', 'taskNo': 6, 'taskCreated': '2023-05-09T05:03:46.280Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Systems and networks prepared. Time to identify incidents.', 'hint': ''}]}]}