{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/45b3fa32cb65b9475a47f3a3d6857e49.png', 'title': 'Spring4Shell: CVE-2022-22965', 'description': 'Interactive lab for exploiting Spring4Shell (CVE-2022-22965) in the Java Spring Framework', 'code': 'spring4shell', 'users': 8103, 'tags': ['spring4shell', 'vulnerability', 'RCE', 'Java', 'Spring', 'CVE-2022-22965', 'Walkthrough', 'Tutorial', 'InitialAccess', 'Beginner', 'MuirlandOracle', 'Spring Core'], 'type': 'walkthrough', 'difficulty': 'info', 'userCompleted': False, 'upVotes': 440, 'created': '2022-04-02T05:30:33.880Z', 'published': '2022-04-04T16:36:43.747Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://assets.muirlandoracle.co.uk/thm/rooms/spring4shell/banner.png', 'creator': 'MuirlandOracle', 'tasks': [{'taskTitle': '<span class="badge badge-soft-info size-16">Info</span> Introduction and Deploy', 'taskDesc': '<p>In late March 2022, two remote command execution vulnerabilities in the Java <a href="https://spring.io/" target="_blank">Spring framework</a> were made public. The first of these vulnerabilities affects a component of the framework called "Spring Cloud Functions". The second, arguably more serious vulnerability, affects a component in\xa0 "Spring Core" —\xa0 the heart of the framework — thus significantly increasing the vulnerability\'s potential impact and earning it the name "Spring4Shell" (a play on <a href="https://tryhackme.com/room/solar" target="_blank"> Log4Shell</a>, the name of a brutal vulnerability disclosed at the end of 2021).</p><p>For various reasons, there has been a lot of confusion surrounding these vulnerabilities in the wider infosec community. As such, this room may be updated as new information comes to light. On a similar note, the impact of Spring4Shell is currently unknown; only time will tell how wide-spread the vulnerability is in the wild.<br /></p><p>This\n room will provide an overview of the Spring4Shell RCE vulnerability in Spring Core, as well as give you\n an opportunity to exploit it for yourself in the vulnerable machine \nattached to this task. W<span style="font-size:1rem">e will start by \ntaking a look at the vulnerability at a high-level, before \nexploiting the target machine for ourselves.</span></p><p><span style="font-size:1rem">Let\'s begin!<br /></span><span style="font-size:1rem"></span></p>', 'taskType': 'vm', 'taskNo': 1, 'taskCreated': '2022-04-02T18:52:13.213Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '62490b5ddfc40f0051bf7dff', 'questions': [{'questionNo': 1, 'question': '<p>Deploy the target machine by clicking the green button at the top of this task!</p><p><i><b>Note:</b> This machine will take 2-3 minutes to start up completely.</i><br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(201,207,255,.18);color:#c9cfff">Tutorial</span> Vulnerability Background', 'taskDesc': '<p><b><span style="font-size:24px">Overview</span></b></p><p>Spring4Shell was originally released as an 0-day in a now-deleted thread of Tweets. It was quickly identified as a bypass of the patch for <a href="https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2010-1622" target="_blank">CVE-2010-1622</a> — a vulnerability in earlier versions of the Spring Framework which allowed attackers to obtain remote command execution by abusing the way in which Spring handles data sent in HTTP requests. In short, the vulnerability allows attackers to upload a "webshell" (a piece of code which accepts commands from the attacker that the webserver is then tricked into executing) to the vulnerable server, achieving remote command execution.<br /></p><p><br /></p><p><b><span style="font-size:24px">How Does it Work?</span></b><br /></p><p>To understand Spring4Shell, it is important that we understand CVE-2010-1622. Spring MVC (<b>M</b>odel-<b>V</b>iew-<b>C</b>ontroller)\n is part of the Spring Framework which makes it easy to develop web \napplications following the MVC design pattern. One of the features of \nSpring MVC is that it automatically instantiates and populates an object\n of a specified class when a request is made based on the parameters sent to the endpoint. \nIn simple terms, this could be abused to overwrite important attributes \nof the parent class, resulting in remote code execution. </p>Spring4Shell works along similar lines, bypassing the mitigations that were added to patch CVE-2010-1622. The majority of the exploits for the Spring4Shell vulnerability operate by forcing the application to write a malicious <code>.jsp</code> file (effectively plaintext Java which Tomcat can execute — much like a PHP webserver would execute files with a <code>.php</code> extension) to the webserver. This webshell can then be executed to gain remote command execution over the target.<br /><p></p><p><br /></p><p><b><span style="font-size:24px">Limitations</span></b><br /></p><p> </p><p>Fortunately, despite how commonly used the Spring Framework is, the conditions in which the vulnerability can be exploited are actually fairly limited.<br /></p><p>The Spring4Shell vulnerability affects Spring Core before version 5.2, as well as in versions 5.3.0-17 and 5.2.0-19, running on a version of the <b>J</b>ava <b>D</b>evelopment <b>K</b>it (JDK) greater than or equal to 9. The publicly available exploits currently available only work on applications deployed to \nApache Tomcat as WARs; however, the Spring Framework maintainers have \nstated that they believe there may be other ways to exploit the \nvulnerability.</p><p>Current conditions for vulnerability (as stated in <a href="https://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement" target="_blank">Spring\'s announcement of the vulnerability</a>) can be summarised as follows:</p><ul><li>JDK 9+</li><li>A vulnerable version of the Spring Framework (&lt;5.2 | 5.2.0-19 | 5.3.0-17)<br /></li><li>Apache Tomcat as a server for the Spring application, packaged as a WAR</li><li>A dependency on the <code>spring-webmvc</code> and/or <code>spring-webflux</code> components of the Spring Framework<br /></li></ul><p>It is worth noting, however, that these may change over time as other ways to exploit the vulnerability are discovered.</p><p><br /></p><p><b><span style="font-size:24px">Remediations</span></b></p><p>Fortunately, patched versions of the Spring Framework have been released. To remediate Spring4Shell, ensure that you are using a version of Spring released after patch 18 of minor release 5.3 (i.e. after 5.3.18), or after patch 20 if using minor release 5.2 (i.e. after 5.2.20). Upgrading the version of the framework is enough to remove the vulnerability from your applications.</p><p>If upgrading is not possible, it is possible to somewhat mitigate this vulnerability by setting a blocklist of vulnerable field patterns. More advice on this can be found <a href="https://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement" target="_blank">here</a>.<br /></p><p></p>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2022-04-02T18:54:27.667Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Read the task information and understand how Spring4Shell works at a high level.<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(252,190,108,.18);color:#fcbe6c">Practical</span> Exploitation', 'taskDesc': '<p><b><span style="font-size:24px">Downloading The Exploit</span></b><br /></p><p>We\'ve covered the theory, now it\'s time to exploit the target!</p><p>As this is a network-based exploit, you will need to use the TryHackMe AttackBox or a local VM in order to run the exploit.</p><p>Copies of the exploit code can be obtained in three places:</p><ul><li>Attached to this task, accessible using the blue "Download Task Files" button.</li><li>On port 8080 of the target machine (<code>http://MACHINE_IP:8080/exploit.zip</code>).</li><li>Directly on the AttackBox (<code>/root/Rooms/Spring4Shell/exploit.py</code>). This will already have been extracted from the archive for your convenience.<br /></li></ul><p>Use whichever method is easiest to obtain a copy of the <code>exploit.zip</code> zipfile. The password for this archive is <b><code>TryHackMe123!</code></b>.</p><p>When you unzip the archive you should find a single Python script: <code>exploit.py</code>. This is a modified version of the proof of concept that is currently circulating online — it is slightly more user friendly than the original (obtained <a href="https://github.com/BobTheShoplifter/Spring4Shell-POC" target="_blank">here</a>); however, you may use whichever version you wish. This task will assume that you are using the code provided.</p><p><br /></p><p><b><span style="font-size:24px">The Exploit</span></b><br /></p><p>Read through the exploit code and ensure that you are happy that it does what it claims to do. You should <i>always</i> review unknown exploits before running them.</p>\n<p>Having satisfactorily completed our code review, let\'s start by taking a look at the help menu for the exploit:</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Exploit Help Menu\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@attacker:~$ ./exploit.py --help\nusage: exploit.py [-h] [-f FILENAME] [-p PASSWORD] [-d DIRECTORY] url\n\nSpring4Shell RCE Proof of Concept\n\npositional arguments:\n  url                   Target URL\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -f FILENAME, --filename FILENAME\n                        Name of the file to upload (Default tomcatwar.jsp)\n  -p PASSWORD, --password PASSWORD\n                        Password to protect the shell with (Default: thm)\n  -d DIRECTORY, --directory DIRECTORY\n                        The upload path for the file (Default: ROOT)</code>\n        </pre>\n    </div>\n</div>\n\n<p>The script requires one argument: <code>url</code> — this specifies the target for the POST request. The other three optional arguments can be ignored in the current context.</p><p>Let\'s start by taking a look at the website in a browser (<code>http://MACHINE_IP/</code>)<br /></p>We can easily find our target URL by checking the source code of the website homepage (<code>view-source:http://MACHINE_IP/</code>). <p></p><p>Specifically we are looking for the "action" of the contact form (the only POST request available to us). This is found on line 20:</p><p><code>&lt;form id="contactForm" action="<span style="color:red">/</span>" method="post"&gt;</code><br /></p><p>The action is "<code>/</code>", meaning that our target URL will simply be: <code>http://MACHINE_IP/</code>.</p><p><i><b>Note:</b> the trailing slash is very important here!</i><br /></p><p><br /></p><p><b><span style="font-size:24px">Attack</span></b></p><p>Time to use the exploit!</p><p>Execute the script (if you\'re using the AttackBox navigate to the folder /root/Rooms/spring4shell). You should receive output similar to the following:</p>\n<div class="terminal-container">\n    <div class="terminal-content">\n        <div class="terminal-top">\n            Running the Exploit\n        </div>\n        <pre class="terminal-code">           <code class="language-shell-session">user@attacker:~$ ./exploit.py http://MACHINE_IP/\nShell Uploaded Successfully!\nYour shell can be found at: http://MACHINE_IP/tomcatwar.jsp?pwd=thm&amp;cmd=whoami</code>\n        </pre>\n    </div>\n</div>\n\n\n<p>A webshell should now have been uploaded!</p><p>Navigate to the link provided by the exploit to see this in action. You can change which command gets run by changing the <code>cmd</code> parameter. By default the command is <code>whoami</code>.</p><p><i><b>Note:</b> Once the exploit has been used successfully once, it cannot be used again until the application has been restarted. If you upload the webshell with the wrong name or directory path then you will need to terminate and re-deploy the target machine. </i><br /></p>', 'taskType': 'downloadable', 'taskNo': 3, 'taskCreated': '2022-04-02T18:54:38.388Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '624907500dca21004afbc6ee', 'questions': [{'questionNo': 1, 'question': 'Follow the steps in the task to exploit Spring4Shell and obtain a webshell.<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p><b>[Bonus Question: Optional]</b> Use your webshell to obtain a reverse/bind shell on the target.<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': 'What is the flag in <code>/root/flag.txt?</code><br />', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-info size-16">Info</span> Conclusion', 'taskDesc': '<p>Congratulations, you have reached the end of the Spring4Shell room!</p><p>Having‌‌‌‌‌﻿‌‌ ‌‌‌‌‍‬‍‌completed‌‌‌‌‍‬‌‍ this‌‌‌‌‍﻿‬‍ room, you should hopefully have a high‌‌‌‌‌‬‌‌-level‌‌‌‌‍﻿‍﻿‌‌‌‌‍‬‌‍‌‌‌‌‍﻿‌﻿ understanding ‌‌‌‌‌‬‌‌of the vulnerability, ‌‌‌‌‍‬‬‌and be comfortable ‌‌‌‌‍‬‍‍attacking ‌‌‌‌‍﻿‌‬applications vulnerable to CVE-2022-‌‌‌‌‍‬‍‍22965.</p><p>As mentioned previously, this vulnerability has the potential to be very widespread, but only time will tell how serious it truly is. Keep an eye out, and make sure that you patch any systems you are responsible for!</p><p>If you would like to read more about Spring4Shell, you may find the following resources informative:<br /></p><ul><li><a href="https://spring.io/blog/2022/03/31/spring-framework-rce-early-announcement" target="_blank">Spring RCE Announcement</a><br /></li><li><a href="https://www.lunasec.io/docs/blog/spring-rce-vulnerabilities/" target="_blank">LunaSec Blog Post</a></li><li><a href="https://www.praetorian.com/blog/spring-core-jdk9-rce/" target="_blank">Praetorian Blog Post</a></li><li><a href="http://blog.o0o.nu/2010/06/cve-2010-1622.html" target="_blank">o0o Writeup for CVE-2010-1622</a><br /></li></ul>', 'taskType': 'none', 'taskNo': 4, 'taskCreated': '2022-04-02T18:53:36.243Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'I understand and can abuse Spring4Shell!<br />', 'hint': ''}]}]}