{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/59af706bab0041e7e0662755c06e90f0.jpeg', 'title': 'WebOSINT', 'description': 'Conducting basic open source intelligence research on a website', 'code': 'webosint', 'users': 14517, 'tags': ['osint', 'webosint', 'osintstan'], 'type': 'challenge', 'difficulty': 'easy', 'userCompleted': False, 'upVotes': 662, 'created': '2021-01-01T14:50:46.404Z', 'published': '2021-02-19T19:00:00.081Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://i.imgur.com/RlXUj5V.jpg', 'creator': 'OSINTStan', 'tasks': [{'taskTitle': 'When A Website Does Not Exist', 'taskDesc': '<p><span style="font-size:1rem">What\'s the first thing you do when you are given the name of a business to check out? Fire up the ol\' web browser, find the website and check it out, right?</span><br /></p><p>What if the website, or even the entire business, no longer exists?</p><p><span style="font-size:1rem">That does NOT mean it\'s the end of the road.</span><br /></p><p><span style="font-size:1rem">OSINT researchers may still be able to connect the dots and find useful information on such organizations.</span></p><p><span style="font-size:1rem">Your job is to find as much information as you can about the website RepublicofKoffee.com.</span></p><p>&lt;Spoiler alert&gt; the website doesn\'t exist, and if it does by the time you read this, the website in its current form is not our target.</p><p>One way to collect information about a website without directly visiting it is to simply do a search for it.</p><p><b style="font-size:1rem">Note:\xa0</b><span style="font-size:1rem">Sometimes plugging a website into the search bar will send you directly to the site. Avoid this by putting the site in quote marks. Also note that this will only return results where the full domain name is written out on the website.</span></p><p>Go ahead and google "RepublicOfKoffee.com" with and without quote marks, just to see what happens.</p>', 'taskType': 'none', 'taskNo': 1, 'taskCreated': '2021-01-01T14:52:04.995Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Click To Complete', 'hint': ''}]}, {'taskTitle': 'Whois Registration', 'taskDesc': '<p>Just because nothing shows up when you visit \'RepublicOfKoffee.com,\' doesn\'t mean that someone doesn\'t own the domain. In fact, if there is any kind of landing page at all, even a spammy one, then you can be sure that someone does, in fact, own it. But is it currently owned by the same person that used it for the time period we are interested in? We may or may not be able to figure that out, but it\'s worth a look.</p><p>We can confirm current registration status with a whois lookup.</p><p>A \'whois\' lookup is the most basic form of domain recon available. There are multiple websites that will do it for you as well.</p><p>Personally, I recommend just going directly to <a href="https://lookup.icann.org/lookup" target="_blank">lookup.icann.org</a>. This should tell you the current hosting company used and name servers. Looking at the raw data option will show further details.</p><p>We\'re looking for any data we might be able to use as pivot points. Maybe an email address? Or better yet, a physical address or phone number?</p><p><b><i>Technically</i></b> these are required in order to register any domain, but most domain registrars offer some kind of privacy protection for a trivial fee, if not free.</p><p>Anyway, let\'s see what we can find out!</p>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2021-01-01T17:29:48.419Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is the name of the company the domain was registered with?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What phone number is listed for the registration company? (do not include country code or special characters/spaces)</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>What is the first nameserver listed for the site?</p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>What is listed for the name of the registrant?</p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>What country is listed for the registrant?</p>', 'hint': ''}]}, {'taskTitle': 'Ghosts of Websites Past', 'taskDesc': "<p>Don't be discouraged when your initial searches on a website turn up empty.</p><p>That's where Archive.org and the Internet Wayback Machine come into play.</p><p>Do yourself a favor and install the archive.org browser extension that will automatically pull up an option to search for a site on the Wayback Machine when it fails to load in the web browser.</p><p>Either with the browser extension, or just by going to archive.org and searching for it, see what snapshots are available of our target domain, RepublicOfKoffee.com.</p><p>Looking at the historical information available for the site, you should be able to answer the following questions without too much trouble.</p>", 'taskType': 'none', 'taskNo': 3, 'taskCreated': '2021-01-01T15:44:29.348Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "What is the first name of the blog's author?", 'hint': 'No "about" or "contact" page is available in the snapshots, you\'ll have to look in the blog posts'}, {'questionNo': 2, 'question': '<p>What city and country was the author writing from?</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>[Research] What is the name (in English) of the temple inside the National Park the author frequently visits?</p>', 'hint': ''}]}, {'taskTitle': 'Digging into DNS', 'taskDesc': "<p>So far we've gathered some good info about the content that was on our target website, even though it hasn't been live for several years.</p><p>But what about technical details?</p><p>That's where ViewDNS.info<a> </a>comes in.</p><p>ViewDNS.info provides a convenient UI for looking up registration information on a target website. Using this information, it may be possible to draw certain conclusions that are not clearly spelled out, such as whether the website is hosted on a shared or dedicated IP address. The answer to this question can imply things about the website's budget as well as traffic.</p><p>Take a look at the search options available and see if you can answer these questions.</p>", 'taskType': 'none', 'taskNo': 4, 'taskCreated': '2021-01-01T16:03:43.580Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "What was RepublicOfKoffee.com's IP address as of October 2016?", 'hint': 'Try a search that provides historic IP address information'}, {'questionNo': 2, 'question': '<p>Based on the other domains hosted on the same IP address, what kind of hosting service can we safely assume our target uses?</p>', 'hint': "What kind of hosting plan is usually used by websites on a tight budget that don't have a lot of visitors?"}, {'questionNo': 3, 'question': '<p>How many times has the IP address changed in the history of the domain?</p>', 'hint': ''}]}, {'taskTitle': 'Taking Off The Training Wheels', 'taskDesc': '<p><span style="font-size:24px">﻿</span>Congratulations on making it this far.</p><p>You\'ll need all of the skills you\'ve learned so far for this task.</p><p>All I have for you, is a domain:</p><p><span style="font-size:24px"><b>heat[dot]net</b></span></p><p>Good luck!</p>', 'taskType': 'none', 'taskNo': 5, 'taskCreated': '2021-01-01T17:54:53.258Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is the second nameserver listed for the domain?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What IP address was the domain listed on as of December 2011?</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Based on domains that share the same IP, what kind of hosting service is the domain owner using?</p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>On what date did was the site first captured by the internet archive? (MM/DD/YY format)</p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>What is the first sentence of the first body paragraph from the final capture of 2001?</p>', 'hint': ''}, {'questionNo': 6, 'question': '<p>Using your search engine skills, what was the name of the company that was responsible for the original version of the site?\xa0</p>', 'hint': ''}, {'questionNo': 7, 'question': '<p>What does the first header on the site on the last capture of 2010 say?</p>', 'hint': ''}]}, {'taskTitle': 'Taking A Peek Under The Hood Of A Website', 'taskDesc': '<p>Isn\'t it kind of interesting how the website disappeared for a period of time and came back?</p><p>Clearly the purpose of the site is different now. Let\'s roll up our sleeves and figure out what\'s going on.</p><p>First, do you have any gut feelings about this site? What is your overall impression? Does it <i>feel</i> like a legitimate source of information?</p><p>Why?</p><p>You might consider some of the following points:</p><ul><li>Language - What grade level is the writing? Does it seem to be written by a native English speaker?</li><li>UX - Is it user friendly? Is the design modern?</li><li>What pages does the site have?</li></ul><p><span style="font-size:1rem">I can tell you that this website conforms well to antiquated search engine optimization (SEO) best practices. You can read more about </span><a href="https://ahrefs.com/blog/seo-best-practices/" target="_blank">SEO best practices on ahrefs</a>\xa0if you like before you continue.</p><p><span style="font-size:24px"><b>Technical Research</b></span></p><p><span style="font-size:1rem">Often, clues about a website and its creator/owner may be unintentionally left behind in the source code of the website. Pretty much every web browser will have a method of doing this. It is well worth taking the time to become acquainted with how this works in your browser of choice. For Chrome on MacOS, you\'ll go to the top menu bar and choose View &gt; Developer &gt; View Source.</span></p><p><span style="font-size:1rem"><b><i>Note: This also works on sites you visit within Archive.org\'s Wayback Machine.</i></b></span></p><p><span style="font-size:1rem">Once the source code of the page loads, it\'s time to look around. You don\'t have to understand HTML, CSS, or Javascript to read notes that the developers left behind for themselves. In HTML, comments begin with the characters &lt;!--. Here\'s an example of what a forgotten comment might look like in practice:</span></p><p><code>&lt;!--Don\'t forget to email Bob Loblaw when the site goes live at bob@fakeemail.com--&gt;</code><span style="font-size:1rem"></span></p><p><span style="font-size:1rem">As easy as that may be to read, if it was buried inside a gigantic page full of code it could still be easy to miss. That\'s where ctrl-F comes in. Here are some good things to search for with ctrl-f:</span></p><p><span style="font-size:1rem"><br /></span></p><table class="table table-bordered"><tbody><tr><td>Search Term</td><td>Explanation</td><td>More information</td></tr><tr><td>&lt;!--</td><td>Comments</td><td>See above</td></tr><tr><td>@</td><td>email addresses</td><td><a href="https://nixintel.info/osint/12-osint-resources-for-e-mail-addresses/" target="_blank">Pivoting from an Email address</a></td></tr><tr><td>ca-pub</td><td>Google Publisher ID</td><td><a href="https://support.google.com/adsense/answer/105516?hl=en" target="_blank">Google\'s Description</a></td></tr><tr><td>ua-</td><td>Google AdSense ID</td><td><a href="https://www.bellingcat.com/resources/how-tos/2015/07/23/unveiling-hidden-connections-with-google-analytics-ids/" target="_blank">Bellingcat Tutorial</a></td></tr><tr><td>.jpg</td><td>Also try other image file extensions</td><td>Likely to reveal more directory structure</td></tr></tbody></table><p>Finding any of the above data gives you a potential pivot point. The Bellingcat article linked above goes into more detail on how exactly to do it but you don\'t have to overcomplicate things!</p><p>You can always just take any of the above information and plug it back into your favorite search engine and you may just strike gold!</p><p>Ready to put this all into practice?\xa0</p><p>These following questions refer to\xa0<span style="font-size:1rem">heat[dot]net/36/need-to-hire-a-commercial-heating-contractor/</span></p><p>Have at it!</p>', 'taskType': 'none', 'taskNo': 6, 'taskCreated': '2021-01-09T08:09:15.747Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'How many internal links are in the text of the article?', 'hint': 'Hover over the links with your mouse cursor to inspect whether each link points to another site on the heat[.]net site or an external site.'}, {'questionNo': 2, 'question': 'How many external links are in the text of the article?', 'hint': 'Hover over the links with your mouse cursor to inspect whether each link points to another site on the heat[.]net site or an external site.'}, {'questionNo': 3, 'question': "<p>Website in the article's only external link ( that isn't an ad)</p>", 'hint': ''}, {'questionNo': 4, 'question': '<p>Try to find the Google Analytics code linked to the site</p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>Is the the Google Analytics code in use on another website? Yay or nay</p>', 'hint': 'If you get stuck, run it through nerdydata.com'}, {'questionNo': 6, 'question': '<p>Does the link to this website have any obvious affiliate codes embedded with it? Yay or Nay</p>', 'hint': 'Just look for extraneous information within the a href code'}]}, {'taskTitle': 'Final Exam: Connect the Dots', 'taskDesc': "<p>Experienced OSINT researchers will tell you that chasing rabbit holes all day and night without being able to make some solid connections is not OSINT.</p><p>OSINT refers to the patterns that start to emerge as we connect the dots in the analysis of the data.\xa0</p><p>Congrats! you found that our target, heat[.]net, links to an interesting external site. A question remains though: <b><i>Why???</i></b></p><p>There is no affiliate code in the link, so there is no obvious financial connection between the two. Maybe there's another kind of connection.</p><p>This is your final exam, and there is exactly one question.</p><p>Get busy!</p>", 'taskType': 'none', 'taskNo': 7, 'taskCreated': '2021-01-09T08:51:37.565Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Use the tools in Task 4 to confirm the\xa0link between the two sites. Try hard to figure it out without the hint.', 'hint': 'Historical domain information is going to be the key. '}]}, {'taskTitle': 'Debriefing', 'taskDesc': '<p>Congratulations on completing the challenge! In fact, it is highly probable that both of these sites are owned and operated by the same entity.</p><p>Let\'s unpack this.</p><p>Although there are loads of advertisements on our target website, that is probably a tiny percentage of the money this site makes.</p><p>It would require further investigation to confirm this but it\'s a good bet that the creators of these two sites make most of their money by functioning as what\'s called a private blog network (PBN). PBNs exist for one purpose: to convince the search engine algorithms that another\xa0site should rank higher in the search engine results.</p><p>Modern search engines work by mapping the internet by its links. This gets extremely complicated very quickly, but as a generalization they work on a few assumptions:</p><p><span></span></p><p style="list-style-type:disc;font-size:11pt;font-family:Arial;color:rgb(0, 0, 0);background-color:transparent;font-weight:400;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre"></p><p style="list-style-type:disc;font-size:11pt;font-family:Arial;color:rgb(0, 0, 0);background-color:transparent;font-weight:400;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre"></p><ul></ul><p></p><ol><li style="line-height:1.38;margin-top:0pt;margin-bottom:0pt"><span style="font-style:normal;font-size:11pt;font-family:Ubuntu;color:rgb(0, 0, 0);background-color:transparent;font-weight:400;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap">How well a site answers users\' questions on a topic can be evaluated by the incoming, outgoing, and internal links it has. The presence of a lot of links </span><span style="font-size:11pt;font-family:Ubuntu;color:rgb(0, 0, 0);background-color:transparent;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap"><b><i>to</i></b></span><span style="font-style:normal;font-size:11pt;font-family:Ubuntu;color:rgb(0, 0, 0);background-color:transparent;font-weight:400;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap"> website A </span><span style="font-size:11pt;font-family:Ubuntu;color:rgb(0, 0, 0);background-color:transparent;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap"><b><i>from</i></b></span><span style="font-style:normal;font-size:11pt;font-family:Ubuntu;color:rgb(0, 0, 0);background-color:transparent;font-weight:400;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap"> websites B, C, D, and E is taken as a sign that website A is authoritative on the topic. Outgoing links are treated a little differently. Too many outgoing links can </span><span style="font-size:11pt;font-family:Ubuntu;color:rgb(0, 0, 0);background-color:transparent;font-weight:400;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap"><i>hurt</i></span><span style="font-style:normal;font-size:11pt;font-family:Ubuntu;color:rgb(0, 0, 0);background-color:transparent;font-weight:400;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap"> a site\'s ranking, but search engines also assume that a website with too </span><span style="font-size:11pt;font-family:Ubuntu;color:rgb(0, 0, 0);background-color:transparent;font-weight:400;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre-wrap"><i>few</i> outgoing links is probably not answering users\' questions very well either.</span></li><li style="line-height:1.38;margin-top:0pt;margin-bottom:0pt"><span style="background-color:transparent;color:rgb(0, 0, 0);font-family:Ubuntu;font-size:11pt;white-space:pre-wrap">How authoritative the websites are that are sending and receiving links. If your site gets plugged in a New York Times article, that will earn far more ‘Google juice’ than a plug on CedarHillsHomeownersAssociation.xyz.</span></li><li style="line-height:1.38;margin-top:0pt;margin-bottom:0pt"><span style="background-color:transparent;color:rgb(0, 0, 0);font-family:Ubuntu;font-size:11pt;white-space:pre-wrap">Relevance of the incoming links to a site. A link to a site from top tier websites like the New York Times is always going to be a very good thing. Almost as good, though, would be a link from a reputable website dedicated to the same topic as yours. The relevance of the language used in the hyperlink itself is also an important part of this consideration.</span></li></ol><p><span style="font-size:1rem">Let\'s say we are creating a new website. In order to get some SEO juice flowing to it, we\'ll need to get another website to start linking to our site as fast as possible. A common (white hat) method of doing this would be volunteering to write free blog articles on other websites in exchange for links back to your site.</span></p><p>As you can imagine, this takes a lot of time. It is a long term endeavor that could take six months or so to see results, depending on how much competition there is for the keywords you are targeting.</p><p>Thinking like a hacker here, what\'s a good way to give your new website (called \'money site\') a faster boost in the search engine rankings? Highlight the below section once you have an idea in your head.</p><p><span style="background-color:rgb(0, 0, 0)">By setting up a separate website that is completely under your control and exists for the sole purpose of telling search engines that your main site should rank higher in searches than it rightfully deserves.</span></p><p>That\'s right, heat[.]net, in its current form is probably not designed for human eyes at all. It is designed primarily to trick the search engines into placing purchase[.]org higher in the search results than it would have otherwise.</p><p><span style="font-size:1rem">Purchase[.]org</span>\xa0appears to be a drop shipping e-commerce site, which probably earns its owner substantially more money than heat[.]net. It needs that sweet sweet SEO juice to push it up the search engine results pages (AKA SERPs) though.</p><p><b>Is all of this ethical?</b> Good question. Google, for one, would clearly define this practice as black hat and is constantly trying to improve its algorithms to penalize sites that do this kind of thing. As of this writing, though, it is not illegal.</p><p><b>Is the site a scam? </b>It is worth considering how much time and effort that goes into setting up a PBN. A PBN ideally has a minimum of 50 pages of unique, natural-sounding and on-topic articles.\xa0<span style="font-size:1rem">That\'s a lot of time and effort that went into getting a fast, short-term bump in the rankings, rather than into other aspects of the business, or even something as simple and affordable as pay-per-click marketing.</span></p><p>On the other hand, you might be surprised to learn just how common it is for websites to hire SEO agencies. Some of these agencies, whether they admit it or not, have hundreds of PBNs and a staff of writers (usually offshore) pumping out content designed solely for the consumption of the search algorithms.</p>', 'taskType': 'none', 'taskNo': 8, 'taskCreated': '2021-01-01T18:26:08.212Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Click to complete', 'hint': ''}]}, {'taskTitle': 'Wrap-up', 'taskDesc': '<p><span style="font-size:1rem">A little web OSINT knowledge can go a long way in online investigations. A few examples of where it comes into play include any kind of business OSINT,\xa0</span><span style="font-size:1rem">online scams, or even political journalism. If you would like to see a prime example of this kind of research being put into practice, I highly recommend checking out NixIntel\'s expose <a href="https://nixintel.info/osint/website-osint-whats-the-link-between-antifa-com-and-russia/" target="_blank">linking antifa.com to Russia</a>, which is an amazing case study.</span></p><p>Make sure to check out the other OSINT boxes out there such as:</p><ul><li>The\xa0<a href="https://tryhackme.com/room/searchlightosint" target="_blank">Searchlight IMINT Room</a>\xa0<span style="font-size:1rem">and\xa0<a href="https://tryhackme.com/room/geolocatingimages" target="_blank">Geolocation</a>\xa0for Geolocation and Image Analysis</span></li><li>The\xa0<a href="https://tryhackme.com/room/googledorking" target="_blank">Google Dork</a>\xa0room for advanced search engine operators</li><li>The\xa0<a href="https://tryhackme.com/room/ohsint" target="_blank">OhSINT</a>\xa0room for a little extra IMINT practice</li></ul><p><span style="font-size:1rem">There are also two fantastic podcasts that every OSINT practitioner should regularly listen to. The\xa0</span><a href="https://osintcurio.us/" target="_blank">OSINT Curious</a><span style="font-size:1rem">\xa0podcast and </span><a href="https://inteltechniques.com/podcast.html" target="_blank">The Privacy, Security, &amp; OSINT Show</a><span style="font-size:1rem">.\xa0</span></p><p><span style="font-size:1rem">Finally, a solid paid option for OSINT training that won\'t break the bank is <a href="https://www.theosintion.com/" target="_blank">TheOSINTion</a>. If you enjoyed the content of this room you would LOVE the <a href="https://www.theosintion.com/courses/business-osint/" target="_blank">Business OSINT</a> course they offer. I have no affiliation with the course other than being a satisfied customer.</span></p>', 'taskType': 'none', 'taskNo': 9, 'taskCreated': '2021-01-09T15:03:34.228Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Update me..', 'hint': ''}]}]}