{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/e1797e301a9626f309686ec927866990.png', 'title': 'What is Networking?', 'description': 'Begin learning the fundamentals of computer networking in this bite-sized and interactive module.', 'code': 'whatisnetworking', 'users': 423497, 'tags': ['networking', 'networking fundamentals', 'networking labs', 'beginner', 'static sites', 'module', 'networking module', 'ping', 'network tools', 'what is networking', 'what is the internet', 'internet', 'icmp', 'mac'], 'type': 'walkthrough', 'difficulty': 'info', 'userCompleted': False, 'upVotes': 7328, 'created': '2021-05-26T12:51:06.342Z', 'published': '2021-07-01T10:43:41.452Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/fb870f148ec59025ce152964b8260af3.png', 'creator': 'cmnatic', 'tasks': [{'taskTitle': 'What is Networking?', 'taskDesc': '<p>Networks are simply things connected. For example, your friendship circle: you are all connected because of similar interests, hobbies, skills and sorts.</p>\n<p>Networks can be found in all walks of life:</p>\n<ul>\n<li>A city\'s public transportation system</li>\n<li>Infrastructure such as the national power grid for electricity</li>\n<li>Meeting and greeting your neighbours</li>\n<li>Postal systems for sending letters and parcels</li>\n</ul>\n<p>But more specifically, in computing, networking is the same idea, just dispersed to technological devices. Take your phone as an example; the reason that you have it is to access things. We\'ll cover how these devices communicate with each other and the rules that follow.</p><p>In computing, a network can be formed by anywhere from 2 devices to billions. These devices include everything from your laptop and phone to security cameras, traffic lights and even farming!</p><p>Networks are integrated into our everyday life. Be it gathering data for the weather, delivering electricity to homes or even determining who has the right of way at a road. Because networks are so embedded in the modern-day, networking is an essential concept to grasp in cybersecurity.</p>\n\n<p>Take the diagram below as an example, Alice, Bob and Jim have formed their network! We\'ll come onto this a bit later on.</p>\n\n<p><lottie-player src="https://lottie.host/0cba78cd-3623-4fa4-9f4d-9effc23e66bc/0Jd5XEZ4Zb.json" background="transparent" speed="1" style="width:50%" loop autoplay></lottie-player></p>\n\n<p>Networks come in all shapes and sizes, which is something that we will also come on to discuss throughout this module.\xa0</p>', 'taskType': 'none', 'taskNo': 1, 'taskCreated': '2021-06-03T10:47:08.226Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is the key term for devices that are connected together?', 'hint': ''}]}, {'taskTitle': 'What is the Internet?', 'taskDesc': '<p>Now that we\'ve learnt what a network is and how one is defined in computing (just devices connected), let\'s explore the Internet.</p><p>The Internet is one giant network that consists of many, many small networks within itself. Using our example from the previous task, let\'s now imagine that Alice made some new friends named Zayn and Toby that she wants to introduce to Bob and Jim. The problem is that Alice is the only person who speaks the same language as Zayn and Toby. So Alice will have to be the messenger!</p>\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/80f74ce74cc4e3772ed20433fb88607b.png" style="width:629.313px;height:707.094px" /><br /></p>\n<p>Because Alice can speak both languages, they can communicate to one another through Alice — forming a new network.</p><p>The first iteration of the Internet was within the ARPANET project in the late 1960s. This project was funded by the United States Defence Department and was the first documented network in action. However, it wasn\'t until 1989 when the Internet as we know it was invented by Tim Berners-Lee by the creation of the <b>W</b>orld <b>W</b>ide <b>W</b>eb (<b>WWW</b>). It wasn\'t until this point that the Internet started to be used as a repository for storing and sharing information, just like it is today.</p><p>Let\'s relate Alice\'s network of friends to computing devices. The Internet looks like a much larger version of this sort of diagram:</p><p><br /></p><p style="text-align:center"><img src="https://assets.tryhackme.com/additional/networking-fundamentals/intro-to-networking/what-is-the-internet/internet2.png" style="width:851.997px" /></p><p>As previously stated, the Internet is made up of many small networks all joined together.\xa0 These small networks are called private networks, where networks connecting these small networks are called public networks -- or the Internet!\xa0<span style="font-size:1rem">So, to recap, a network can be one of two types:</span><br /></p><ul><li>A private network<span style="font-size:1rem"><br /></span></li><li><span style="font-size:1rem">A public network</span></li></ul><p>Devices will use a set of labels to identify themselves on a network, which we will come onto in the task below.</p>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2021-06-03T10:47:14.546Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Who invented the World Wide Web?', 'hint': 'It was created in the Year 1989'}]}, {'taskTitle': 'Identifying Devices on a Network', 'taskDesc': '<p>To communicate and maintain order, devices must be both identifying and identifiable on a network. What use is it if you don\'t know whom you\'re talking to at the end of the day?</p><p>Devices on a network are very similar to humans in the fact that we have two ways of being identified:</p>\n<ul>\n<li>Our Name</li>\n<li>Our Fingerprints</li>\n</ul>\n<p>Now we can change our name through deed poll, but we can\'t, however, change our fingerprints. Every human has an individual set of fingerprints which means that even if they change their name, there is still an identity behind it. Devices have the same thing: two means of identification, with one being permeable. These are:</p>\n<ul>\n<li>An IP Address</li>\n<li>A Media Access Control (MAC) Address -- think of this as being similar to a serial number.</li></ul><ul>\n</ul>\n<h3><b><u><br /></u></b></h3><h3><b><u>IP Addresses</u></b></h3>\n<p>Briefly, an IP address (or <b>I</b>nternet <b>P</b>rotocol) address can be used as a way of identifying a host on a network for a period of time, where that IP address can then be associated with another device without the IP address changing. First, let\'s split up precisely what an IP address is in the diagram below:</p>\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/a0de0d68641982ddf1a8c5a9f1984c4c.png" style="width:655.26px;height:279.906px" /><span style="font-size:1rem"><br /></span></p><p>An <b>IP</b>\xa0address is a set of numbers that are divided into four octets. The value of each octet will summarise to be the IP address of the device on the network. This number is calculated through a technique known as IP addressing &amp; subnetting, but that is for another day. What\'s important to understand here is that IP addresses can change from device to device but cannot be active simultaneously more than once within the same network.</p><p>IP Addresses follow a set of standards known as protocols. These protocols are the backbone of networking and force many devices to communicate in the same language, which is something that we\'ll come onto another time. However, we should recall that devices can be on both a private and public network. Depending on where they are will determine what type of IP address they have: a public or private IP address.</p><p>A public address is used to identify the device on the Internet, whereas a private address is used to identify a device amongst other devices. Take the table &amp; screenshot below as an example. Here we have two devices on a private network:</p><div><br /></div><table class="table table-bordered"><tbody><tr><td><b>Device Name</b></td><td><b>IP Address</b></td><td><b>IP Address Type</b></td></tr><tr><td>DESKTOP-KJE57FD</td><td>192.168.1.77</td><td>Private</td></tr><tr><td>DESKTOP-KJE57FD</td><td>86.157.52.21</td><td>Public</td></tr><tr><td>CMNatic-PC</td><td>192.168.1.74</td><td>Private</td></tr><tr><td>CMNatic-PC</td><td>86.157.52.21<br /></td><td>Public</td></tr></tbody></table><div style="text-align:center"><br /><img src="https://assets.tryhackme.com/additional/cmn-aoc2020/day-8/1.png" alt="https://assets.tryhackme.com/additional/cmn-aoc2020/day-8/1.png" style="font-size:1rem;max-width:100%;height:auto" /></div><p></p><p>These two devices will be able to use their private IP addresses to communicate with each other. However, any data sent to the Internet from either of these devices will be identified by the same public IP address. Public IP addresses are given by your <b>I</b>nternet <b>S</b>ervice <b>P</b>rovider (or <b>ISP</b>) at a monthly fee (your bill!)</p><p style="text-align:center"><img src="https://assets.tryhackme.com/additional/cmn-aoc2020/day-8/2.png" alt="https://assets.tryhackme.com/additional/cmn-aoc2020/day-8/2.png" style="max-width:100%;height:auto" /></p><p style="text-align:left">As more and more devices become connected, it is becoming increasingly harder to get a public address that isn\'t already in use. For example, Cisco, an industry giant in the world of networking, estimated that there would be approximately 50 billion devices connected on the Internet by the end of 2021. <a href="https://www.cisco.com/c/dam/en_us/about/ac79/docs/innov/IoT_IBSG_0411FINAL.pdf" target="_blank">(Cisco., 2021)</a>. Enter IP address versions. So far, we have only discussed one version of the Internet Protocol addressing scheme known as IPv4, which uses a numbering system of 2^32 IP addresses (4.29 billion) -- so you can see why there is such a shortage!</p><p style="text-align:left">IPv6 is a new iteration of the Internet Protocol addressing scheme to help tackle this issue. Although it is seemingly more daunting, it boasts a few benefits:</p><ul><li style="text-align:left">Supports up to 2^128 of IP addresses (340 trillion-plus), resolving the issues faced with IPv4</li><li style="text-align:left">More efficient due to new methodologies</li></ul><p style="text-align:left">The screenshot below compares both an IPv6 and IPv4 address.</p><p style="text-align:center"><img src="https://assets.tryhackme.com/additional/networking-fundamentals/intro-to-networking/ipv6.png" style="font-size:1rem;width:736px" /><br /></p><p><b><u><span style="font-size:1.75rem">MAC Addresses</span><br /></u></b></p>\n\n<p>Devices on a network will all have a physical network interface, which is a microchip board found on the device\'s motherboard. This network interface is assigned a unique address at the factory it was built at, called a <b>MAC</b> (<b>M</b>edia <b>A</b>ccess <b>C</b>ontrol ) address. The MAC address is a<b> twelve-character</b> hexadecimal number (<i>a base sixteen numbering system used in computing to represent numbers</i>) split into two\'s and separated by a colon. These colons are considered separators. For example, <i>a4:c3:f0:85:ac:2d</i>. The first six characters represent the company that made the network interface, and the last six is a unique number.</p><div style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/394caee97fb1b9f7b5a5f7a7ea0a9f71.png" style="width:649.27px;height:381px" /><br /></div>\n<p style="text-align:center"><br /></p><p style="text-align:center"></p><p>However, an interesting thing with MAC addresses is that they can be faked or "spoofed" in a process known as spoofing. This spoofing occurs when a networked device pretends to identify as another using its MAC address. When this occurs, it can often break poorly implemented security designs that assume that devices talking on a network are trustworthy. Take the following scenario: A firewall is configured to allow any communication going to and from the MAC address of the administrator. If a device were to pretend or "spoof" this MAC address, the firewall would now think that it is receiving communication from the administrator when it isn\'t.</p><p>Places such as cafes, coffee shops, and hotels alike often use MAC address control when using their "Guest "or "Public" Wi-Fi. This configuration could offer better services, i.e. a faster connection for a price if you are willing to pay the fee per device.\xa0 The <b>interactive lab attached to this task</b> has been made to replicate this scenario!</p><p><b><span style="font-size:24px"><u>Practical</u></span></b><br /></p><p>The interactive labs simulate a hotel Wi-Fi network where you have to pay for the service. You\'ll note that the router is not allowing Bob\'s packets ( blue) to the TryHackMe website and is placing them in the bin, but Alice\'s packets (green) are going through fine because she has paid for Wi-Fi. Try changing Bob\'s MAC address to the same as Alice\'s to see what happens.<br /></p><p>Deploy the interactive lab and proceed to answer the following questions below.</p>', 'taskType': 'static-site', 'taskNo': 3, 'taskCreated': '2021-06-03T10:47:16.681Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '60ba3f08437056aee2846966', 'questions': [{'questionNo': 1, 'question': 'What does the term "IP" stand for?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What is each section of an IP address called?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>How many sections (in digits) does an IP address have?\xa0<br /></p>', 'hint': 'This section is also known as an octet.'}, {'questionNo': 4, 'question': '<p>What does the term "MAC" stand for?<br /></p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>Deploy the interactive lab using the "View Site" button and spoof your MAC address to access the site.\xa0 What is the flag?</p>', 'hint': ''}], 'staticSites': [{'_id': '6538e16cd887eb047b1ec083', 'title': 'Free Hotel Wifi', 'url': 'https://static-labs.tryhackme.cloud/sites/hotel-wifi/', 'autoOpen': False}]}, {'taskTitle': 'Ping (ICMP)', 'taskDesc': '<div><div>Ping is one of the most fundamental network tools available to us. Ping uses <b>ICMP </b>(<b>I</b>nternet <b>C</b>ontrol <b>M</b>essage <b>P</b>rotocol) packets to determine the performance of a connection between devices, for example, if the connection exists or is reliable.</div><div><br /></div><div>The time taken for ICMP packets travelling between devices is measured by ping, such as in the screenshot below. This measuring is done using ICMP\'s echo packet and then ICMP\'s echo reply from the target device.</div><div><br /></div><div>Pings can be performed against devices on a network, such as your home network or resources like websites. This tool can be easily used and comes installed on Operating Systems (OSs) such as Linux and Windows. The syntax to do a simple ping is <code>ping IP address or website URL</code>. Let\'s see this in action in the screenshot below.</div><div><br /></div></div><p style="color:rgb(14, 16, 26);background:transparent;margin-top:0pt;margin-bottom:0pt;--darkreader-inline-color:#fbf4e7;--darkreader-inline-bgimage:initial;--darkreader-inline-bgcolor:transparent"><img src="https://assets.tryhackme.com/additional/networking-fundamentals/intro-to-networking/ping/ping1.png" style="width:577px" /></p><p style="color:rgb(14, 16, 26);background:transparent;margin-top:0pt;margin-bottom:0pt;--darkreader-inline-color:#fbf4e7;--darkreader-inline-bgimage:initial;--darkreader-inline-bgcolor:transparent"><br /></p><p style="background-image:initial;background-position:initial;background-size:initial;background-repeat:initial;background-attachment:initial;background-origin:initial;background-clip:initial;margin-top:0pt;margin-bottom:0pt;--darkreader-inline-color:#fbf4e7;--darkreader-inline-bgimage:initial;--darkreader-inline-bgcolor:transparent">Here we are pinging a device that has the private address of <i>192.168.1.254</i>. Ping informs us that we have sent six ICMP packets, all of which were received with an average time of 4.16 seconds.</p><p style="background-image:initial;background-position:initial;background-size:initial;background-repeat:initial;background-attachment:initial;background-origin:initial;background-clip:initial;margin-top:0pt;margin-bottom:0pt;--darkreader-inline-color:#fbf4e7;--darkreader-inline-bgimage:initial;--darkreader-inline-bgcolor:transparent"><br /></p><p style="background-image:initial;background-position:initial;background-size:initial;background-repeat:initial;background-attachment:initial;background-origin:initial;background-clip:initial;margin-top:0pt;margin-bottom:0pt;--darkreader-inline-color:#fbf4e7;--darkreader-inline-bgimage:initial;--darkreader-inline-bgcolor:transparent">Now you are going to do the same thing to ping the address of "<b>8.8.8.8</b>" on the deployable website in this task. Pinging the correct address will reveal a flag to answer the following question below.</p><ul>\n</ul>', 'taskType': 'static-site', 'taskNo': 4, 'taskCreated': '2021-06-04T02:42:15.645Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '6092dd79a2323e2d0e440ecf', 'questions': [{'questionNo': 1, 'question': 'What protocol does ping use?', 'hint': ''}, {'questionNo': 2, 'question': '<p>What is the syntax to ping 10.10.10.10?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>What flag do you get when you ping 8.8.8.8?<br /></p>', 'hint': ''}], 'staticSites': [{'_id': '6538e16cd887eb047b1ec085', 'title': 'Network Ping', 'url': 'https://static-labs.tryhackme.cloud/sites/networking-ping/', 'autoOpen': False}]}, {'taskTitle': 'Continue Your Learning: Intro to LAN', 'taskDesc': 'Continue your learning by joining the <a href="https://tryhackme.com/room/introtolan" target="_blank">"Intro to LAN" room.</a>', 'taskType': 'none', 'taskNo': 5, 'taskCreated': '2021-06-04T02:42:25.111Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>Join the <a href="https://tryhackme.com/room/introtolan" target="_blank">"Intro to LAN" room.</a></p>', 'hint': ''}]}]}