{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/e1566084619ac2e56f872e4f3a4faea3.png', 'title': 'Windows Reversing Intro', 'description': 'Introduction to reverse engineering x64 Windows software.', 'code': 'windowsreversingintro', 'users': 3804, 'tags': ['security', 're', 'reverse engineering', 'windows', 'reversing', 'x64', 'assembly', 'asm'], 'type': 'walkthrough', 'difficulty': 'medium', 'userCompleted': False, 'upVotes': 195, 'created': '2021-08-28T00:38:56.999Z', 'published': '2021-11-24T19:00:00.281Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://assets.tryhackme.com/img/banners/default_tryhackme.png', 'creator': 'Z0F', 'tasks': [{'taskTitle': '<span class="badge size-16" style="background-color:rgba(0, 255, 20,.15);color:#00ff99">Intro</span> Room Overview', 'taskDesc': '<p align="center"><u><b>Previous Room</b></u><br /><a href="https://tryhackme.com/room/win64assembly" target="_blank">https://tryhackme.com/room/win64assembly</a><br /></p>\n\n<p><br />This room is part of a series of rooms that will introduce you to reverse engineering software on Windows. This is going to be a fairly short and easy room in which you will be introduced to how higher-level concepts look at a lower level. You will also start to get familiar with IDA. We will use the skills learned here to perform more advanced reverse engineering techniques in future rooms.</p><p>The programs provided in this room are compiled with MSVC (C++ compiler built-in with Visual Studio) set to release mode for x64. Debug binaries and symbols will not be used to teach with, however, debug symbols will be provided for those who are curious. This is done to make everything as realistic as possible. Debug symbols are a luxury when reverse engineering, and aren\'t common when dealing with executables.</p><h4>Get Hands-On.</h4><p align="left"><u><b>When running the samples on their own, outside of IDA, run them via the command line.</b></u></p><p>Use the VM provided alongside this room to get hands-on with the material. This will greatly improve your experience and learning in this room. The VM has IDA Freeware installed along with the samples for the room.</p><p>VM Credentials:</p><ul><li><b>Username: </b>thm</li><li><b>Password: </b>THMWinRE!</li></ul><p>Quick note for the VM: When you load an executable into IDA you will be asked for debug symbols (a PDB). Say no to this. A further explanation as to why will be provided in the next task. If you attempt to download symbols IDA may crash.</p><h4>Bring your own VM!</h4>\nWhile the VM hosting on THM is great, they do have their limitations. Things such as processing power and internet access will make some tasks more difficult and it\'s for those reasons why I highly recommend you make a VM on your own computer. All you will need to do is install IDA Freeware and get the programs we will be reverse engineering.', 'taskType': 'vm', 'taskNo': 1, 'taskCreated': '2021-08-31T22:07:40.324Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '618017176efc020048c28382', 'questions': [{'questionNo': 1, 'question': "Let's get started!", 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(0, 255, 20,.15);color:#00ff99">Intro</span> IDA Overview', 'taskDesc': '<h2>Tool Introductions<br /></h2>\n\n<p>In this room, we will be using IDA Freeware. Historically the downside to IDA has always been its pricing, however, thanks to recent developments in other tools, the free version of IDA now has many more features than it used to. Other good tools include x64dbg, Ghidra, WinDBG, Radare2, and of course GDB. My daily drivers are x64dbg and Ghidra. IDA is used for this series since it\'s easy for beginners and results in us only having to use one tool.<br /></p><p>First, let\'s discuss static vs dynamic analysis. <b>Static </b>analysis involves looking at the program as it exists on disk; The program is never executed. <b>Dynamic </b>analysis involves analyzing the process as it runs. Dynamic analysis is usually preferred unless dealing with malware. Dynamic analysis allows you to see data in memory and how it\'s being used. Static on the other hand requires you to guess or do detailed reverse engineering to figure it out.</p><p>There are three main functionalities that our tools will provide, those are debugging, disassembling, and decompiling. <b>Disassemblers </b>will translate the program from its bytes on disk or in memory into its assembly code equivalent and present it in an informative way. <b>Decompilers </b>are similar to disassemblers except instead of giving us the assembly, it attempts to recreate the code in C/C++. The downside to decompilers is that they can be inaccurate, or lack information. Because of this, if you\'re using a decompiler it\'s a good idea to have the disassembled code next to the decompiled code to check for inaccuracies. <b>Debuggers</b>, alongside disassemblers and decompilers, will allow us to place breakpoints within the program while it\'s running and analyze registers,\n memory, statuses, and more. They also allow for changing data in memory while the program is running.</p>\n\n<h2>IDA Overview<br /></h2>\n<p>IDA is quite an extensive tool, I will only show you what you need to know. I <b>highly</b> encourage you to learn more about how to use IDA on your own time. It\'s not difficult to use, rather there\'s just a lot to it.\n\nFor the following explanations, I will be using notepad.exe (C:\\Windows\\System32\\notepad.exe).<br /></p><p>To load a program into IDA you can start IDA then follow the prompts, or you can alternatively just drag and drop the executable file onto the IDA icon on your Desktop. While loading the program into IDA it will prompt you about the type of file, you can just stick with the defaults. At some point, you will be asked about debug symbols (PDB). In the real world, get any debug symbols you can. Normally you will only have the debug symbols for Windows libraries. For the sake of this room, we won\'t use any except for what comes with the system by default.<br /></p>\n\n<h4><u>Debug Symbols<br /></u></h4>\n<p>\nDebug symbols are extremely helpful and you should use them when you can. Unfortunately, you will usually only have debug symbols for common libraries and rarely for the executable of interest. In addition to that, most reversing tools download symbols for common libraries so if you don\'t have an internet connection you won\'t get them. Note that because of this, don\'t attempt to download symbols in IDA when using the VM otherwise you will get errors and it may crash. In this room, we will go over the samples <b>without </b>their debug symbols to maintain as much realism as possible. However, for further learning purposes, debug symbols will be provided if you wish to manually load them.<br /></p><h4><u>Code Views<br /></u></h4>\n<p>The two primary views, listing and graph view, show the program in its disassembled form. You can switch between the two by pressing the space bar. I recommend you spend most of your time in graph view, as it shows the flow of the program.</p>\n\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/a47d33022ae2526933d169bca81f1a06.PNG" alt="IDA Graph View" style="width:50%" /></p>\n\n<p>As you can see in the graph view, the arrows represent the destination of jump instructions. This is incredibly useful and a massive time saver.<br /></p>\n\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/e4d0dba634cd54a6997e820c23fa5d13.PNG" alt="IDA Listing View" style="width:50%" /></p>\n\n<p>In the listing view, you can see slightly more information, however, it\'s much harder to understand the flow of the program.</p><p>You may find it helpful to enable Auto Comments by going to <i>Options &gt; General &gt; Disassembly (Selected by default) &gt; Auto Comments<br /></i>Play around with it on/off and see if you like it. I found it useful when I started since it describes what is happening in the assembly.</p>\n\n<p style="text-align:center"><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/04214c9a470ae01a1d65e20f91df4a3c.PNG" alt="IDA Decompiled/Pseudocode View" style="width:50%" /></p>\n\n<p><u><b>You need to have internet access to be able to decompile code with IDA Freeware, so it will NOT work in the provided VM.</b></u><br />IDA also has a decompiler. Do not become reliant on decompilers as they aren\'t always accurate and often have issues representing every instruction in longer sections of code. With that said, they are a great place to get a general idea of what\'s going on. To decompile, IDA calls it pseudocode, you can click on the area of code you want to decompile and press <i>F5</i>. You can also go to <i>View &gt; Open Subviews &gt; Generate Pseudocode</i>. </p><p><b>I will not be utilizing the decompiler feature of IDA for this series of rooms.</b></p>\n\n<h4><u>Imports/Exports</u></h4>\nThese tabs are pretty self-explanatory. The imports tab shows all of the functions imported by the current program from other sources. The exports tab shows all of the functions exposed by the current program. Note that the exports of an executable usually contain only the entry point (where the program starts executing from).\n\n<p></p><p></p><h4><u>Functions</u></h4>\nOn the left, you can see the Functions window which shows the identified functions for the current program. Depending on what symbols you have access to, you may have more or less functions with actual names. If there are no symbols to identify a function, it will instead be given a generic name such as sub_140001000 where 140001000 is the address of the function.\n\n<p></p><p></p><h4><u>Other Subviews</u></h4>\nYou can find other useful tabs/subviews under <i>View &gt; Open Subviews</i>. I encourage you to play around with the different subviews as there\'s a significant amount of information found within them. One subview in particular which you should get familiar with is the <i>Strings </i>subview. Here you can view all identified strings in memory. This can be helpful, as we will see later when finding a certain function or place of interest.<p></p>\n\n<h2>Further Learning<br /></h2>\nAs mentioned, IDA is packed full of stuff. I highly recommend you play around and get familiar with IDA. There are loads of guides, videos, and even books out there to assist you!<br />', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2021-08-31T22:07:58.548Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "Once you feel comfortable with IDA, let's start doing some reverse engineering!<br />", 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(0, 255, 255,.15);color:#00ffff">Explanation</span> Function Prologue/Epilogue', 'taskDesc': '<p>Remember how functions need stack frames? Function prologues and epilogues will set up, create, and destroy stack frames according to the calling convention in use. I will introduce them here and point them out as we encounter them on our journey.<br /></p>\n\n<h4><u>Prologue</u></h4>\n<p>\nThe prologue comes before the body of a function is executed. Not all prologues are the same, but here are three things that can happen and the order they usually happen in.</p><ol><li>Volatile registers are saved. If there is shadow space available, and the appropriate compilation options are chosen, the shadow space can be used to hold volatile registers. If there is no room in shadow space then registers are pushed onto the stack.</li><li>Space is allocated for the stack frame by subtracting from RSP. The amount subtracted from RSP can be used to determine the number of function parameters.</li><li>RSP or RBP may be preserved to be restored later. Since RBP isn\'t used much for stack purposes in x64 when it gets preserved it\'s likely <i>not </i>being preserved to keep a stack address safe, rather it\'s being treated the same as the other volatile registers. In the case that it <i>is </i>being used for stack purposes, you may see something along the lines of <code>mov RSP, RBP</code> which moves RSP to where RBP was at, setting up a new stack frame right next to the previous one.<br /></li></ol><p>Generally speaking, it\'s fine to skim over the function prologue, however, note that it can hint at how many parameters are passed to the function.<br /></p>\n\n<h4><u>Epilogue</u></h4>\n<p>The epilogue is pretty straightforward, it undoes/unwinds any stack-related things, mostly caused by the prologue. The epilogue can be a nice place to double-check you didn\'t miss anything within the prologue, but it\'s generally more useless to a reverse engineer than the prologue.</p><p>You may see the following in the epilogue:</p><ol><li><span style="font-size:1rem">Addition to RSP to restore/delete the stack frame.</span></li><li><span style="font-size:1rem">Restoring registers, usually done by popping registers off the stack which were pushed on the stack during the prologue.</span></li><li><span style="font-size:1rem">Return.</span></li></ol><p>That\'s all there is to most epilogues.</p><p>Quick side note, you may have heard that nothing on disk is ever actually deleted. When you delete something the OS simply marks that area on disk \nas not being used so the OS knows it can write to that location without overwriting \nanything important. This is why data removal software exists. It will go\n in and fill in the area with zeroes or junk data so the original data is removed. Similarly, nothing gets deleted from the stack by the prologue or epilogue. When the next stack frame is made it will be put right where the old one was and there will still be data there. This is why you should initialize variables upfront, because otherwise, your variable may contain garbage from the previous function/stack frame.<br /></p>', 'taskType': 'none', 'taskNo': 3, 'taskCreated': '2021-09-07T13:46:21.395Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "It's like a play, but there's way more bits.", 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(255, 153, 51,.15);color:#ff9933">Analysis</span> Function Call Sample', 'taskDesc': '<p align="center"><u><b>When running the samples on their own, outside of IDA, run them via the command line.</b></u></p><p>Before you load the program into IDA, I want to quickly repeat a warning. When you are prompted for debug symbols <b>do not </b>do it. This is to maintain realism. If you wish to use debug symbols for further learning on your own, you can load them manually after the program is loaded into IDA. The debug symbols are provided in a folder on the Desktop along with the samples. If you attempt to download symbols IDA may crash.</p><h4><b>Getting Started</b><br /></h4>\n\n<p>Let\'s take a look at a sample that calls a function. For this task use<b> HelloWorld.exe</b>.<span style="font-size:1rem"> It\'s usually a good idea to run the program before doing any reverse engineering, so go ahead and do that. Again, when you run the program do so from a command prompt since the program closes very quickly.<br /></span></p><p><span style="font-size:1rem"></span><span style="font-size:1rem"><span style="font-size:1rem">We are going to start from main(), find it in the function list if IDA doesn\'t navigate to it automatically. </span>The main() function should look something like this:<br /></span></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/059b8317bfc82482e7646b3765f28b9d.PNG" /><span style="font-size:1rem"></span><span style="font-size:1rem"><br /></span></p><p><span style="font-size:1rem"></span><span style="font-size:1rem">Notice the </span><code>sub RSP, 28h</code><span style="font-size:1rem"> at the top. For this function that\'s the entire prologue. It\'s setting up the function by moving the stack pointer and creating a new stack frame area. </span>\n\n</p><h4><u>printf()</u></h4>\n\n<p><span style="font-size:1rem">For now, we will focus on the first function call within main(), which is a call to printf(). IDA does not resolve that this is printf(), so instead, you can identify it as such based on the parameters passed and what it does when the program runs. IDA shows two strings loaded into the first two parameters for the function call. The first parameter (passed via RCX) is the format string "%s\\n", the second parameter (RDX) is the "Hello with..." string. Immediately after the two parameters is the call. In IDA you can rename the sub_### to whatever you want by right-clicking and going to <i>Rename</i>\xa0or by selecting the function and pressing <i>N</i>. Renaming variables and functions is very useful when dealing with bigger projects.</span></p><p><span style="font-size:1rem">That\'s it for the call to printf(). The first parameter is the format string, the second is the "Hello..." string, and printf() makes the magic happen. Feel free to look into printf() more if you\'d like.</span></p>\n\n<h4><u>std::cout</u></h4>\n<p>Now let\'s look at the second function call which is to std::cout.</p><p>We can identify it\'s std::cout without using the string printed to the console because we can see things related to cout, basic_ostream, and char_traits. You may notice the names of the functions are quite odd as displayed in IDA. We will discuss this in the DLL section, but in short, the names are mangled for function overloading. For now, look past the name mangling. With that said, you may not be familiar with those functions so the first thing to do is look them up. Here\'s a brief overview of them all:</p><ul><li>basic_ostream - C++ template for output streams. <a href="https://en.cppreference.com/w/cpp/io/basic_ostream" target="_blank">More info here</a>.</li><li>char_traits - Provides some abstraction from basic character and string types.<br /></li><li>cout - std::cout - Sends text to the console.</li></ul><p>Now to address the elephant in the room. Where is the string that\'s supposed to be printed? Let\'s find it.</p><p>To find our string go to <i>View &gt; Open Subviews &gt; Strings</i> or press <i>Shift + F12</i>. Note that this may take a bit to process. Then look for the string in the list. You can use Ctrl + F to search. Double-click the string in the list and this will bring you to the string where you can see all references to that string. IDA calls these XREFs, short for cross-references.<img /></p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/2beb8a49b216bf582c6eb0426ab4d238.png" /><br /></p><p>The string only has one reference, so double-click it. This will bring you to the location of the string which is in a very large function.</p><p><img style="width:128.953px;height:258.833px" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/4d5c84ea7ec963e86d8c4227f746fbb8.png" /></p><p><img style="width:546.81px;height:119px" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/39b72c7a4549dbe9311ca57b36b25c04.png" /><br /></p><p><img />The string is very clearly not where we would\'ve expected it to be. We can see <code>sputn</code>, which long story short means we\'re dealing with character streams. So what is this massive function and what is it doing? If you go to the top of the function in the listing view you can see what references it. Sure enough, main() references this function. So what\'s going on here? <br /></p><p></p><h4><u>Inlining</u></h4><p></p>\n\n<p>One compiler/linker optimization that makes noticeable changes to the code is inlining. When a function gets inlined it\'s essentially pasted where the call would be instead of making a call. See the following example.</p><p><b>Without </b>Function Inlining:</p>\n\n<pre><code class="language-cpp">int Add(int x, int y){\n    return x+y;\n}\nint main(){\n    int x = RandInt();\n    int res = Add(x, 5)\n}\n</code></pre>\n\n<p><b>With </b>Function Inlining:</p>\n<pre><code class="language-cpp">int main(){\n    int x = RandInt();\n    int res = x + 5;\n}\n</code></pre>\n\n<p>What\'s happening with our string in HelloWorld.exe is similar. Instead of the string being passed as a parameter to std::cout, it\'s directly referenced in std::cout. You may think that this would cause problems because what if std::cout is called to print a different string? You\'d be correct, this would cause problems for further calls to std::cout. As it turns out if std::cout is called more than once you will not see this optimization used. Instead, you will see it used similar to how printf() is used.<br /></p><p><img />I encourage you to write a program to play around with this to develop a deeper understanding of it. You may have noticed that there\'s some interesting stuff with std::cout that I skipped over. In short, it has to do with function overloading, basic_ostream, and streambuf which deals with character streams. If you\'re interested, simple searches of those things will bring you some useful information.<br /></p><p>That concludes the basic function example. It\'s really easy to understand function calls as long as you know the calling convention used. Luckily for x64 Windows it only uses fastcall, but other systems and architectures will likely not be that nice. Be sure to know whatever calling convention you\'re dealing with well, it will make your work much easier.</p><p></p>', 'taskType': 'downloadable', 'taskNo': 4, 'taskCreated': '2021-08-31T22:08:22.660Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '618012ebf25c7e0052344bf2', 'questions': [{'questionNo': 1, 'question': 'In the HelloWorld.exe sample, which instruction sets up the first parameter for the call to printf()? Provide the full instruction as shown in IDA, with single spaces. Example: mov RAX, RBX<br />', 'hint': 'Think back to the x64 Windows calling convention, what register is used to pass the first parameter? Also, look at the comments provided by IDA which show what the parameters are. Which would be the first when using printf()?'}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(255, 153, 51,.15);color:#ff9933">Analysis</span> Loop Sample', 'taskDesc': '<p align="center"><u><b>When running the samples on their own, outside of IDA, run them via the command line.</b></u></p><p><span style="font-size:1rem">It\'s highly encouraged to follow along for this portion in your own VM, as it will make it must easier for you to understand. This task uses <i>Loop.exe</i>. Load it into IDA and go to the main() function. The graph view is highly recommended.</span></p><p><span style="font-size:1rem"></span><span style="font-size:1rem">I\'m also going to state now and multiple times to keep the bigger picture in mind. Don\'t analyze one instruction at a time, it usually requires multiple instructions to perform one high-level action. It\'s also important to point out that we will be making assumptions. You won\'t always know what something is or does, which is why you make your best guess. As you go, use your guess to attempt to understand what\'s going on while at the same time validating/testing your guess. </span></p><p><span style="font-size:1rem"></span><span style="font-size:1rem">At a high level there are three main types of loops used: For, While, and Do-While. When working on a low level you\'ll usually see a do-while and sometimes a while. Keep in mind that a for loop is only an abstracted while loop. When dealing with loops expect to see a counter/iterator register initialized at the beginning and incremented/decremented at the end. The condition for the loop is usually at the end since that\'s when you would determine whether or not to continue the loop. There is often a condition at the start as well which would be a check to skip the entire loop. There may also be conditions within the loop that break/jump out of the loop.</span>\n\n</p><h2>Reversing Our First Loop</h2>\n<p>\n</p><p>Before we throw it into IDA, as always you should run it. After running it the purpose seems to be to get input from the user and count the number of lowercase characters then output the result. Simple enough, you could probably guess how it works without having to do any reversing, but let\'s take a look so we can learn since it won\'t always be that easy.</p><p>Go ahead and load <i>Loop.exe</i> into IDA and go main(). You may notice it\'s quite large. I would encourage you to use graph view, it makes understanding the flow of the program much easier. Once again, press <i>Space</i> to quickly switch between the graph view and the listing view.</p>\n<h4><u>Initial Analysis</u></h4>\n<p>To start let me introduce you to the best skill to develop as a reverse engineer. It\'s being able to skim over the unimportant stuff otherwise you\'ll waste your time and go into a rabbit hole. In the graph view, we can see a big box at the top. Looking at it we can see that it mostly just prints stuff so we can skim through it just to make sure there\'s nothing important. Looking towards the bottom of the big box, which I will refer to as the loop initialization part of the code, we can see some interesting stuff.</p><p><img style="width:645.967px;height:409.365px" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/c589119cfccf744d193afacced918896.png" /><br /></p>\n\n<p></p>\n\n<p>The reason why it\'s interesting is for two main reasons. First, it doesn\'t appear to be printing anything like the previous lines were. Second, there\'s a loop following it which we can quickly identify because of the arrows provided in graph view. Let\'s start our analysis by taking a look at\xa0<code>mov rsi, [rsp+58h+var_20]</code> since it seems to be the start of the difference. <b>Important: </b>Don\'t forget about the code we just skimmed over. If we get lost or need more information (foreshadowing) one of the first things we\'ll do is go back to the code we skimmed over.<br /></p><p>Looking at the move into RSI, RDI, and RDX we don\'t get much since the data is uninitialized. Notice the <code>test RDX, RDX</code> as it can reveal a little extra. Testing a register against itself will test if the register is zero. In this case, if RDX is zero it jumps past the loop because of <code>jz short loc_140001332</code>. Based on this we know that RDX shouldn\'t be zero, since if it is, it appears to fail/skip the loop. Since we are iterating over input we can guess RDX is most likely the length of the string, but it could also be checking if a buffer is empty. One of the nice things about IDA is it can determine if data is a buffer or just a normal data type such as an integer. You can see that two of the moves involve var_##, and another uses rsp+58h+Block. This means that the move into RDI involves a buffer and the moves into RSI and RDX are normal data types. We can now solidify our guess that RDX is the length of the string since the loop is likely to be iterating over the string. We\'ll keep this in mind as we move forward to both verify our guess and better understand what the loop is doing.<br /></p><h4><u>Analyzing The Loop</u></h4><p>\n</p>\n<p>The first thing I like to do is go to the end of the loop to identify the register being used as the counter and the end case for the loop. <b>The key to finding the counter is identifying the register which gets incremented or decremented. </b>The end case for the loop can be identified by a comparison to the counter.<br /></p><p><img style="width:232.967px;height:77.2532px" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/910b9d301441ef6a0a30270a3df34214.png" /><br /></p><p> At the bottom, you can see RCX being incremented then compared to RDX. In other words, the counter is compared to what we assume is the length of the string. Now we know RCX is the counter and the condition between RCX and RDX is the end condition. This also solidifies that RDX is the length of the string.<br /></p><p>Now let\'s look at the first block involved in the loop.</p><p><u><b><span style="font-size:18px">Loop Block 1</span></b></u><br /></p>\n\n<p><img style="width:285.967px;height:104.485px" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/3fe0362521d7e7ccf8b22c91cff107f7.png" /><br /></p>\n\n<p>Once again, you must try to understand multiple instructions together since they likely come together to perform one task.<br /></p><p>We see the <i>address </i>of the buffer (identified because of "Block") being put into RAX, so RAX is how the string will be referenced in the loop.<br /></p><p>What\'s this weird RSI comparison and the <code>cmovnb</code>? The <code>cmovnb</code> instruction is a conditional move if not below. This is saying move RBX into RAX if RSI is not less than 0x10. You could also think of it as if RSI is greater than or equal to 0x10.<br /></p><ul><li>Let\'s find out what RDI is. In the initialization block (the big one) at the bottom, we see that the string buffer is moved into RDI (<code>mov rdi, [rsp+58h+Block]</code>). Since RDI is 8 bytes, the first 8 bytes of the buffer are moved into RDI. Note that, unlike RAX, RDI does not contain the address of the buffer. RAX was given the address because of the <code>lea</code> instruction whereas RDI is given the first 8 bytes (based on the size of the RDI register) of data within the buffer because of a <code>mov</code> instruction.<br /></li><li>Now for RSI. We can see at the bottom of the initialization block that RSI is set to an unknown value (<code>mov rsi, [rsp+58h+var_20]</code>). Keep looking to find what modifies that variable and you will see towards the middle of the first block that it\'s initialized to 0xF (<code>mov [rsp+58h+var_20], 0Fh</code>). Unless RSI or RSP+58h+var_20 are modified elsewhere, the <code>cmovnb</code> will never occur since 0xF <i>is </i>below 0x10.</li><li>So what exactly is all of this doing since it doesn\'t appear to be related to the loop? We will come back to this, for now since it doesn\'t seem to affect the loop we will ignore it.</li></ul><p>Next, there is a comparison between RAX+RCX and 0x61 (ASCII "a") then a jump if less than. \nThis is getting an offset in the string with the distance being the loop\n counter (RCX). The RAX+RCX is the same as string[index] or RAX[RCX] in a high-level language, where RCX is \nthe index/offset that is added to the base address of the string \ncontained in RAX. Now let\'s break that down in a more understandable way. It will compare the current character in the string being iterated over against the character "a". If the current character is less than "a" it will skip to the final block in the loop which will start the next iteration. Otherwise, it will continue to the second block. So the good outcome, in this case, is that the character is greater than or equal to "a" since it wouldn\'t skip to the end of the loop.</p><p>Once again remember the bigger picture. The goal of this program is to count lowercase characters. The behavior we just analyzed makes sense, a lowercase character is not going to be less than the ASCII value of 0x61.<br /></p><p><span style="font-size:16px"><b><u><span style="font-size:18px">Part 2</span></u></b><br /></span></p><p><img style="width:300.967px;height:328.701px" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/1e80c37be90f7b9a26f1c2b85b8fd22b.png" /><span style="font-size:16px"><br /></span></p><p><span style="font-size:16px">The</span> second block does almost the same thing as the first, except it \ncompares the current character against "z". If it\'s greater than then it\n will jump to the end. However, there is something very important that \nis easy to skip. Notice RBX is incremented. The condition in which RBX is incremented is if the current character is <i>not </i>less than "a", and <i>not\n </i>greater than "z". In other words, if it\'s a lower case character (a-z) RBX is incremented! So \nRBX is going to hold the result of how many characters are lower case.</p>Finally,\n at the end of the loop, the loop counter (RCX) is incremented then compared to the length of the string (RDX) and jumps if below to \nthe start of the loop. Otherwise, it continues to the code after the loop.<p></p><p></p><p><span style="font-size:16px"><b><u><span style="font-size:18px">Part 3<br /></span></u></b></span></p><p>Now to look at the rest of the function to see what else there is and maybe find out what was going on with RSI and all of that <code>cmovnb</code> business. First look at the big block after the loop.</p><p><img src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/1763873139b63372893c7e9ec1ca3ac4.png" /><br /></p><p>It appears it is printing the results out as seen when we ran the program. Towards the bottom of the block we see something familiar though, a comparison between RSI and 0x10. If RSI is less than 0x10, it will jump to the function epilogue. Based on this we can assume that RSI and 0x10 have something to do with error handling, possibly input validation or parameter validation. Looking further at the few small blocks at the end of the function it seems the assumption is correct. </p><p><br /><img style="width:515.654px;height:551.367px" src="https://tryhackme-images.s3.amazonaws.com/user-uploads/600dd6c4ac4b18769b2a8cdf/room-content/3c0519a6df526993aba847023492fbd7.png" /></p><p>It further compares RSI and we can see functions related to invalid parameters and freeing memory. Remember earlier when I said a good reverse engineer knows when to skip stuff, this is that time. RSI doesn\'t seem to be tied to the loop or user input, instead, it appears to be generated by the compiler. Because of this, we will avoid the rabbit hole and not dig deep into it, however, feel free to do so if you\'d like.</p><p>That\'s all there is to it! With enough practice and experience, this sort of task could take you a mere few seconds. As a beginner, this sort of thing can be a bit confusing, which is why we broke it down. Ironically, breaking it down can sometimes make it harder to understand which is why it\'s vital to keep the big picture in mind, analyze multiple related instructions together, and make guesses when you need to. Of course, be prepared for your guess to be wrong.<br /></p><p></p><p></p>', 'taskType': 'downloadable', 'taskNo': 5, 'taskCreated': '2021-08-31T22:29:05.951Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '618012ebf25c7e0052344bf2', 'questions': [{'questionNo': 1, 'question': 'In the Loop.exe sample, what instruction is the key to finding out what register is the counter? Provide the full instruction as shown in IDA, with single spaces. For example: dec RAX<br />', 'hint': 'What happens to a counter every iteration of a loop and where can you find it when reverse engineering?'}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(0, 255, 255,.15);color:#00ffff">Explanation</span> Structures', 'taskDesc': '<p>Structures are very common in modern software, especially with Windows. The entire Windows OS is highly object-oriented. The general definition of a structure is a data type that holds multiple pieces of data. To start, let\'s look at arrays which are essentially the most bare-bones data structure you can get.\n</p>\n\n<h4><u>Arrays</u></h4>\n<p>\nArrays store multiple pieces of data which are the same type sequentially in memory. Let\'s say you have an array of 5 integers that starts at the address of 0x4000. The size of the array is 20 bytes since each integer is 4 bytes. The first integer is at 0x4000+0x0, the second is at 0x4000+0x04, and so on. Arrays are usually easy to analyze, like the character array (string) we encountered in the loop task.</p>\n\n<h4><u>Classes</u></h4>\n<p>\nClasses can have multiple pieces of data which are of different types. This is what makes them harder to work with when reversing. To figure out the layout of a class, you will have to do some analysis. You need to figure out not only how many things are in the class, but also their data types. There is quite an extensive number of ways to do this, but it generally comes down to just looking at the functions which use the class and paying close attention to how they use it. We will take a look at reverse engineering a class structure in a future room. For now, I\'ll give you a crash course.\n</p>\n\n<p>\nLet\'s say we have the following class:\n</p>\n\n<p></p><pre><code class="language-cpp">class Human {\npublic:\n\tint age;\n\tfloat height;\n\tchar* name;\n\tHuman(char* newName, int newAge, float newHeight)\n\t\t: age(newAge), height(newHeight), name(newName) {}\n};\n</code></pre><p></p>\n\n<p>\nThis class\'s data will take up 16 bytes. 4 bytes for the age, 4 bytes for the height, and 8 for the name (pointers hold addresses and addresses in x64 are 8 bytes). How would this be identified in assembly? Let\'s say a pointer to the class is contained in RAX, and the address of the class is 0x4000. Here\'s some pseudo-assembly:\n</p>\n\n<p></p><pre><code class="language-asm">mov RAX, 0x4000     ; RAX = Address of the class and the age variable (offset 0)\nlea RBX, [RAX+0x4]  ; RBX = Address of height\nlea RCX, [RAX+0x8]  ; RCX = Address of name\nmov [RAX], 0x32     ; age = 50\nmov [RBX], 0x48     ; height = 72\nmov [RCX], 0x424F42 ; name = "BOB"\n</code></pre><p></p>\n\n<p>\nAs you can see we have the base address stored in RAX, and the items of the class are accessed via offsets. One of the things to pay attention to when dealing with classes is the use of addresses/pointers and the lea instruction. This is done because you usually want to access the data in the class, not a copy of it.\n</p>\n<p>\nDealing with classes is usually not too bad, but sometimes you aren\'t given the full class. For example, it\'s common for some parts of a class to only be referenced once such as some header information, so you have to be careful. Once again we\'ll take a look at an actual structure in a future room.\n</p>', 'taskType': 'none', 'taskNo': 6, 'taskCreated': '2021-08-31T22:32:35.505Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Structures are everywhere, be ready for them!<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(0, 255, 255,.15);color:#00ffff">Explanation</span> DLL', 'taskDesc': '<p>The process for reverse engineering a DLL is mostly the same as executables, but they are usually easier since you can see more function names. It\'s also more common to see debug symbols provided with DLLs than it is to see them with executables.</p>\n\n<h4><u>Imports, Exports, Modules</u></h4>\n<p>You\'ve probably seen many function names that are all nonsense. As mentioned earlier, most function names do not survive through compilation since they are just there for human understanding. You may, however, notice that some names do exist. This could be because of two main reasons. </p><ul><li>First, the tool recognizes the function and names it accordingly. IDA does this with FLIRT (Fast Library Identification and Recognition Technology) signatures. FLIRT signatures are used to identify standard library functions. The general idea of how they work is they search memory for a chunk of bytes that match a known chunk of bytes in a standard library function. Once a match is found, the function can be named accordingly. You can learn more about FLIRT signatures on the <a href="https://hex-rays.com/products/ida/tech/flirt/in_depth/" target="_blank">IDA/Hex-Rays website</a>. The main() function is a little more difficult since its signature is different for every program. However, IDA can still sometimes find it using some tricks. One commonality of the main() function is that it\'s called from the program entry point, usually towards the end. There\'s also usually a test against the return value of main() to determine if anything other than zero was returned. You can use that knowledge to help find the main() function, and there are several other ways as well. I won\'t get into this here as it can get quite long and advanced. I highly encourage you to do your own research on this.<br /></li><li>Second, its name may be preserved because it\'s imported from or exported by a DLL. For a developer to use a function from a DLL the developer needs to know and be able to resolve the name of the function they want. Because of this, the names have to stay intact. The DLL can expose its function names through the DLL/PE header, library file, or header file (.h or .hpp). The library and header files are not required, but they are usually included.</li></ul><p><b>Imports</b> are the functions the executable is using/importing from a DLL, and <b>exports</b> are the functions a DLL provides/exports. DLL\'s are known as dynamic-link libraries since they are loaded into memory once and can be loaded into any number of processes at any time without making any more copies. The Windows OS is built on DLLs.</p><p><b>Modules </b>are essentially anything related to a process that import or export functions. For example, Loop.exe includes modules such as ntdll.dll, kernel32.dll, etc. If you were to run Loop.exe, while it is running Loop.exe itself is considered a module of the process.<br /></p><h4><u>Name Mangling/Decoration</u></h4>\n<p>C++ function overloading allows you to have two different functions with the same names that take different parameters. This becomes a problem when a DLL is exporting functions since the exported names will be the same. For developers, this problem is solved by using libraries and header files. On a lower level, this problem is solved by mangling the names so they are unique. <i><u><b>ALL</b></u> </i>exported <b>C++</b> function names get mangled whether they have overrides or not.<br /></p><p>Function mangling is also called function decoration, which is probably a more appropriate name just not as popular. Although the mangled names may look like random garbage, there is a method to the madness. Here is an example of a mangled function name: <code>??0?$_Yarn@D@std@@QEAA@PEBD@Z</code>. As random as it may seem, it can be decoded. By de-mangling the name you can find the function type and parameter types.  Different compilers use different mangling schemes, in this series of rooms everything uses the Microsoft C++ compiler and mangling scheme. You don\'t need to know how the schemes work since reverse engineering tools can decode them, but if you\'d like here are some links.<br /></p><p>Microsoft C++ Mangling Scheme: <a href="http://mearie.org/documents/mscmangle/" target="_blank">http://mearie.org/documents/mscmangle/</a><br />More Mangling Schemes: <a href="https://en.wikipedia.org/wiki/Name_mangling" target="_blank">https://en.wikipedia.org/wiki/Name_mangling</a><br /></p><p>Side note for the programmers out there. Putting <code>extern "C"</code> before a function makes it use C linkage, thus removing the name mangling. This does prevent you from overloading the function.<br /></p>\n\n<h4><u>Running DLL</u></h4>\n<p>When reverse engineering a DLL you may want to run it so you can analyze it in a debugger. This presents an obvious problem, you can\'t simply run a DLL. Here\'s a bit more detail on how DLLs work.</p><p>When a DLL is loaded, the function DllMain() is executed within the context of the process which loads the DLL. Here the DLL can run whatever code it wants.</p><p>You may have heard of DLL injection, this is one way it can be done. You can get the target process to call LoadLibrary() on your DLL which will cause DllMain() within your DLL to be executed within the context of the target process.</p><p>There\'s a program that comes with Windows called rundll32.exe which does pretty much that, it just loads your DLL making DllMain() execute. As a developer, you can make rundll32.exe execute functions within the DLL, but I don\'t think anyone does this.<br /></p><p>For reverse engineers, what if we want to dynamically analyze a function within a DLL? The best way to do this is to write your own code which calls the function you\'re interested in. Without a library or header file, here\'s one way (there\'s probably a more elegant way) in which you could call a function within a DLL with only the .dll file. This does not include any error handling, it\'s only the code of interest. It\'s a call to a function called Add() within the DLL named DLL.DLL:<br /></p>\n<pre><code class="lang-cpp">HMODULE dll = LoadLibraryA("DLL.DLL");\ntypedef void(WINAPI* Add_TypeDef)(int, int); // Add(int x, int y)\nAdd_TypeDef Add = (Add_TypeDef)GetProcAddress(dll, "Add_MangledName");\nAdd(1, 2);\n</code></pre>\n<p>Unless you have a header or library file, you will likely need to reverse engineer the function to find out what parameters are passed to it.</p><p>That\'s all there is to DLLs since other than all of that they are the same as executables when it comes to reverse engineering.<br /></p>', 'taskType': 'none', 'taskNo': 7, 'taskCreated': '2021-08-31T22:34:59.481Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'A DLL is an executable on easy mode.<br />', 'hint': ''}]}, {'taskTitle': 'Conclusion', 'taskDesc': '<p>That\'s the basic hands-on introduction to reverse engineering Windows, hope you enjoyed it! Hopefully, you are somewhat more comfortable with reverse engineering software now that you have seen it and had the opportunity to be hands-on. Next room we will finally get into some real reverse engineering taking a look at a set of functions exported by NTDLL. It\'s going to be quite a step up but I think it\'ll be a great way to learn. For those who are interested, we will then use our knowledge to write code that uses the functions. Trust me when I say reverse engineering can be a bit of a drag to learn, but it\'s much more fun once you finally know what you are doing and can start researching on your own.</p><p>Here are some places you can learn more about IDA:</p><ul><li><a href="https://www.youtube.com/playlist?list=PLKwUZp9HwWoDDBPvoapdbJ1rdofowT67z" target="_blank">https://www.youtube.com/playlist?list=PLKwUZp9HwWoDDBPvoapdbJ1rdofowT67z</a></li><li><a href="https://www.youtube.com/watch?v=tt15P5Om3Zg" target="_blank">https://www.youtube.com/watch?v=tt15P5Om3Zg</a><a href="https://www.youtube.com/watch?v=tt15P5Om3Zg" target="_blank"></a></li><li><a href="https://hex-rays.com/products/ida/tech/flirt/in_depth/" target="_blank">https://hex-rays.com/products/ida/tech/flirt/in_depth/</a></li></ul><p>If you have the time I\'d recommend looking into Ghidra and, if you plan on sticking with Windows, x64dbg. Ghidra is a great alternative to IDA, just not as mature. The nicest thing about Ghidra over IDA is the price. Ghidra is free, IDA is expensive. So far we\'ve been using IDA Freeware which is great but there are some serious limitations. With a price tag of free, Ghidra supports loads of architectures and is written in Java so it runs on pretty much anything. Its decompiler is pretty good, I do think the decompiler IDA has is better though.</p><p>See you in the next room!<br /></p>', 'taskType': 'none', 'taskNo': 8, 'taskCreated': '2021-09-01T15:01:43.419Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '\n                                Go forth and do great things!', 'hint': ''}]}]}